STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/ll/stm32u5xx_ll_flash.h
/**
  **********************************************************************************************************************
  * @file    stm32u5xx_ll_flash.h
  * @brief   Header file of FLASH LL module.
  **********************************************************************************************************************
  * @attention
  *
  * Copyright (c) 2021-2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  **********************************************************************************************************************
  */


/* Define to prevent recursive inclusion -----------------------------------------------------------------------------*/
#ifndef STM32U5XX_LL_FLASH_H
#define STM32U5XX_LL_FLASH_H

#ifdef __cplusplus
extern "C" {
#endif /* __cplusplus */

/* Includes ----------------------------------------------------------------------------------------------------------*/
#include "stm32u5xx.h"

/** @addtogroup STM32U5xx_LL_Driver
  * @{
  */
/** @defgroup FLASH_LL FLASH
  * @{
  */

#if defined (FLASH)

/** @defgroup FLASH_LL_Exported_Constants FLASH Exported Constants
  * @{
  */

/** @defgroup FLASH_Interrupt FLASH Interrupt
  * @{
  */
#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
#define LL_FLASH_IT_EOP FLASH_SECCR_EOPIE                       /*!< LL FLASH Secure end of operation interrupt */
#define LL_FLASH_IT_ERR FLASH_SECCR_ERRIE                       /*!< LL FLASH Secure operation error interrupt  */
#define LL_FLASH_IT_ALL (FLASH_SECCR_EOPIE | FLASH_SECCR_ERRIE) /*!< LL FLASH All Secure interrupts             */
#else
#define LL_FLASH_IT_EOP FLASH_NSCR_EOPIE                      /*!< LL FLASH Non-Secure end of operation interrupt */
#define LL_FLASH_IT_ERR FLASH_NSCR_ERRIE                      /*!< LL FLASH Non-Secure operation error interrupt  */
#define LL_FLASH_IT_ALL (FLASH_NSCR_EOPIE | FLASH_NSCR_ERRIE) /*!< LL FLASH All Non-Secure interrupts             */
#endif /* __ARM_FEATURE_CMSE */
/**
  * @}
  */

/** @defgroup FLASH_Errors FLASH Errors
  * @{
  */
#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
#define LL_FLASH_FLAG_EOP        FLASH_SECSR_EOP      /*!< LL FLASH Secure end of operation            */
#define LL_FLASH_FLAG_OPERR      FLASH_SECSR_OPERR    /*!< LL FLASH Secure operation error             */
#define LL_FLASH_FLAG_PROGERR    FLASH_SECSR_PROGERR  /*!< LL FLASH Secure programming error           */
#define LL_FLASH_FLAG_WRPERR     FLASH_SECSR_WRPERR   /*!< LL FLASH Secure write protection error      */
#define LL_FLASH_FLAG_PGAERR     FLASH_SECSR_PGAERR   /*!< LL FLASH Secure programming alignment error */
#define LL_FLASH_FLAG_SIZERR     FLASH_SECSR_SIZERR   /*!< LL FLASH Secure size error                  */
#define LL_FLASH_FLAG_PGSERR     FLASH_SECSR_PGSERR   /*!< LL FLASH Secure programming sequence error  */
#define LL_FLASH_FLAG_BSY        FLASH_SECSR_BSY      /*!< LL FLASH Secure busy                        */
#define LL_FLASH_FLAG_WDW        FLASH_SECSR_WDW      /*!< LL FLASH Secure wait data to write          */
#define LL_FLASH_FLAG_ERRORS_ALL (FLASH_SECSR_OPERR  | FLASH_SECSR_PROGERR | FLASH_SECSR_WRPERR | \
                                  FLASH_SECSR_PGAERR | FLASH_SECSR_SIZERR  | FLASH_SECSR_PGSERR)
#define LL_FLASH_FLAG_ALL        (FLASH_SECSR_EOP | LL_FLASH_FLAG_ERRORS_ALL)
#else
#define LL_FLASH_FLAG_EOP        FLASH_NSSR_EOP       /*!< LL FLASH Non-Secure end of operation            */
#define LL_FLASH_FLAG_OPERR      FLASH_NSSR_OPERR     /*!< LL FLASH Non-Secure operation error             */
#define LL_FLASH_FLAG_PROGERR    FLASH_NSSR_PROGERR   /*!< LL FLASH Non-Secure programming error           */
#define LL_FLASH_FLAG_WRPERR     FLASH_NSSR_WRPERR    /*!< LL FLASH Non-Secure write protection error      */
#define LL_FLASH_FLAG_PGAERR     FLASH_NSSR_PGAERR    /*!< LL FLASH Non-Secure programming alignment error */
#define LL_FLASH_FLAG_SIZERR     FLASH_NSSR_SIZERR    /*!< LL FLASH Non-Secure size error                  */
#define LL_FLASH_FLAG_PGSERR     FLASH_NSSR_PGSERR    /*!< LL FLASH Non-Secure programming sequence error  */
#define LL_FLASH_FLAG_BSY        FLASH_NSSR_BSY       /*!< LL FLASH Non-Secure busy                        */
#define LL_FLASH_FLAG_WDW        FLASH_NSSR_WDW       /*!< LL FLASH Non-Secure wait data to write          */
#define LL_FLASH_FLAG_ERRORS_ALL (FLASH_NSSR_OPERR  | FLASH_NSSR_PROGERR | FLASH_NSSR_WRPERR | FLASH_NSSR_PGAERR | \
                                  FLASH_NSSR_SIZERR | FLASH_NSSR_PGSERR  | FLASH_NSSR_OPTWERR)
#define LL_FLASH_FLAG_ALL        (FLASH_NSSR_EOP | LL_FLASH_FLAG_ERRORS_ALL)
#endif /* __ARM_FEATURE_CMSE */

#define LL_FLASH_FLAG_OPTWERR    FLASH_NSSR_OPTWERR   /*!< LL FLASH Option bytes write error  */
#define LL_FLASH_FLAG_PD1        FLASH_NSSR_PD1       /*!< LL FLASH Bank 1 in power-down mode */
#define LL_FLASH_FLAG_PD2        FLASH_NSSR_PD2       /*!< LL FLASH Bank 2 in power-down mode */

#define LL_FLASH_FLAG_ECCC       FLASH_ECCR_ECCC      /*!< LL FLASH ECC single error                */
#define LL_FLASH_FLAG_ECCD       FLASH_ECCR_ECCD      /*!< LL FLASH ECC double error                */
#define LL_FLASH_FLAG_ECCIE      FLASH_ECCR_ECCIE     /*!< LL FLASH ECC correction interrupt enable */
#define LL_FLASH_FLAG_BK_ECC     FLASH_ECCR_BK_ECC    /*!< LL FLASH ECC bank fail                   */
#define LL_FLASH_FLAG_SYSF_ECC   FLASH_ECCR_SYSF_ECC  /*!< LL FLASH ECC System fail                 */
#define LL_FLASH_FLAG_ADDR_ECC   FLASH_ECCR_ADDR_ECC  /*!< LL FLASH ECC fail address                */
#define LL_FLASH_FLAG_ECC_ALL    (FLASH_ECCR_ECCC | FLASH_ECCR_ECCD | FLASH_ECCR_ECCIE | FLASH_ECCR_BK_ECC | \
                                  FLASH_ECCR_SYSF_ECC | FLASH_ECCR_ADDR_ECC)

#define LL_FLASH_FLAG_ADDR_OP    FLASH_OPSR_ADDR_OP   /*!< LL FLASH Interrupted operation address         */
#define LL_FLASH_FLAG_BK_OP      FLASH_OPSR_BK_OP     /*!< LL FLASH Interrupted operation bank            */
#define LL_FLASH_FLAG_SYSF_OP    FLASH_OPSR_SYSF_OP   /*!< LL FLASH Interrupted operation in System Flash */
#define LL_FLASH_FLAG_CODE_OP    FLASH_OPSR_CODE_OP   /*!< LL FLASH Interrupted operation code            */
#define LL_FLASH_FLAG_OP_ALL     (LL_FLASH_FLAG_ADDR_OP | LL_FLASH_FLAG_BK_OP | LL_FLASH_FLAG_SYSF_OP | \
                                  LL_FLASH_FLAG_CODE_OP)

/**
  * @}
  */

/** @defgroup FLASH_Latency FLASH Latency
  * @{
  */
#define LL_FLASH_LATENCY_0WS  FLASH_ACR_LATENCY_0WS  /*!< LL FLASH Zero wait state      */
#define LL_FLASH_LATENCY_1WS  FLASH_ACR_LATENCY_1WS  /*!< LL FLASH One wait state       */
#define LL_FLASH_LATENCY_2WS  FLASH_ACR_LATENCY_2WS  /*!< LL FLASH Two wait states      */
#define LL_FLASH_LATENCY_3WS  FLASH_ACR_LATENCY_3WS  /*!< LL FLASH Three wait states    */
#define LL_FLASH_LATENCY_4WS  FLASH_ACR_LATENCY_4WS  /*!< LL FLASH Four wait states     */
#define LL_FLASH_LATENCY_5WS  FLASH_ACR_LATENCY_5WS  /*!< LL FLASH Five wait state      */
#define LL_FLASH_LATENCY_6WS  FLASH_ACR_LATENCY_6WS  /*!< LL FLASH Six wait state       */
#define LL_FLASH_LATENCY_7WS  FLASH_ACR_LATENCY_7WS  /*!< LL FLASH Seven wait states    */
#define LL_FLASH_LATENCY_8WS  FLASH_ACR_LATENCY_8WS  /*!< LL FLASH Eight wait states    */
#define LL_FLASH_LATENCY_9WS  FLASH_ACR_LATENCY_9WS  /*!< LL FLASH Nine wait states     */
#define LL_FLASH_LATENCY_10WS FLASH_ACR_LATENCY_10WS /*!< LL FLASH Ten wait state       */
#define LL_FLASH_LATENCY_11WS FLASH_ACR_LATENCY_11WS /*!< LL FLASH Eleven wait state    */
#define LL_FLASH_LATENCY_12WS FLASH_ACR_LATENCY_12WS /*!< LL FLASH Twelve wait states   */
#define LL_FLASH_LATENCY_13WS FLASH_ACR_LATENCY_13WS /*!< LL FLASH Thirteen wait states */
#define LL_FLASH_LATENCY_14WS FLASH_ACR_LATENCY_14WS /*!< LL FLASH Fourteen wait states */
#define LL_FLASH_LATENCY_15WS FLASH_ACR_LATENCY_15WS /*!< LL FLASH Fifteen wait states  */
/**
  * @}
  */

/** @defgroup FLASH_Power_Down_Run_Bank_Selection FLASH Power Down Run Bank Selection
  * @{
  */
#define LL_FLASH_PWR_DOWN_RUN_BANK_1 FLASH_ACR_PDREQ1 /*!< LL FLASH Power down run bank 1 */
#define LL_FLASH_PWR_DOWN_RUN_BANK_2 FLASH_ACR_PDREQ2 /*!< LL FLASH Power down run bank 2 */
/**
  * @}
  */

/** @defgroup FLASH_Power_Sleep_Mode FLASH Power Sleep Mode
  * @{
  */
#define LL_FLASH_IDLE_SLEEP_MODE     0x00000000U        /*!< LL FLASH in idle mode during sleep mode       */
#define LL_FLASH_PWR_DOWN_SLEEP_MODE FLASH_ACR_SLEEP_PD /*!< LL FLASH in power down mode during sleep mode */
/**
  * @}
  */

/** @defgroup FLASH_Unlock_Keys FLASH Unlock Keys
  * @{
  */
#define LL_FLASH_KEY1 0x45670123U /*!< LL FLASH key1 */
#define LL_FLASH_KEY2 0xCDEF89ABU /*!< LL FLASH key2 */
/**
  * @}
  */

