STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/ll/stm32u5xx_ll_flash.h
/** @defgroup FLASH_OB_Unlock_Keys FLASH OB Unlock Keys
  * @{
  */
#define LL_FLASH_OB_OPTKEY1 0x08192A3BU /*!< LL FLASH option byte key1 */
#define LL_FLASH_OB_OPTKEY2 0x4C5D6E7FU /*!< LL FLASH option byte key2 */
/**
  * @}
  */

/** @defgroup FLASH_Power_Down_Keys FLASH Power Down Keys
  * @{
  */
#define LL_FLASH_PDKEY1_1 0x04152637U /*!< LL FLASH Bank 1 power down key1 */
#define LL_FLASH_PDKEY1_2 0xFAFBFCFDU /*!< LL FLASH Bank 1 power down key2 */
#define LL_FLASH_PDKEY2_1 0x40516273U /*!< LL FLASH Bank 2 power down key1 */
#define LL_FLASH_PDKEY2_2 0xAFBFCFDFU /*!< LL FLASH Bank 2 power down key2 */
/**
  * @}
  */

/** @defgroup FLASH_Bank_Selection FLASH Bank Selection
  * @{
  */
#define LL_FLASH_BANK_1 0x00U /*!< LL FLASH bank 1 */
#define LL_FLASH_BANK_2 0x04U /*!< LL FLASH bank 2 */
/**
  * @}
  */

/** @defgroup FLASH_OB_Bank_Area_Selection FLASH Option bytes Bank Area Selection
  * @{
  */
#define LL_FLASH_OB_BANK_AREA_A 0x0U /*!< LL FLASH Option bytes Bank Area A */
#define LL_FLASH_OB_BANK_AREA_B 0x1U /*!< LL FLASH Option bytes Bank Area B */
/**
  * @}
  */

/** @defgroup FLASH_Page_Erase_Bank_Selection FLASH Page Erase Bank Selection
  * @{
  */
#define LL_FLASH_PAGE_ERASE_BANK_1 0x00000000U     /*!< LL FLASH Page erase bank 1 */
#define LL_FLASH_PAGE_ERASE_BANK_2 FLASH_NSCR_BKER /*!< LL FLASH Page erase bank 2 */
/**
  * @}
  */

/** @defgroup FLASH_Mass_Erase_Bank_Selection FLASH Mass Erase Bank Selection
  * @{
  */
#define LL_FLASH_MASS_ERASE_BANK_1 FLASH_NSCR_MER1                       /*!< LL FLASH Mass erase bank 1   */
#define LL_FLASH_MASS_ERASE_BANK_2 FLASH_NSCR_MER2                       /*!< LL FLASH Mass erase bank 2   */
#define LL_FLASH_MASS_ERASE_BANK_ALL (FLASH_NSCR_MER1 | FLASH_NSCR_MER2) /*!< LL FLASH Mass erase all bank */
/**
  * @}
  */

/** @defgroup FLASH_Program_Mode_Selection FLASH Program Mode Selection
  * @{
  */
#define LL_FLASH_PROGRAM_QUADWORD_MODE 0x00000000U    /*!< LL FLASH programming by quadword mode */
#define LL_FLASH_PROGRAM_BURST_MODE    FLASH_NSCR_BWR /*!< LL FLASH programming by burst mode    */
/**
  * @}
  */

#if defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
/** @defgroup FLASH_Security_Inversion FLASH Security Inversion
  * @{
  */
#define LL_FLASH_SEC_NOT_INVERTED 0x00000000U     /*!< LL FLASH Security state not inverted */
#define LL_FLASH_SEC_INVERTED     FLASH_SECCR_INV /*!< LL FLASH Security state inverted     */
/**
  * @}
  */
#endif /* __ARM_FEATURE_CMSE */

/** @defgroup FLASH_Interrupted_Operation_Code FLASH Interrupted Operation Code
  * @{
  */
#define LL_FLASH_INTERRUPTED_NO_OPERATION 0x00000000U /*!< LL FLASH interrupted no operation        */
#define LL_FLASH_INTERRUPTED_SINGLE_WRITE 0x20000000U /*!< LL FLASH interrupted single write        */
#define LL_FLASH_INTERRUPTED_BURST_WRITE  0x40000000U /*!< LL FLASH interrupted burst write         */
#define LL_FLASH_INTERRUPTED_PAGE_ERASE   0x60000000U /*!< LL FLASH interrupted page erase          */
#define LL_FLASH_INTERRUPTED_BANK_ERASE   0x80000000U /*!< LL FLASH interrupted bank erase          */
#define LL_FLASH_INTERRUPTED_MASS_ERASE   0xA0000000U /*!< LL FLASH interrupted mass erase          */
#define LL_FLASH_INTERRUPTED_OB_CHANGE    0xC0000000U /*!< LL FLASH interrupted option bytes change */
/**
  * @}
  */

/** @defgroup FLASH_OB_Read_Protection_Level FLASH OB Read Protection Level
  * @{
  */
#define LL_FLASH_OB_RDP_LEVEL_0   0xAAU /*!< LL FLASH option bytes RDP level 0   */
#define LL_FLASH_OB_RDP_LEVEL_0_5 0x55U /*!< LL FLASH option bytes RDP level 0.5 */
#define LL_FLASH_OB_RDP_LEVEL_1   0xBBU /*!< LL FLASH option bytes RDP level 1   */
#define LL_FLASH_OB_RDP_LEVEL_2   0xCCU /*!< LL FLASH option bytes RDP level 2   */
/**
  * @}
  */

/** @defgroup FLASH_OB_OEM_Selection FLASH Option bytes OEM Selection
  * @{
  */
#define LL_FLASH_OB_OEM_1 0x0U /*!< LL FLASH option bytes OEM 1 */
#define LL_FLASH_OB_OEM_2 0x2U /*!< LL FLASH option bytes OEM 2 */
/**
  * @}
  */

/** @defgroup FLASH_OB_BOR_Level FLASH OB BOR Level
  * @{
  */
#define LL_FLASH_OB_BOR_LEVEL_0 0x000U /*!< LL FLASH Reset level threshold is around 1.7V */
#define LL_FLASH_OB_BOR_LEVEL_1 0x100U /*!< LL FLASH Reset level threshold is around 2.0V */
#define LL_FLASH_OB_BOR_LEVEL_2 0x200U /*!< LL FLASH Reset level threshold is around 2.2V */
#define LL_FLASH_OB_BOR_LEVEL_3 0x300U /*!< LL FLASH Reset level threshold is around 2.5V */
#define LL_FLASH_OB_BOR_LEVEL_4 0x400U /*!< LL FLASH Reset level threshold is around 2.8V */
/**
  * @}
  */

/** @defgroup FLASH_OB_Reset_Generation_Stop_Mode FLASH OB Reset Generation Stop Mode
  * @{
  */
#define LL_FLASH_OB_RST_STOP_MODE    0x00000000U          /*!< LL FLASH option bytes reset in stop mode    */
#define LL_FLASH_OB_NO_RST_STOP_MODE FLASH_OPTR_nRST_STOP /*!< LL FLASH option bytes no reset in stop mode */
/**
  * @}
  */

/** @defgroup FLASH_OB_Reset_Generation_Standby_Mode FLASH OB Reset Generation standby Mode
  * @{
  */
#define LL_FLASH_OB_RST_STDBY_MODE    0x00000000U           /*!< LL FLASH option bytes reset in standby mode    */
#define LL_FLASH_OB_NO_RST_STDBY_MODE FLASH_OPTR_nRST_STDBY /*!< LL FLASH option bytes no reset in standby mode */
/**
  * @}
  */

/** @defgroup FLASH_OB_Reset_Generation_shutdown_Mode FLASH OB Reset Generation shutdown Mode
  * @{
  */
#define LL_FLASH_OB_RST_SHDW_MODE    0x00000000U          /*!< LL FLASH option bytes reset in shutdown mode    */
#define LL_FLASH_OB_NO_RST_SHDW_MODE FLASH_OPTR_nRST_SHDW /*!< LL FLASH option bytes no reset in shutdown mode */
/**
  * @}
  */

/** @defgroup FLASH_OB_Erase_Sram_System_Reset FLASH OB Erase Sram System Reset
  * @{
  */
#define LL_FLASH_OB_ERASED_SRAM_SYS_RST     0x00000000U         /*!< LL FLASH OB erased sram in sys reset */
#define LL_FLASH_OB_NOT_ERASED_SRAM_SYS_RST FLASH_OPTR_SRAM_RST /*!< LL FLASH OB not erased sram in sys reset */
/**
  * @}
  */

/** @defgroup FLASH_OB_IWDG_HW_SW_Selection FLASH OB IWDG HW SW Selection
  * @{
  */
#define LL_FLASH_OB_IWDG_HW 0x00000000U        /*!< LL FLASH OB IWDG Hardware selection */
#define LL_FLASH_OB_IWDG_SW FLASH_OPTR_IWDG_SW /*!< LL FLASH OB IWDG Software selection */
/**
  * @}
  */

