STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/ll/stm32u5xx_ll_flash.h
/** @defgroup FLASH_OB_WWDG_HW_SW_Selection FLASH OB WWDG HW SW Selection
  * @{
  */
#define LL_FLASH_OB_WWDG_HW 0x00000000U        /*!< LL FLASH OB WWDG Hardware selection */
#define LL_FLASH_OB_WWDG_SW FLASH_OPTR_WWDG_SW /*!< LL FLASH OB WWDG Software selection */
/**
  * @}
  */

/** @defgroup FLASH_OB_Swap_Bank FLASH OB Swap Bank
  * @{
  */
#define LL_FLASH_OB_BANK_NOT_SWAPPED 0x00000000U          /*!< LL FLASH OB Bank not swapped */
#define LL_FLASH_OB_BANK_SWAPPED     FLASH_OPTR_SWAP_BANK /*!< LL FLASH OB Bank swapped     */
/**
  * @}
  */

/** @defgroup FLASH_OB_Single_Dual_Bank FLASH OB Single Dual Bank
  * @{
  */
#define LL_FLASH_OB_SINGLE_BANK 0x00000000U          /*!< LL FLASH OB Single bank */
#define LL_FLASH_OB_DUAL_BANK   FLASH_OPTR_DUALBANK  /*!< LL FLASH OB Dual bank   */
/**
  * @}
  */

/** @defgroup FLASH_OB_Erase_Sram2_System_Reset FLASH OB Erase Sram2 System Reset
  * @{
  */
#define LL_FLASH_OB_ERASED_SRAM2_SYS_RST     0x00000000U          /*!< LL FLASH OB Erased sram2 upon system reset */
#define LL_FLASH_OB_NOT_ERASED_SRAM2_SYS_RST FLASH_OPTR_SRAM2_RST /*!< LL FLASH OB Not erased sram2 upon system reset */
/**
  * @}
  */

/** @defgroup FLASH_OB_Boot0_Selection FLASH OB Boot0 Selection
  * @{
  */
#define LL_FLASH_OB_BOOT0_NBOOTBIT 0x00000000U         /*!< LL FLASH OB Boot0 NBOOT0  */
#define LL_FLASH_OB_BOOT0_BOOTPIN  FLASH_OPTR_nSWBOOT0 /*!< LL FLASH OB Boot0 BOOTPIN */
/**
  * @}
  */

/** @defgroup FLASH_OB_NBOOT0_Option FLASH OB NBOOT0 Option
  * @{
  */
#define LL_FLASH_OB_BOOT0_LOW  0x00000000U       /*!< LL FLASH OB NBOOT0 0 */
#define LL_FLASH_OB_BOOT0_HIGH FLASH_OPTR_nBOOT0 /*!< LL FLASH OB NBOOT0 1 */
/**
  * @}
  */

/** @defgroup FLASH_OB_Address_Selection FLASH Option bytes Address Selection
  * @{
  */
#define LL_FLASH_OB_ADDR_0 0x0U /*!< LL FLASH OB Address 1 */
#define LL_FLASH_OB_ADDR_1 0x1U /*!< LL FLASH OB Address 2 */
/**
  * @}
  */

/** @defgroup FLASH_OB_Bank_Group_Selection FLASH OB Bank Group Selection
  * @{
  */
#define LL_FLASH_BANK_GRP1 0x00U /*!< LL FLASH OB Bank group 1 */
#if defined (SRAM3_BASE)
#define LL_FLASH_BANK_GRP2 0x01U /*!< LL FLASH OB Bank group 2 */
#define LL_FLASH_BANK_GRP3 0x02U /*!< LL FLASH OB Bank group 3 */
#define LL_FLASH_BANK_GRP4 0x03U /*!< LL FLASH OB Bank group 4 */
#endif /* SRAM3_BASE */
#if defined (SRAM5_BASE)
#define LL_FLASH_BANK_GRP5 0x04U /*!< LL FLASH OB Bank group 5 */
#define LL_FLASH_BANK_GRP6 0x05U /*!< LL FLASH OB Bank group 6 */
#define LL_FLASH_BANK_GRP7 0x06U /*!< LL FLASH OB Bank group 7 */
#define LL_FLASH_BANK_GRP8 0x07U /*!< LL FLASH OB Bank group 8 */
#endif /* SRAM5_BASE */
/**
  * @}
  */

/** @defgroup FLASH_OB_Hide_Protection_Access_Bank FLASH OB Hide Protection Access Bank
  * @{
  */
#define LL_FLASH_HDP_ACCESS_BANK_1 FLASH_SECHDPCR_HDP1_ACCDIS /*!< LL FLASH OB HDP access bank 1 */
#define LL_FLASH_HDP_ACCESS_BANK_2 FLASH_SECHDPCR_HDP2_ACCDIS /*!< LL FLASH OB HDP access bank 2 */
/**
  * @}
  */

/**
  * @}
  */

/* Exported macro ----------------------------------------------------------------------------------------------------*/
/** @defgroup FLASH_LL_Exported_Macros FLASH Exported Macros
  * @{
  */

/**
  * @brief  Write a value in FLASH register.
  * @param  FLASH instance.
  * @param  reg   Register to be written.
  * @param  value Value to be written in the register.
  */
#define LL_FLASH_WRITE_REG(instance, reg, value) WRITE_REG(instance->reg, (value))

/**
  * @brief  Read a value from FLASH register
  * @param  FLASH instance.
  * @param  reg      Register to be read
  * @retval Register value
  */
#define LL_FLASH_READ_REG(instance, reg) READ_REG(instance->reg)


/**
  * @brief  Read a bits value from FLASH register
  * @param  FLASH instance.
  * @param  reg Register to be read
  * @param  msk Mask to be read
  * @retval Register value
  */
#define LL_FLASH_READ_BIT(instance, reg, msk) READ_REG(instance->reg & msk)

/**
  * @}
  */

/* Exported functions ------------------------------------------------------------------------------------------------*/

/** @defgroup FLASH_LL_Exported_Functions FLASH Exported Functions
  * @{
  */

/**
  * @brief  Set Flash latency.
  * @rmtoll
  *  ACR           LATENCY           LL_FLASH_SetLatency
  * @param  FLASH instance.
  * @param  latency
  *         This parameter can be one of the following values:
  *         @arg @ref LL_FLASH_LATENCY_0WS
  *         @arg @ref LL_FLASH_LATENCY_1WS
  *         @arg @ref LL_FLASH_LATENCY_2WS
  *         @arg @ref LL_FLASH_LATENCY_3WS
  *         @arg @ref LL_FLASH_LATENCY_4WS
  *         @arg @ref LL_FLASH_LATENCY_5WS
  *         @arg @ref LL_FLASH_LATENCY_6WS
  *         @arg @ref LL_FLASH_LATENCY_7WS
  *         @arg @ref LL_FLASH_LATENCY_8WS
  *         @arg @ref LL_FLASH_LATENCY_9WS
  *         @arg @ref LL_FLASH_LATENCY_10WS
  *         @arg @ref LL_FLASH_LATENCY_11WS
  *         @arg @ref LL_FLASH_LATENCY_12WS
  *         @arg @ref LL_FLASH_LATENCY_13WS
  *         @arg @ref LL_FLASH_LATENCY_14WS
  *         @arg @ref LL_FLASH_LATENCY_15WS
  */
__STATIC_INLINE void LL_FLASH_SetLatency(FLASH_TypeDef *flashx, uint32_t latency)
{
  MODIFY_REG(flashx->ACR, FLASH_ACR_LATENCY, latency);
}

/**
  * @brief  Get Flash latency.
  * @rmtoll
  * @param  FLASH instance.
  *  ACR           LATENCY           LL_FLASH_GetLatency
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_FLASH_LATENCY_0WS
  *         @arg @ref LL_FLASH_LATENCY_1WS
  *         @arg @ref LL_FLASH_LATENCY_2WS
  *         @arg @ref LL_FLASH_LATENCY_3WS
  *         @arg @ref LL_FLASH_LATENCY_4WS
  *         @arg @ref LL_FLASH_LATENCY_5WS
  *         @arg @ref LL_FLASH_LATENCY_6WS
  *         @arg @ref LL_FLASH_LATENCY_7WS
  *         @arg @ref LL_FLASH_LATENCY_8WS
  *         @arg @ref LL_FLASH_LATENCY_9WS
  *         @arg @ref LL_FLASH_LATENCY_10WS
  *         @arg @ref LL_FLASH_LATENCY_11WS
  *         @arg @ref LL_FLASH_LATENCY_12WS
  *         @arg @ref LL_FLASH_LATENCY_13WS
  *         @arg @ref LL_FLASH_LATENCY_14WS
  *         @arg @ref LL_FLASH_LATENCY_15WS
  */
__STATIC_INLINE uint32_t LL_FLASH_GetLatency(const FLASH_TypeDef *flashx)
{
  return (READ_BIT(flashx->ACR, FLASH_ACR_LATENCY));
}

/**
  * @brief  Enable flash prefetch.
  * @rmtoll
  *  ACR           PRFTEN           LL_FLASH_EnablePrefetch
  * @param  FLASH instance.
  */
__STATIC_INLINE void LL_FLASH_EnablePrefetch(FLASH_TypeDef *flashx)
{
  SET_BIT(flashx->ACR, FLASH_ACR_PRFTEN);
}

/**
  * @brief  Disable flash prefetch.
  * @rmtoll
  *  ACR           PRFTEN           LL_FLASH_DisablePrefetch
  * @param  FLASH instance.
  */
__STATIC_INLINE void LL_FLASH_DisablePrefetch(FLASH_TypeDef *flashx)
{
  CLEAR_BIT(flashx->ACR, FLASH_ACR_PRFTEN);
}

/**
  * @brief  Check if the flash prefetch is enabled or disabled.
  * @rmtoll
  *  ACR           PRFTEN           LL_FLASH_IsEnabledPrefetch
  * @param  FLASH instance.
  * @retval State of flash prefetch (1 enabled / 0 disabled).
  */
__STATIC_INLINE uint32_t LL_FLASH_IsEnabledPrefetch(const FLASH_TypeDef *flashx)
{
  return ((READ_BIT(flashx->ACR, FLASH_ACR_PRFTEN) == (FLASH_ACR_PRFTEN)) ? 1UL : 0UL);
}

/**
  * @brief  Enable flash low power read mode.
  * @rmtoll
  *  ACR           LPM           LL_FLASH_EnableLowPWRReadMode
  * @param  FLASH instance.
  */
__STATIC_INLINE void LL_FLASH_EnableLowPWRReadMode(FLASH_TypeDef *flashx)
{
  SET_BIT(flashx->ACR, FLASH_ACR_LPM);
}

/**
  * @brief  Disable flash low power read mode.
  * @rmtoll
  *  ACR           LPM           LL_FLASH_DisableLowPWRReadMode
  * @param  FLASH instance.
  */
__STATIC_INLINE void LL_FLASH_DisableLowPWRReadMode(FLASH_TypeDef *flashx)
{
  CLEAR_BIT(flashx->ACR, FLASH_ACR_LPM);
}

/**
  * @brief  Check if the flash low power read mode is enabled or disabled.
  * @rmtoll
  *  ACR           LPM           LL_FLASH_IsEnabledLowPWRReadMode
  * @param  FLASH instance.
  * @retval State of flash low power read mode (1 enabled / 0 disabled).
  */
__STATIC_INLINE uint32_t LL_FLASH_IsEnabledLowPWRReadMode(const FLASH_TypeDef *flashx)
{
  return ((READ_BIT(flashx->ACR, FLASH_ACR_LPM) == (FLASH_ACR_LPM)) ? 1UL : 0UL);
}

/**
  * @brief  Request flash bank power down mode during run mode.
  * @rmtoll ACR        PDREQx (x : 1 to 2)        LL_FLASH_BANK_RequestPWRDownRunMode
  * @param  FLASH instance.
  * @param  bank
  *         This parameter can be a combination of the following values:
  *         @arg @ref LL_FLASH_PWR_DOWN_RUN_BANK_1
  *         @arg @ref LL_FLASH_PWR_DOWN_RUN_BANK_2
  */
__STATIC_INLINE void LL_FLASH_BANK_RequestPWRDownRunMode(FLASH_TypeDef *flashx, uint32_t bank)
{
  SET_BIT(flashx->ACR, bank);
}

/**
  * @brief  Set the flash power mode during sleep mode.
  * @rmtoll
  *  ACR        SLEEP_PD        LL_FLASH_SetPWRDownSleepMode
  * @param  FLASH instance.
  * @param  mode
  *         This parameter can be one of the following values:
  *         @arg @ref LL_FLASH_IDLE_SLEEP_MODE
  *         @arg @ref LL_FLASH_PWR_DOWN_SLEEP_MODE
  */
__STATIC_INLINE void LL_FLASH_SetPWRDownSleepMode(FLASH_TypeDef *flashx, uint32_t mode)
{
  MODIFY_REG(flashx->ACR, FLASH_ACR_SLEEP_PD, mode);
}

/**
  * @brief  Get the flash power mode during sleep mode.
  * @rmtoll
  *  ACR        SLEEP_PD        LL_FLASH_GetPWRDownSleepMode
  * @param  FLASH instance.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_FLASH_IDLE_SLEEP_MODE
  *         @arg @ref LL_FLASH_PWR_DOWN_SLEEP_MODE
  */
__STATIC_INLINE uint32_t LL_FLASH_GetPWRDownSleepMode(const FLASH_TypeDef *flashx)
{
  return (READ_BIT(flashx->ACR, FLASH_ACR_SLEEP_PD));
}


/**
  * @brief  Set the flash power down key.
  * @rmtoll PDKEY1R/PDKEY2R           PDKEY1/PDKEY2             LL_FLASH_BANK_SetPWRDownRunModeKey
  * @param  FLASH instance.
  * @param  bank
  *         This parameter can be one of the following values:
  *         @arg @ref LL_FLASH_BANK_1
  *         @arg @ref LL_FLASH_BANK_2
  * @param  key
  *         This parameter can be one of the following values:
  *         @arg @ref LL_FLASH_PDKEY1_1 for LL_FLASH_BANK_1
  *         @arg @ref LL_FLASH_PDKEY1_2 for LL_FLASH_BANK_1
  *         @arg @ref LL_FLASH_PDKEY2_1 for LL_FLASH_BANK_2
  *         @arg @ref LL_FLASH_PDKEY2_2 for LL_FLASH_BANK_2
  */
__STATIC_INLINE void LL_FLASH_BANK_SetPWRDownRunModeKey(FLASH_TypeDef *flashx, uint32_t bank, uint32_t key)
{
  uint32_t reg_addr = (uint32_t)&flashx->PDKEY1R;
  WRITE_REG(*(__IO uint32_t *)(reg_addr + bank), key);
}

/**
  * @brief  Set the flash unlock key.
  * @rmtoll NSKEYR/SECKEYR           NSKEY/SECKEY           LL_FLASH_SetUnlockKey
  * @param  FLASH instance.
  * @param  key
  *         This parameter can be one of the following values:
  *         @arg @ref LL_FLASH_KEY1
  *         @arg @ref LL_FLASH_KEY2
  */
__STATIC_INLINE void LL_FLASH_SetUnlockKey(FLASH_TypeDef *flashx, uint32_t key)
{
#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
  WRITE_REG(flashx->SECKEYR, key);
#else
  WRITE_REG(flashx->NSKEYR, key);
#endif /* __ARM_FEATURE_CMSE */
}

#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
/**
  * @brief  Set the flash unlock key for the non-secure flash memory.
  * @rmtoll
  *  NSKEYR           NSKEY           LL_FLASH_NS_SetUnlockKey
  * @param  FLASH instance.
  * @param  key
  *         This parameter can be one of the following values:
  *         @arg @ref LL_FLASH_KEY1
  *         @arg @ref LL_FLASH_KEY2
  */
__STATIC_INLINE void LL_FLASH_NS_SetUnlockKey(FLASH_TypeDef *flashx, uint32_t key)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(flashx);

  WRITE_REG(FLASH_NS->NSKEYR, key);
}
#endif /* __ARM_FEATURE_CMSE */

/** @defgroup FLASH_LL_EF_FLAG_Management Flag Management
  * @{
  */

/**
  * @brief  Set the flash option bytes unlock key.
  * @rmtoll
  *  OPTKEYR           OPTKEY           LL_FLASH_OB_SetUnlockKey
  * @param  FLASH instance.
  * @param  key
  *         This parameter can be one of the following values:
  *         @arg @ref LL_FLASH_OB_OPTKEY1
  *         @arg @ref LL_FLASH_OB_OPTKEY2
  */
__STATIC_INLINE void LL_FLASH_OB_SetUnlockKey(FLASH_TypeDef *flashx, uint32_t key)
{
  WRITE_REG(flashx->OPTKEYR, key);
}

/**
  * @brief  Check if any of the selected flags is active.
  * @rmtoll NSSR/SECSR      EOP/OPERR/PROGERR/WRPERR/PGAERR/SIZERR/PGSERR      LL_FLASH_IsActiveFlag
  * @param  FLASH instance.
  * @param  flag
  *         This parameter can be a combination of the following values:
  *         @arg @ref LL_FLASH_FLAG_EOP
  *         @arg @ref LL_FLASH_FLAG_OPERR
  *         @arg @ref LL_FLASH_FLAG_PROGERR
  *         @arg @ref LL_FLASH_FLAG_WRPERR
  *         @arg @ref LL_FLASH_FLAG_PGAERR
  *         @arg @ref LL_FLASH_FLAG_SIZERR
  *         @arg @ref LL_FLASH_FLAG_PGSERR
  *         @arg @ref LL_FLASH_FLAG_BSY
  *         @arg @ref LL_FLASH_FLAG_WDW
  *         @arg @ref LL_FLASH_FLAG_ALL
  * @retval State of selected flag (1 active / 0 not active).
  */
__STATIC_INLINE uint32_t LL_FLASH_IsActiveFlag(const FLASH_TypeDef *flashx, uint32_t flag)
{
#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
  return ((READ_BIT(flashx->SECSR, flag) != 0U) ? 1UL : 0UL);
#else
  return ((READ_BIT(flashx->NSSR, flag) != 0U) ? 1UL : 0UL);
#endif
}

/**
  * @brief  Read the state of selected flash operation flag.
  * @rmtoll NSSR/SECSR      EOP/OPERR/PROGERR/WRPERR/PGAERR/SIZERR/PGSERR/BSY/WDW     LL_FLASH_ReadFlag_SR
  * @param  FLASH instance.
  * @param  flag
  *         This parameter can be a combination of the following values:
  *         @arg @ref LL_FLASH_FLAG_EOP
  *         @arg @ref LL_FLASH_FLAG_OPERR
  *         @arg @ref LL_FLASH_FLAG_PROGERR
  *         @arg @ref LL_FLASH_FLAG_WRPERR
  *         @arg @ref LL_FLASH_FLAG_PGAERR
  *         @arg @ref LL_FLASH_FLAG_SIZERR
  *         @arg @ref LL_FLASH_FLAG_PGSERR
  *         @arg @ref LL_FLASH_FLAG_BSY
  *         @arg @ref LL_FLASH_FLAG_WDW
  *         @arg @ref LL_FLASH_FLAG_ALL
  * @retval State of selected flag (1 active / 0 not active).
  */
__STATIC_INLINE uint32_t LL_FLASH_ReadFlag_SR(const FLASH_TypeDef *flashx, uint32_t flag)
{
#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
  return (READ_BIT(flashx->SECSR, flag));
#else
  return (READ_BIT(flashx->NSSR, flag));
#endif /* __ARM_FEATURE_CMSE */
}

/**
  * @brief  Read the state of selected flash ECC operation flag.
  * @rmtoll ECCR      ECCC/ECCD/ECCIE/BK/SYSF/ADDR      LL_FLASH_ReadFlag_ECCR
  * @param  FLASH instance.
  * @param  flag
  *         This parameter can be a combination of the following values:
  *         @arg @ref LL_FLASH_FLAG_ECCC
  *         @arg @ref LL_FLASH_FLAG_ECCD
  *         @arg @ref LL_FLASH_FLAG_ECCIE
  *         @arg @ref LL_FLASH_FLAG_BK_ECC
  *         @arg @ref LL_FLASH_FLAG_SYSF_ECC
  *         @arg @ref LL_FLASH_FLAG_ADDR_ECC
  *         @arg @ref LL_FLASH_FLAG_ECC_ALL
  * @retval State of selected flag (1 active / 0 not active).
  */
__STATIC_INLINE uint32_t LL_FLASH_ReadFlag_ECCR(const FLASH_TypeDef *flashx, uint32_t flag)
{
  return (READ_BIT(flashx->ECCR, flag));
}

/**
  * @brief  Read the state of selected flash operation status flag.
  * @rmtoll OPSR      CODE/SYSF/BK/ADDR      LL_FLASH_ReadFlag_OPSR
  * @param  FLASH instance.
  * @param  flag
  *         This parameter can be a combination of the following values:
  *         @arg @ref LL_FLASH_FLAG_ADDR_OP
  *         @arg @ref LL_FLASH_FLAG_BK_OP
  *         @arg @ref LL_FLASH_FLAG_SYSF_OP
  *         @arg @ref LL_FLASH_FLAG_CODE_OP
  *         @arg @ref LL_FLASH_FLAG_OP_ALL
  * @retval State of selected flag (1 active / 0 not active).
  */
__STATIC_INLINE uint32_t LL_FLASH_ReadFlag_OPSR(const FLASH_TypeDef *flashx, uint32_t flag)
{
  return (READ_BIT(flashx->OPSR, flag));
}

/**
  * @brief  Clear the flash operation flag.
  * @rmtoll NSSR/SECSR      EOP/OPERR/PROGERR/WRPERR/PGAERR/SIZERR/PGSERR      LL_FLASH_ClearFlag
  * @param  FLASH instance.
  * @param  flag
  *         This parameter can be a combination of the following values:
  *         @arg @ref LL_FLASH_FLAG_EOP
  *         @arg @ref LL_FLASH_FLAG_OPERR
  *         @arg @ref LL_FLASH_FLAG_PROGERR
  *         @arg @ref LL_FLASH_FLAG_WRPERR
  *         @arg @ref LL_FLASH_FLAG_PGAERR
  *         @arg @ref LL_FLASH_FLAG_SIZERR
  *         @arg @ref LL_FLASH_FLAG_PGSERR
  *         @arg @ref LL_FLASH_FLAG_ALL
  */
__STATIC_INLINE void LL_FLASH_ClearFlag(FLASH_TypeDef *flashx, uint32_t flag)
{
#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
  SET_BIT(flashx->SECSR, flag);
#else
  SET_BIT(flashx->NSSR, flag);
#endif /* __ARM_FEATURE_CMSE */
}

#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
/**
  * @brief  Check if any of the selected non-secure flags is active.
  * @rmtoll NSSR       EOP/OPERR/PROGERR/WRPERR/PGAERR/SIZERR/PGSERR      LL_FLASH_NS_IsActiveFlag
  * @param  FLASH instance.
  * @param  flag
  *         This parameter can be a combination of the following values:
  *         @arg @ref LL_FLASH_FLAG_EOP
  *         @arg @ref LL_FLASH_FLAG_OPERR
  *         @arg @ref LL_FLASH_FLAG_PROGERR
  *         @arg @ref LL_FLASH_FLAG_WRPERR
  *         @arg @ref LL_FLASH_FLAG_PGAERR
  *         @arg @ref LL_FLASH_FLAG_SIZERR
  *         @arg @ref LL_FLASH_FLAG_PGSERR
  *         @arg @ref LL_FLASH_FLAG_BSY
  *         @arg @ref LL_FLASH_FLAG_WDW
  *         @arg @ref LL_FLASH_FLAG_ALL
  * @retval State of selected flag (1 active / 0 not active).
  */
__STATIC_INLINE uint32_t LL_FLASH_NS_IsActiveFlag(const FLASH_TypeDef *flashx, uint32_t flag)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(flashx);

  return (READ_BIT(FLASH_NS->NSSR, flag) != 0U) ? 1UL : 0UL;
}

/**
  * @brief  Read the state of selected flash operation flag for the non-secure flash memory.
  * @rmtoll NSSR      EOP/OPERR/PROGERR/WRPERR/PGAERR/SIZERR/PGSERR/BSY/WDW      LL_FLASH_NS_ReadFlag
  * @param  FLASH instance.
  * @param  flag
  *         This parameter can be a combination of the following values:
  *         @arg @ref LL_FLASH_FLAG_EOP
  *         @arg @ref LL_FLASH_FLAG_OPERR
  *         @arg @ref LL_FLASH_FLAG_PROGERR
  *         @arg @ref LL_FLASH_FLAG_WRPERR
  *         @arg @ref LL_FLASH_FLAG_PGAERR
  *         @arg @ref LL_FLASH_FLAG_SIZERR
  *         @arg @ref LL_FLASH_FLAG_PGSERR
  *         @arg @ref LL_FLASH_FLAG_BSY
  *         @arg @ref LL_FLASH_FLAG_WDW
  *         @arg @ref LL_FLASH_FLAG_ALL
  * @retval State of selected flag (1 active / 0 not active).
  */
__STATIC_INLINE uint32_t LL_FLASH_NS_ReadFlag_SR(const FLASH_TypeDef *flashx, uint32_t flag)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(flashx);

  return (READ_BIT(FLASH_NS->NSSR, flag));
}

/**
  * @brief  Clear the flash operation flag for the non-secure flash memory.
  * @rmtoll NSSR      EOP/OPERR/PROGERR/WRPERR/PGAERR/SIZERR/PGSERR      LL_FLASH_NS_ClearFlag
  * @param  FLASH instance.
  * @param  flag
  *         This parameter can be a combination of the following values :
  *         @arg @ref LL_FLASH_FLAG_EOP
  *         @arg @ref LL_FLASH_FLAG_OPERR
  *         @arg @ref LL_FLASH_FLAG_PROGERR
  *         @arg @ref LL_FLASH_FLAG_WRPERR
  *         @arg @ref LL_FLASH_FLAG_PGAERR
  *         @arg @ref LL_FLASH_FLAG_SIZERR
  *         @arg @ref LL_FLASH_FLAG_PGSERR
  *         @arg @ref LL_FLASH_FLAG_ALL
  */
__STATIC_INLINE void LL_FLASH_NS_ClearFlag(FLASH_TypeDef *flashx, uint32_t flag)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(flashx);

  SET_BIT(FLASH_NS->NSSR, flag);
}
#endif /* __ARM_FEATURE_CMSE */

/**
  * @brief  Check if the flash end of operation flag is active.
  * @rmtoll NSSR/SECSR           EOP           LL_FLASH_IsActiveFlag_EOP
  * @param  FLASH instance.
  * @retval State of EOP flag (1 active / 0 not active).
  */
__STATIC_INLINE uint32_t LL_FLASH_IsActiveFlag_EOP(const FLASH_TypeDef *flashx)
{
#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
  return ((READ_BIT(flashx->SECSR, FLASH_SECSR_EOP) == (FLASH_SECSR_EOP)) ? 1UL : 0UL);
#else
  return ((READ_BIT(flashx->NSSR, FLASH_NSSR_EOP) == (FLASH_NSSR_EOP)) ? 1UL : 0UL);
#endif /* __ARM_FEATURE_CMSE */
}

#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
/**
  * @brief  Check if the flash end of operation flag is active for the non-secure flash memory.
  * @rmtoll
  *  NSSR           EOP           LL_FLASH_NS_IsActiveFlag_EOP
  * @param  FLASH instance.
  * @retval State of non-secure EOP flag (1 active / 0 not active).
  */
__STATIC_INLINE uint32_t LL_FLASH_NS_IsActiveFlag_EOP(const FLASH_TypeDef *flashx)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(flashx);

  return ((READ_BIT(FLASH_NS->NSSR, FLASH_NSSR_EOP) == (FLASH_NSSR_EOP)) ? 1UL : 0UL);
}
#endif /* __ARM_FEATURE_CMSE */

/**
  * @brief  Clear the flash end of operation flag.
  * @rmtoll NSSR/SECSR           EOP           LL_FLASH_ClearFlag_EOP
  * @param  FLASH instance.
  */
__STATIC_INLINE void LL_FLASH_ClearFlag_EOP(FLASH_TypeDef *flashx)
{
#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
  SET_BIT(flashx->SECSR, FLASH_SECSR_EOP);
#else
  SET_BIT(flashx->NSSR, FLASH_NSSR_EOP);
#endif /* __ARM_FEATURE_CMSE */
}

#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
/**
  * @brief  Clear the flash end of operation flag for the non-secure flash memory.
  * @rmtoll
  *  NSSR           EOP           LL_FLASH_NS_ClearFlag_EOP
  * @param  FLASH instance.
  */
__STATIC_INLINE void LL_FLASH_NS_ClearFlag_EOP(FLASH_TypeDef *flashx)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(flashx);

  SET_BIT(FLASH_NS->NSSR, FLASH_NSSR_EOP);
}
#endif /* __ARM_FEATURE_CMSE */

/**
  * @brief  Check if the flash operation error flag is active.
  * @rmtoll NSSR/SECSR           OPERR           LL_FLASH_IsActiveFlag_OPERR
  * @param  FLASH instance.
  * @retval State of ERR flag (1 active / 0 not active).
  */
__STATIC_INLINE uint32_t LL_FLASH_IsActiveFlag_OPERR(const FLASH_TypeDef *flashx)
{
#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
  return ((READ_BIT(flashx->SECSR, FLASH_SECSR_OPERR) == (FLASH_SECSR_OPERR)) ? 1UL : 0UL);
#else
  return ((READ_BIT(flashx->NSSR, FLASH_NSSR_OPERR) == (FLASH_NSSR_OPERR)) ? 1UL : 0UL);
#endif /* __ARM_FEATURE_CMSE */
}

#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
/**
  * @brief  Check if the flash operation error flag is active for the non-secure flash memory.
  * @rmtoll
  *  NSSR           OPERR           LL_FLASH_NS_IsActiveFlag_OPERR
  * @param  FLASH instance.
  * @retval State of non-secure ERR flag (1 active / 0 not active).
  */
__STATIC_INLINE uint32_t LL_FLASH_NS_IsActiveFlag_OPERR(const FLASH_TypeDef *flashx)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(flashx);

  return ((READ_BIT(FLASH_NS->NSSR, FLASH_NSSR_OPERR) == (FLASH_NSSR_OPERR)) ? 1UL : 0UL);
}
#endif /* __ARM_FEATURE_CMSE */

/**
  * @brief  Clear the flash operation error flag.
  * @rmtoll NSSR/SECSR           OPERR           LL_FLASH_ClearFlag_OPERR
  * @param  FLASH instance.
  */
__STATIC_INLINE void LL_FLASH_ClearFlag_OPERR(FLASH_TypeDef *flashx)
{
#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
  SET_BIT(flashx->SECSR, FLASH_SECSR_OPERR);
#else
  SET_BIT(flashx->NSSR, FLASH_NSSR_OPERR);
#endif /* __ARM_FEATURE_CMSE */
}

#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
/**
  * @brief  Clear the flash operation error flag for the non-secure flash memory.
  * @rmtoll
  *  NSSR           OPERR           LL_FLASH_NS_ClearFlag_OPERR
  * @param  FLASH instance.
  */
__STATIC_INLINE void LL_FLASH_NS_ClearFlag_OPERR(FLASH_TypeDef *flashx)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(flashx);

