STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/ll/stm32u5xx_ll_flash.h
  SET_BIT(FLASH_NS->NSSR, FLASH_NSSR_OPERR);
}
#endif /* __ARM_FEATURE_CMSE */

/**
  * @brief  Check if the flash programming error flag is active.
  * @rmtoll NSSR/SECSR           PROGERR           LL_FLASH_IsActiveFlag_PROGERR
  * @param  FLASH instance.
  * @retval State of PROGERR flag (1 active / 0 not active).
  */
__STATIC_INLINE uint32_t LL_FLASH_IsActiveFlag_PROGERR(const FLASH_TypeDef *flashx)
{
#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
  return ((READ_BIT(flashx->SECSR, FLASH_SECSR_PROGERR) == (FLASH_SECSR_PROGERR)) ? 1UL : 0UL);
#else
  return ((READ_BIT(flashx->NSSR, FLASH_NSSR_PROGERR) == (FLASH_NSSR_PROGERR)) ? 1UL : 0UL);
#endif /* __ARM_FEATURE_CMSE */
}

#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
/**
  * @brief  Check if the flash programming error flag is active for the non-secure flash memory.
  * @rmtoll
  *  NSSR           PROGERR           LL_FLASH_NS_IsActiveFlag_PROGERR
  * @param  FLASH instance.
  * @retval State of non-secure PROGERR flag (1 active / 0 not active).
  */
__STATIC_INLINE uint32_t LL_FLASH_NS_IsActiveFlag_PROGERR(const FLASH_TypeDef *flashx)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(flashx);

  return ((READ_BIT(FLASH_NS->NSSR, FLASH_NSSR_PROGERR) == (FLASH_NSSR_PROGERR)) ? 1UL : 0UL);
}
#endif /* __ARM_FEATURE_CMSE */

/**
  * @brief  Clear the flash programming error flag.
  * @rmtoll NSSR/SECSR           PROGERR           LL_FLASH_ClearFlag_PROGERR
  * @param  FLASH instance.
  */
__STATIC_INLINE void LL_FLASH_ClearFlag_PROGERR(FLASH_TypeDef *flashx)
{
#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
  SET_BIT(flashx->SECSR, FLASH_SECSR_PROGERR);
#else
  SET_BIT(flashx->NSSR, FLASH_NSSR_PROGERR);
#endif /* __ARM_FEATURE_CMSE */
}

#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
/**
  * @brief  Clear the flash programming error flag for the non-secure flash memory.
  * @rmtoll
  *  NSSR           PROGERR           LL_FLASH_NS_ClearFlag_PROGERR
  * @param  FLASH instance.
  */
__STATIC_INLINE void LL_FLASH_NS_ClearFlag_PROGERR(FLASH_TypeDef *flashx)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(flashx);

  SET_BIT(FLASH_NS->NSSR, FLASH_NSSR_PROGERR);
}
#endif /* __ARM_FEATURE_CMSE */

/**
  * @brief  Check if the flash write protection error flag is active.
  * @rmtoll NSSR/SECSR           WRPERR           LL_FLASH_IsActiveFlag_WRPERR
  * @param  FLASH instance.
  * @retval State of WRPERR flag (1 active / 0 not active).
  */
__STATIC_INLINE uint32_t LL_FLASH_IsActiveFlag_WRPERR(const FLASH_TypeDef *flashx)
{
#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
  return ((READ_BIT(flashx->SECSR, FLASH_SECSR_WRPERR) == (FLASH_SECSR_WRPERR)) ? 1UL : 0UL);
#else
  return ((READ_BIT(flashx->NSSR, FLASH_NSSR_WRPERR) == (FLASH_NSSR_WRPERR)) ? 1UL : 0UL);
#endif /* __ARM_FEATURE_CMSE */
}

#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
/**
  * @brief  Check if the flash write protection error flag is activefor the non-secure flash memory.
  * @rmtoll
  *  NSSR           WRPERR           LL_FLASH_NS_IsActiveFlag_WRPERR
  * @param  FLASH instance.
  * @retval State of non-secure WRPERR flag (1 active / 0 not active).
  */
__STATIC_INLINE uint32_t LL_FLASH_NS_IsActiveFlag_WRPERR(const FLASH_TypeDef *flashx)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(flashx);

  return ((READ_BIT(FLASH_NS->NSSR, FLASH_NSSR_WRPERR) == (FLASH_NSSR_WRPERR)) ? 1UL : 0UL);
}
#endif /* __ARM_FEATURE_CMSE */

/**
  * @brief  Clear the flash write protection error flag.
  * @rmtoll NSSR/SECSR           WRPERR           LL_FLASH_ClearFlag_WRPERR
  * @param  FLASH instance.
  */
__STATIC_INLINE void LL_FLASH_ClearFlag_WRPERR(FLASH_TypeDef *flashx)
{
#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
  SET_BIT(flashx->SECSR, FLASH_SECSR_WRPERR);
#else
  SET_BIT(flashx->NSSR, FLASH_NSSR_WRPERR);
#endif /* __ARM_FEATURE_CMSE */
}

#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
/**
  * @brief  Clear the flash write protection error flag for the non-secure flash memory.
  * @rmtoll
  *  NSSR           WRPERR           LL_FLASH_NS_ClearFlag_WRPERR
  * @param  FLASH instance.
  */
__STATIC_INLINE void LL_FLASH_NS_ClearFlag_WRPERR(FLASH_TypeDef *flashx)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(flashx);

  SET_BIT(FLASH_NS->NSSR, FLASH_NSSR_WRPERR);
}
#endif /* __ARM_FEATURE_CMSE */

/**
  * @brief  Check if the flash programming alignment error flag is active.
  * @rmtoll NSSR/SECSR           PGAERR           LL_FLASH_IsActiveFlag_PGAERR
  * @param  FLASH instance.
  * @retval State of PGAERR flag (1 active / 0 not active).
  */
__STATIC_INLINE uint32_t LL_FLASH_IsActiveFlag_PGAERR(const FLASH_TypeDef *flashx)
{
#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
  return ((READ_BIT(flashx->SECSR, FLASH_SECSR_PGAERR) == (FLASH_SECSR_PGAERR)) ? 1UL : 0UL);
#else
  return ((READ_BIT(flashx->NSSR, FLASH_NSSR_PGAERR) == (FLASH_NSSR_PGAERR)) ? 1UL : 0UL);
#endif /* __ARM_FEATURE_CMSE */
}

#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
/**
  * @brief  Check if the flash programming alignment error flag is active for the non-secure flash memory.
  * @rmtoll
  *  NSSR           PGAERR           LL_FLASH_NS_IsActiveFlag_PGAERR
  * @param  FLASH instance.
  * @retval State of non-secure PGAERR flag (1 active / 0 not active).
  */
__STATIC_INLINE uint32_t LL_FLASH_NS_IsActiveFlag_PGAERR(const FLASH_TypeDef *flashx)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(flashx);

  return ((READ_BIT(FLASH_NS->NSSR, FLASH_NSSR_PGAERR) == (FLASH_NSSR_PGAERR)) ? 1UL : 0UL);
}
#endif /* __ARM_FEATURE_CMSE */

/**
  * @brief  Clear the flash programming alignment error flag.
  * @rmtoll NSSR/SECSR           PGAERR           LL_FLASH_ClearFlag_PGAERR
  * @param  FLASH instance.
  */
__STATIC_INLINE void LL_FLASH_ClearFlag_PGAERR(FLASH_TypeDef *flashx)
{
#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
  SET_BIT(flashx->SECSR, FLASH_SECSR_PGAERR);
#else
  SET_BIT(flashx->NSSR, FLASH_NSSR_PGAERR);
#endif /* __ARM_FEATURE_CMSE */
}

#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
/**
  * @brief  Clear the flash programming alignment error flag for the non-secure flash memory.
  * @rmtoll
  *  NSSR           PGAERR           LL_FLASH_NS_ClearFlag_PGAERR
  * @param  FLASH instance.
  */
__STATIC_INLINE void LL_FLASH_NS_ClearFlag_PGAERR(FLASH_TypeDef *flashx)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(flashx);

