STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/ll/stm32u5xx_ll_flash.h
  SET_BIT(FLASH_NS->NSSR, FLASH_NSSR_PGAERR);
}
#endif /* __ARM_FEATURE_CMSE */

/**
  * @brief  Check if the flash size error flag is active.
  * @rmtoll NSSR/SECSR           SIZERR           LL_FLASH_IsActiveFlag_SIZERR
  * @param  FLASH instance.
  * @retval State of SIZERR flag (1 active / 0 not active).
  */
__STATIC_INLINE uint32_t LL_FLASH_IsActiveFlag_SIZERR(const FLASH_TypeDef *flashx)
{
#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
  return ((READ_BIT(flashx->SECSR, FLASH_SECSR_SIZERR) == (FLASH_SECSR_SIZERR)) ? 1UL : 0UL);
#else
  return ((READ_BIT(flashx->NSSR, FLASH_NSSR_SIZERR) == (FLASH_NSSR_SIZERR)) ? 1UL : 0UL);
#endif /* __ARM_FEATURE_CMSE */
}

#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
/**
  * @brief  Check if the flash size error flag is active for the non-secure flash memory.
  * @rmtoll
  *  NSSR           SIZERR           LL_FLASH_NS_IsActiveFlag_SIZERR
  * @param  FLASH instance.
  * @retval State of non-secure SIZERR flag (1 active / 0 not active).
  */
__STATIC_INLINE uint32_t LL_FLASH_NS_IsActiveFlag_SIZERR(FLASH_TypeDef *flashx)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(flashx);

  return ((READ_BIT(FLASH_NS->NSSR, FLASH_NSSR_SIZERR) == (FLASH_NSSR_SIZERR)) ? 1UL : 0UL);
}
#endif /* __ARM_FEATURE_CMSE */

/**
  * @brief  Clear the flash size error flag.
  * @rmtoll NSSR/SECSR           SIZERR           LL_FLASH_ClearFlag_SIZERR
  * @param  FLASH instance.
  */
__STATIC_INLINE void LL_FLASH_ClearFlag_SIZERR(FLASH_TypeDef *flashx)
{
#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
  SET_BIT(flashx->SECSR, FLASH_SECSR_SIZERR);
#else
  SET_BIT(flashx->NSSR, FLASH_NSSR_SIZERR);
#endif /* __ARM_FEATURE_CMSE */
}

#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
/**
  * @brief  Clear the flash size error flag for the non-secure flash memory.
  * @rmtoll
  *  NSSR           SIZERR           LL_FLASH_NS_ClearFlag_SIZERR
  * @param  FLASH instance.
  */
__STATIC_INLINE void LL_FLASH_NS_ClearFlag_SIZERR(FLASH_TypeDef *flashx)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(flashx);

  SET_BIT(FLASH_NS->NSSR, FLASH_NSSR_SIZERR);
}
#endif /* __ARM_FEATURE_CMSE */

/**
  * @brief  Check if the flash programming sequence error flag is active.
  * @rmtoll NSSR/SECSR           PGSERR           LL_FLASH_IsActiveFlag_PGSERR
  * @param  FLASH instance.
  * @retval State of PGSERR flag (1 active / 0 not active).
  */
__STATIC_INLINE uint32_t LL_FLASH_IsActiveFlag_PGSERR(const FLASH_TypeDef *flashx)
{
#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
  return ((READ_BIT(flashx->SECSR, FLASH_SECSR_PGSERR) == (FLASH_SECSR_PGSERR)) ? 1UL : 0UL);
#else
  return ((READ_BIT(flashx->NSSR, FLASH_NSSR_PGSERR) == (FLASH_NSSR_PGSERR)) ? 1UL : 0UL);
#endif /* __ARM_FEATURE_CMSE */
}

#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
/**
  * @brief  Check if the flash programming sequence error flag is active for the non-secure flash memory.
  * @rmtoll
  *  NSSR           PGSERR           LL_FLASH_NS_IsActiveFlag_PGSERR
  * @param  FLASH instance.
  * @retval State of non-secure PGSERR flag (1 active / 0 not active).
  */
__STATIC_INLINE uint32_t LL_FLASH_NS_IsActiveFlag_PGSERR(const FLASH_TypeDef *flashx)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(flashx);

  return ((READ_BIT(FLASH_NS->NSSR, FLASH_NSSR_PGSERR) == (FLASH_NSSR_PGSERR)) ? 1UL : 0UL);
}
#endif /* __ARM_FEATURE_CMSE */

/**
  * @brief  Clear the flash programming sequence error flag.
  * @rmtoll NSSR/SECSR           PGSERR           LL_FLASH_ClearFlag_PGSERR
  * @param  FLASH instance.
  */
__STATIC_INLINE void LL_FLASH_ClearFlag_PGSERR(FLASH_TypeDef *flashx)
{
#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
  SET_BIT(flashx->SECSR, FLASH_SECSR_PGSERR);
#else
  SET_BIT(flashx->NSSR, FLASH_NSSR_PGSERR);
#endif /* __ARM_FEATURE_CMSE */
}

#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
/**
  * @brief  Clear the flash programming sequence error flag for the non-secure flash memory.
  * @rmtoll
  *  NSSR           PGSERR           LL_FLASH_NS_ClearFlag_PGSERR
  * @param  FLASH instance.
  */
__STATIC_INLINE void LL_FLASH_NS_ClearFlag_PGSERR(FLASH_TypeDef *flashx)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(flashx);

  SET_BIT(FLASH_NS->NSSR, FLASH_NSSR_PGSERR);
}
#endif /* __ARM_FEATURE_CMSE */

/**
  * @brief  Check if the flash option bytes write error flag is active.
  * @rmtoll
  *  NSSR           OPTWERR           LL_FLASH_IsActiveFlag_OPTWERR
  * @param  FLASH instance.
  * @retval State of OPTWERR flag (1 active / 0 not active).
  */
__STATIC_INLINE uint32_t LL_FLASH_IsActiveFlag_OPTWERR(const FLASH_TypeDef *flashx)
{
  return ((READ_BIT(flashx->NSSR, FLASH_NSSR_OPTWERR) == (FLASH_NSSR_OPTWERR)) ? 1UL : 0UL);
}

/**
  * @brief  Clear the flash option bytes write error flag.
  * @rmtoll
  *  NSSR           OPTWERR           LL_FLASH_ClearFlag_OPTWERR
  * @param  FLASH instance.
  */
__STATIC_INLINE void LL_FLASH_ClearFlag_OPTWERR(FLASH_TypeDef *flashx)
{
  SET_BIT(flashx->NSSR, FLASH_NSSR_OPTWERR);
}

/**
  * @brief  Check if the flash busy flag is active.
  * @rmtoll NSSR/SECSR           BSY           LL_FLASH_IsActiveFlag_BSY
  * @param  FLASH instance.
  * @retval State of BSY flag (1 active / 0 not active).
  */
__STATIC_INLINE uint32_t LL_FLASH_IsActiveFlag_BSY(const FLASH_TypeDef *flashx)
{
#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
  return ((READ_BIT(flashx->SECSR, FLASH_SECSR_BSY) == (FLASH_SECSR_BSY)) ? 1UL : 0UL);
#else
  return ((READ_BIT(flashx->NSSR, FLASH_NSSR_BSY) == (FLASH_NSSR_BSY)) ? 1UL : 0UL);
#endif /* __ARM_FEATURE_CMSE */
}

#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
/**
  * @brief  Check if the flash busy flag is active for the non-secure flash memory.
  * @rmtoll
  *  NSSR           BSY           LL_FLASH_NS_IsActiveFlag_BSY
  * @param  FLASH instance.
  * @retval State of non-secure BSY flag (1 active / 0 not active).
  */
__STATIC_INLINE uint32_t LL_FLASH_NS_IsActiveFlag_BSY(const FLASH_TypeDef *flashx)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(flashx);

  return ((READ_BIT(FLASH_NS->NSSR, FLASH_NSSR_BSY) == (FLASH_NSSR_BSY)) ? 1UL : 0UL);
}
#endif /* __ARM_FEATURE_CMSE */

/**
  * @brief  Check if the flash wait data to write flag is active.
  * @rmtoll NSSR/SECSR           WDW           LL_FLASH_IsActiveFlag_WDW
  * @param  FLASH instance.
  * @retval State of WDW flag (1 active / 0 not active).
  */
__STATIC_INLINE uint32_t LL_FLASH_IsActiveFlag_WDW(const FLASH_TypeDef *flashx)
{
#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
  return ((READ_BIT(flashx->SECSR, FLASH_SECSR_WDW) == (FLASH_SECSR_WDW)) ? 1UL : 0UL);
#else
  return ((READ_BIT(flashx->NSSR, FLASH_NSSR_WDW) == (FLASH_NSSR_WDW)) ? 1UL : 0UL);
#endif /* __ARM_FEATURE_CMSE */
}

#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
/**
  * @brief  Check if the flash wait data to write flag is active for the non-secure flash memory.
  * @rmtoll
  *  NSSR           WDW           LL_FLASH_NS_IsActiveFlag_WDW
  * @param  FLASH instance.
  * @retval State of non-secure WDW flag (1 active / 0 not active).
  */
__STATIC_INLINE uint32_t LL_FLASH_NS_IsActiveFlag_WDW(const FLASH_TypeDef *flashx)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(flashx);

  return ((READ_BIT(FLASH_NS->NSSR, FLASH_NSSR_WDW) == (FLASH_NSSR_WDW)) ? 1UL : 0UL);
}
#endif /* __ARM_FEATURE_CMSE */

/**
  * @brief  Check if the flash OEM1 lock flag is active.
  * @rmtoll
  *  NSSR           OEM1LOCK           LL_FLASH_IsActiveFlag_OEM1LOCK
  * @param  FLASH instance.
  * @retval State of OEM1LOCK flag (1 active / 0 not active).
  */
__STATIC_INLINE uint32_t LL_FLASH_IsActiveFlag_OEM1LOCK(const FLASH_TypeDef *flashx)
{
  return ((READ_BIT(flashx->NSSR, FLASH_NSSR_OEM1LOCK) == (FLASH_NSSR_OEM1LOCK)) ? 1UL : 0UL);
}

/**
  * @brief  Check if the flash OEM2 lock flag is active.
  * @rmtoll
  *  NSSR           OEM2LOCK           LL_FLASH_IsActiveFlag_OEM2LOCK
  * @param  FLASH instance.
  * @retval State of OEM2LOCK flag (1 active / 0 not active).
  */
__STATIC_INLINE uint32_t LL_FLASH_IsActiveFlag_OEM2LOCK(const FLASH_TypeDef *flashx)
{
  return ((READ_BIT(flashx->NSSR, FLASH_NSSR_OEM2LOCK) == (FLASH_NSSR_OEM2LOCK)) ? 1UL : 0UL);
}

/**
  * @brief  Check if the flash bank1 power down mode flag is active.
  * @rmtoll
  *  NSSR           PD1           LL_FLASH_IsActiveFlag_PD1
  * @param  FLASH instance.
  * @retval State of PD1 flag
  *     0 : the FLASH memory bank 1 is in normal mode.
  *     1 : the FLASH memory bank 1 is in power-down mode.
  */
__STATIC_INLINE uint32_t LL_FLASH_IsActiveFlag_PD1(const FLASH_TypeDef *flashx)
{
  return ((READ_BIT(flashx->NSSR, FLASH_NSSR_PD1) == (FLASH_NSSR_PD1)) ? 1UL : 0UL);
}

/**
  * @brief  Check if the flash bank2 power down mode flag is active.
  * @rmtoll
  *  NSSR           PD2           LL_FLASH_IsActiveFlag_PD2
  * @param  FLASH instance.
  * @retval State of PD2 flag
  *     0 : the FLASH memory bank 2 is in normal mode.
  *     1 : the FLASH memory bank 2 is in power-down mode.
  */
__STATIC_INLINE uint32_t LL_FLASH_IsActiveFlag_PD2(const FLASH_TypeDef *flashx)
{
  return ((READ_BIT(flashx->NSSR, FLASH_NSSR_PD2) == (FLASH_NSSR_PD2)) ? 1UL : 0UL);
}

/**
  * @brief  Check if the flash bank1 or bank2 power down mode flag is active.
  * @rmtoll
  *  NSSR           PD           LL_FLASH_IsActiveFlag_PD
  * @param  FLASH instance.
  * @param  bank
  *         This parameter can be one of the following values:
  *         @arg @ref LL_FLASH_FLAG_PD1
  *         @arg @ref LL_FLASH_FLAG_PD2
  * @retval State of PDx flag
  *     0 : the FLASH memory bank1 or bank2 is in normal mode.
  *     1 : the FLASH memory bank1 or bank2 is in power-down mode.
  */
__STATIC_INLINE uint32_t LL_FLASH_IsActiveFlag_PD(const FLASH_TypeDef *flashx, uint32_t bank)
{
  return ((READ_BIT(flashx->NSSR, bank) == (bank)) ? 1UL : 0UL);
}

/**
  * @}
  */

/**
  * @brief  Enable the flash programming.
  * @rmtoll NSCR/SECCR           PG           LL_FLASH_EnableProgramming
  * @param  FLASH instance.
  */
__STATIC_INLINE void LL_FLASH_EnableProgramming(FLASH_TypeDef *flashx)
{
#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
  SET_BIT(flashx->SECCR, FLASH_SECCR_PG);
#else
  SET_BIT(flashx->NSCR, FLASH_NSCR_PG);
#endif /* __ARM_FEATURE_CMSE */
}

#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
/**
  * @brief  Enable the flash programming for the non-secure flash memory.
  * @rmtoll
  *  NSCR           PG           LL_FLASH_NS_EnableProgramming
  * @param  FLASH instance.
  */
__STATIC_INLINE void LL_FLASH_NS_EnableProgramming(FLASH_TypeDef *flashx)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(flashx);

  SET_BIT(FLASH_NS->NSCR, FLASH_NSCR_PG);
}
#endif /* __ARM_FEATURE_CMSE */

/**
  * @brief  Disable the flash programming.
  * @rmtoll NSCR/SECCR           PG           LL_FLASH_DisableProgramming
  * @param  FLASH instance.
  */
__STATIC_INLINE void LL_FLASH_DisableProgramming(FLASH_TypeDef *flashx)
{
#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
  CLEAR_BIT(flashx->SECCR, FLASH_SECCR_PG);
#else
  CLEAR_BIT(flashx->NSCR, FLASH_NSCR_PG);
#endif /* __ARM_FEATURE_CMSE */
}

#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
/**
  * @brief  Disable the flash programming for the non-secure flash memory.
  * @rmtoll
  *  NSCR           PG           LL_FLASH_NS_DisableProgramming
  * @param  FLASH instance.
  */
__STATIC_INLINE void LL_FLASH_NS_DisableProgramming(FLASH_TypeDef *flashx)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(flashx);

