STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/ll/stm32u5xx_ll_flash.h
  CLEAR_BIT(FLASH_NS->NSCR, FLASH_NSCR_PG);
}
#endif /* __ARM_FEATURE_CMSE */

/**
  * @brief  Check if the flash programming is enabled or disabled.
  * @rmtoll NSCR/SECCR           PG           LL_FLASH_IsEnabledProgramming
  * @param  FLASH instance.
  * @retval State of flash programming (1 enabled / 0 disabled).
  */
__STATIC_INLINE uint32_t LL_FLASH_IsEnabledProgramming(const FLASH_TypeDef *flashx)
{
#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
  return ((READ_BIT(flashx->SECCR, FLASH_SECCR_PG) == (FLASH_SECCR_PG)) ? 1UL : 0UL);
#else
  return ((READ_BIT(flashx->NSCR, FLASH_NSCR_PG) == (FLASH_NSCR_PG)) ? 1UL : 0UL);
#endif /* __ARM_FEATURE_CMSE */
}

#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
/**
  * @brief  Check if the flash programming is enabled or disabled for the non-secure flash memory.
  * @rmtoll
  *  NSCR           PG           LL_FLASH_NS_IsEnabledProgramming
  * @param  FLASH instance.
  * @retval State of flash non-secure programming (1 enabled / 0 disabled).
  */
__STATIC_INLINE uint32_t LL_FLASH_NS_IsEnabledProgramming(const FLASH_TypeDef *flashx)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(flashx);

  return ((READ_BIT(FLASH_NS->NSCR, FLASH_NSCR_PG) == (FLASH_NSCR_PG)) ? 1UL : 0UL);
}
#endif /* __ARM_FEATURE_CMSE */

/**
  * @brief  Enable the flash page erase.
  * @rmtoll NSCR/SECCR           PER           LL_FLASH_EnablePageErase
  * @param  FLASH instance.
  */
__STATIC_INLINE void LL_FLASH_EnablePageErase(FLASH_TypeDef *flashx)
{
#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
  SET_BIT(flashx->SECCR, FLASH_SECCR_PER);
#else
  SET_BIT(flashx->NSCR, FLASH_NSCR_PER);
#endif /* __ARM_FEATURE_CMSE */
}

#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
/**
  * @brief  Enable the flash page erase for the non-secure flash memory.
  * @rmtoll
  *  NSCR           PER           LL_FLASH_NS_EnablePageErase
  * @param  FLASH instance.
  */
__STATIC_INLINE void LL_FLASH_NS_EnablePageErase(FLASH_TypeDef *flashx)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(flashx);

  SET_BIT(FLASH_NS->NSCR, FLASH_NSCR_PER);
}
#endif /* __ARM_FEATURE_CMSE */

/**
  * @brief  Disable the flash page erase.
  * @rmtoll NSCR/SECCR           PER           LL_FLASH_DisablePageErase
  * @param  FLASH instance.
  */
__STATIC_INLINE void LL_FLASH_DisablePageErase(FLASH_TypeDef *flashx)
{
#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
  CLEAR_BIT(flashx->SECCR, FLASH_SECCR_PER);
#else
  CLEAR_BIT(flashx->NSCR, FLASH_NSCR_PER);
#endif /* __ARM_FEATURE_CMSE */
}

#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
/**
  * @brief  Disable the flash page erase for the non-secure flash memory.
  * @rmtoll
  *  NSCR           PER           LL_FLASH_NS_DisablePageErase
  * @param  FLASH instance.
  */
__STATIC_INLINE void LL_FLASH_NS_DisablePageErase(FLASH_TypeDef *flashx)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(flashx);

  CLEAR_BIT(FLASH_NS->NSCR, FLASH_NSCR_PER);
}
#endif /* __ARM_FEATURE_CMSE */

/**
  * @brief  Check if the flash page erase is enabled or disabled.
  * @rmtoll NSCR/SECCR           PER           LL_FLASH_IsEnabledPageErase
  * @param  FLASH instance.
  * @retval State of flash page erase (1 enabled / 0 disabled).
  */
__STATIC_INLINE uint32_t LL_FLASH_IsEnabledPageErase(const FLASH_TypeDef *flashx)
{
#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
  return ((READ_BIT(flashx->SECCR, FLASH_SECCR_PER) == (FLASH_SECCR_PER)) ? 1UL : 0UL);
#else
  return ((READ_BIT(flashx->NSCR, FLASH_NSCR_PER) == (FLASH_NSCR_PER)) ? 1UL : 0UL);
#endif /* __ARM_FEATURE_CMSE */
}

#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
/**
  * @brief  Check if the flash page erase is enabled or disabled for the non-secure flash memory.
  * @rmtoll
  *  NSCR           PER           LL_FLASH_NS_IsEnabledPageErase
  * @param  FLASH instance.
  * @retval State of flash non-secure page erase (1 enabled / 0 disabled).
  */
__STATIC_INLINE uint32_t LL_FLASH_NS_IsEnabledPageErase(const FLASH_TypeDef *flashx)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(flashx);

  return ((READ_BIT(FLASH_NS->NSCR, FLASH_NSCR_PER) == (FLASH_NSCR_PER)) ? 1UL : 0UL);
}
#endif /* __ARM_FEATURE_CMSE */

/**
  * @brief  Enable the flash bank mass erase.
  * @rmtoll NSCR/SECCR           MER1/MER2           LL_FLASH_BANK_EnableMassErase
  * @param  FLASH instance.
  * @param  bank
  *         This parameter can be one of the following values :
  *         @arg @ref LL_FLASH_MASS_ERASE_BANK_1
  *         @arg @ref LL_FLASH_MASS_ERASE_BANK_2
  *         @arg @ref LL_FLASH_MASS_ERASE_BANK_ALL
  */
__STATIC_INLINE void LL_FLASH_BANK_EnableMassErase(FLASH_TypeDef *flashx, uint32_t bank)
{
#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
  MODIFY_REG(flashx->SECCR, (FLASH_SECCR_MER1 | FLASH_SECCR_MER2), bank);
#else
  MODIFY_REG(flashx->NSCR, (FLASH_NSCR_MER1 | FLASH_NSCR_MER2), bank);
#endif /* __ARM_FEATURE_CMSE */
}

#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
/**
  * @brief  Enable the flash bank mass erase for the non-secure flash memory.
  * @rmtoll NSCR           MER1/MER2           LL_FLASH_NS_BANK_EnableMassErase
  * @param  FLASH instance.
  * @param  bank
  *         This parameter can be one of the following values :
  *         @arg @ref LL_FLASH_MASS_ERASE_BANK_1
  *         @arg @ref LL_FLASH_MASS_ERASE_BANK_2
  *         @arg @ref LL_FLASH_MASS_ERASE_BANK_ALL
  */
__STATIC_INLINE void LL_FLASH_NS_BANK_EnableMassErase(FLASH_TypeDef *flashx, uint32_t bank)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(flashx);

  MODIFY_REG(FLASH_NS->NSCR, (FLASH_NSCR_MER1 | FLASH_NSCR_MER2), bank);
}
#endif /* __ARM_FEATURE_CMSE */

/**
  * @brief  Disable the flash bank mass erase.
  * @rmtoll NSCR/SECCR           MER1/MER2           LL_FLASH_BANK_DisableMassErase
  * @param  FLASH instance.
  * @param  bank
  *         This parameter can be one of the following values :
  *         @arg @ref LL_FLASH_MASS_ERASE_BANK_1
  *         @arg @ref LL_FLASH_MASS_ERASE_BANK_2
  *         @arg @ref LL_FLASH_MASS_ERASE_BANK_ALL
  */
__STATIC_INLINE void LL_FLASH_BANK_DisableMassErase(FLASH_TypeDef *flashx, uint32_t bank)
{
#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
  CLEAR_BIT(flashx->SECCR, bank);
#else
  CLEAR_BIT(flashx->NSCR, bank);
#endif /* __ARM_FEATURE_CMSE */
}

#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
/**
  * @brief  Disable the flash bank mass erase for the non-secure flash memory.
  * @rmtoll NSCR           MER1/MER2           LL_FLASH_EnableBank1MassErase
  * @param  FLASH instance.
  * @param  bank
  *         This parameter can be one of the following values :
  *         @arg @ref LL_FLASH_MASS_ERASE_BANK_1
  *         @arg @ref LL_FLASH_MASS_ERASE_BANK_2
  *         @arg @ref LL_FLASH_MASS_ERASE_BANK_ALL
  */
__STATIC_INLINE void LL_FLASH_NS_BANK_DisableMassErase(FLASH_TypeDef *flashx, uint32_t bank)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(flashx);

