STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/ll/stm32u5xx_ll_flash.h
  CLEAR_BIT(FLASH_NS->NSCR, bank);
}
#endif /* __ARM_FEATURE_CMSE */

/**
  * @brief  Check if the flash bank mass erase is enabled or disabled.
  * @rmtoll NSCR/SECCR           MER1/MER2           LL_FLASH_BANK_IsEnabledMassErase
  * @param  FLASH instance.
  * @param  bank
  *         This parameter can be one of the following values :
  *         @arg @ref LL_FLASH_MASS_ERASE_BANK_1
  *         @arg @ref LL_FLASH_MASS_ERASE_BANK_2
  * @retval State of flash mass erase (1 enabled / 0 disabled).
  */
__STATIC_INLINE uint32_t LL_FLASH_BANK_IsEnabledMassErase(const FLASH_TypeDef *flashx, uint32_t bank)
{
#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
  return ((READ_BIT(flashx->SECCR, bank) == (bank)) ? 1UL : 0UL);
#else
  return ((READ_BIT(flashx->NSCR, bank) == (bank)) ? 1UL : 0UL);
#endif /* __ARM_FEATURE_CMSE */
}

#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
/**
  * @brief  Check if the flash bank mass erase is enabled or disabled for the non-secure flash memory.
  * @rmtoll NSCR           MER1/MER2           LL_FLASH_NS_BANK_IsEnabledMassErase
  * @param  FLASH instance.
  * @param  bank
  *         This parameter can be one of the following values :
  *         @arg @ref LL_FLASH_MASS_ERASE_BANK_1
  *         @arg @ref LL_FLASH_MASS_ERASE_BANK_2
  * @retval State of flash non-secure mass erase (1 enabled / 0 disabled).
  */
__STATIC_INLINE uint32_t LL_FLASH_NS_BANK_IsEnabledMassErase(const FLASH_TypeDef *flashx, uint32_t bank)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(flashx);

  return ((READ_BIT(FLASH_NS->NSCR, bank) == (bank)) ? 1UL : 0UL);
}
#endif /* __ARM_FEATURE_CMSE */

/**
  * @brief  Set the flash page erase index.
  * @rmtoll NSCR/SECCR           BKER/PNB           LL_FLASH_BANK_SetPageEraseIndex
  * @param  FLASH instance.
  * @param  bank
  *         This parameter can be one of the following values :
  *         @arg @ref LL_FLASH_PAGE_ERASE_BANK_1
  *         @arg @ref LL_FLASH_PAGE_ERASE_BANK_2
  * @param  page_idx This parameter a value in [0:127]
  */
__STATIC_INLINE void LL_FLASH_BANK_SetPageEraseIndex(FLASH_TypeDef *flashx, uint32_t bank, uint32_t page_idx)
{
#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
  MODIFY_REG(flashx->SECCR, FLASH_SECCR_BKER | FLASH_SECCR_PNB, (bank | (page_idx << FLASH_SECCR_PNB_Pos)));
#else
  MODIFY_REG(flashx->NSCR, FLASH_NSCR_BKER | FLASH_NSCR_PNB, (bank | (page_idx << FLASH_NSCR_PNB_Pos)));
#endif /* __ARM_FEATURE_CMSE */
}

#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
/**
  * @brief  Set the flash page erase index for the non-secure flash memory.
  * @rmtoll NSCR           BKER/PNB           LL_FLASH_NS_BANK_SetPageEraseIndex
  * @param  FLASH instance.
  * @param  bank
  *         This parameter can be one of the following values :
  *         @arg @ref LL_FLASH_PAGE_ERASE_BANK_1
  *         @arg @ref LL_FLASH_PAGE_ERASE_BANK_2
  * @param  page_idx This parameter a value in [0:127]
  */
__STATIC_INLINE void LL_FLASH_NS_BANK_SetPageEraseIndex(FLASH_TypeDef *flashx, uint32_t bank, uint32_t page_idx)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(flashx);

  MODIFY_REG(FLASH_NS->NSCR, FLASH_NSCR_BKER | FLASH_NSCR_PNB, (bank | (page_idx << FLASH_NSCR_PNB_Pos)));
}
#endif /* __ARM_FEATURE_CMSE */

/**
  * @brief  Set the flash programming mode.
  * @rmtoll NSCR/SECCR           BWR           LL_FLASH_SetProgrammingMode
  * @param  FLASH instance.
  * @param  programming_mode
  *         This parameter can be one of the following values:
  *         @arg @ref LL_FLASH_PROGRAM_QUADWORD_MODE
  *         @arg @ref LL_FLASH_PROGRAM_BURST_MODE
  */
__STATIC_INLINE void LL_FLASH_SetProgrammingMode(FLASH_TypeDef *flashx, uint32_t programming_mode)
{
#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
  MODIFY_REG(flashx->SECCR, FLASH_SECCR_BWR, programming_mode);
#else
  MODIFY_REG(flashx->NSCR, FLASH_NSCR_BWR, programming_mode);
#endif /* __ARM_FEATURE_CMSE */
}

#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
/**
  * @brief  Set the flash programming mode for the non-secure flash memory.
  * @rmtoll
  *  NSCR           BWR           LL_FLASH_NS_SetProgrammingMode
  * @param  FLASH instance.
  * @param  programming_mode
  *         This parameter can be one of the following values:
  *         @arg @ref LL_FLASH_PROGRAM_QUADWORD_MODE
  *         @arg @ref LL_FLASH_PROGRAM_BURST_MODE
  */
__STATIC_INLINE void LL_FLASH_NS_SetProgrammingMode(FLASH_TypeDef *flashx, uint32_t programming_mode)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(flashx);

  MODIFY_REG(FLASH_NS->NSCR, FLASH_NSCR_BWR, programming_mode);
}
#endif /* __ARM_FEATURE_CMSE */

/**
  * @brief  Get the flash programming mode.
  * @rmtoll NSCR/SECCR           BWR           LL_FLASH_GetProgrammingMode
  * @param  FLASH instance.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_FLASH_PROGRAM_QUADWORD_MODE
  *         @arg @ref LL_FLASH_PROGRAM_BURST_MODE
  */
__STATIC_INLINE uint32_t LL_FLASH_GetProgrammingMode(const FLASH_TypeDef *flashx)
{
#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
  return (READ_BIT(flashx->SECCR, FLASH_SECCR_BWR)) ;
#else
  return (READ_BIT(flashx->NSCR, FLASH_NSCR_BWR));
#endif /* __ARM_FEATURE_CMSE */
}

#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
/**
  * @brief  Get the flash programming mode for the non-secure flash memory.
  * @rmtoll
  *  NSCR           BWR           LL_FLASH_NS_GetProgrammingMode
  * @param  FLASH instance.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_FLASH_PROGRAM_QUADWORD_MODE
  *         @arg @ref LL_FLASH_PROGRAM_BURST_MODE
  */
__STATIC_INLINE uint32_t LL_FLASH_NS_GetProgrammingMode(const FLASH_TypeDef *flashx)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(flashx);

  return (READ_BIT(FLASH_NS->NSCR, FLASH_NSCR_BWR));
}
#endif /* __ARM_FEATURE_CMSE */

/**
  * @brief  Set the configuration of flash programming.
  * @rmtoll NSCR/SECCR           PG/BWR           LL_FLASH_SetConfigProgramming
  * @param  FLASH instance.
  * @param  programming_mode
  *         This parameter can be one of the following values:
  *         @arg @ref LL_FLASH_PROGRAM_QUADWORD_MODE
  *         @arg @ref LL_FLASH_PROGRAM_BURST_MODE
  */
__STATIC_INLINE void LL_FLASH_SetConfigProgramming(FLASH_TypeDef *flashx, uint32_t programming_mode)
{
#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
  MODIFY_REG(flashx->SECCR, FLASH_SECCR_BWR | FLASH_SECCR_PG, programming_mode | FLASH_SECCR_PG);
#else
  MODIFY_REG(flashx->NSCR, FLASH_NSCR_BWR | FLASH_NSCR_PG, programming_mode | FLASH_NSCR_PG);
#endif /* __ARM_FEATURE_CMSE */
}

#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
/**
  * @brief  Set the configuration of flash programming for the non-secure flash memory.
  * @rmtoll NSCR           PG/BWR           LL_FLASH_NS_SetConfigProgramming
  * @param  FLASH instance.
  * @param  programming_mode
  *         This parameter can be one of the following values:
  *         @arg @ref LL_FLASH_PROGRAM_QUADWORD_MODE
  *         @arg @ref LL_FLASH_PROGRAM_BURST_MODE
  */
__STATIC_INLINE void LL_FLASH_NS_SetConfigProgramming(FLASH_TypeDef *flashx, uint32_t programming_mode)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(flashx);

  MODIFY_REG(FLASH_NS->NSCR, FLASH_NSCR_BWR | FLASH_NSCR_PG, programming_mode | FLASH_NSCR_PG);
}
#endif /* __ARM_FEATURE_CMSE */

/**
  * @brief  Start the flash erase operation.
  * @rmtoll NSCR/SECCR           STRT           LL_FLASH_StartEraseOperation
  * @param  FLASH instance.
  */
__STATIC_INLINE void LL_FLASH_StartEraseOperation(FLASH_TypeDef *flashx)
{
#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
  SET_BIT(flashx->SECCR, FLASH_SECCR_STRT);
#else
  SET_BIT(flashx->NSCR, FLASH_NSCR_STRT);
#endif /* __ARM_FEATURE_CMSE */
}

#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
/**
  * @brief  Start the flash erase operation for the non-secure flash memory.
  * @rmtoll
  *  NSCR           STRT           LL_FLASH_NS_StartEraseOperation
  * @param  FLASH instance.
  */
__STATIC_INLINE void LL_FLASH_NS_StartEraseOperation(FLASH_TypeDef *flashx)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(flashx);

  __IO uint32_t *reg_addr = &FLASH_NS->NSCR;
  SET_BIT(*reg_addr, FLASH_NSCR_STRT);
}
#endif /* __ARM_FEATURE_CMSE */

/**
  * @brief  Start the flash erase page.
  * @rmtoll NSCR/SECCR           BKER/PNB/PER/STRT           LL_FLASH_StartErasePage
  * @param  FLASH instance.
  * @param  bank
  *         This parameter can be one of the following values :
  *         @arg @ref LL_FLASH_PAGE_ERASE_BANK_1
  *         @arg @ref LL_FLASH_PAGE_ERASE_BANK_2
  * @param  page_idx This parameter a value in [0:127]
  */
__STATIC_INLINE void LL_FLASH_StartErasePage(FLASH_TypeDef *flashx, uint32_t bank, uint32_t page_idx)
{
#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
  MODIFY_REG(flashx->SECCR, FLASH_SECCR_BKER | FLASH_SECCR_PNB | FLASH_SECCR_PER | FLASH_SECCR_STRT,
             (bank | (page_idx << FLASH_SECCR_PNB_Pos) | FLASH_SECCR_PER | FLASH_SECCR_STRT));
#else
  MODIFY_REG(flashx->NSCR, FLASH_NSCR_BKER | FLASH_NSCR_PNB | FLASH_NSCR_PER | FLASH_NSCR_STRT,
             (bank | (page_idx << FLASH_NSCR_PNB_Pos) | FLASH_NSCR_PER | FLASH_NSCR_STRT));
#endif /* __ARM_FEATURE_CMSE */
}

#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
/**
  * @brief  Start the flash erase page for the non-secure flash memory.
  * @rmtoll NSCR           BKER/PNB/PER/STRT           LL_FLASH_NS_StartErasePage
  * @param  FLASH instance.
  * @param  bank
  *         This parameter can be one of the following values :
  *         @arg @ref LL_FLASH_PAGE_ERASE_BANK_1
  *         @arg @ref LL_FLASH_PAGE_ERASE_BANK_2
  * @param  page_idx This parameter a value in [0:127]
  */
__STATIC_INLINE void LL_FLASH_NS_StartErasePage(FLASH_TypeDef *flashx, uint32_t bank, uint32_t page_idx)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(flashx);

  __IO uint32_t *reg_addr = &FLASH_NS->NSCR;
  MODIFY_REG(*reg_addr, FLASH_NSCR_BKER | FLASH_NSCR_PNB | FLASH_NSCR_PER | FLASH_NSCR_STRT,
             (bank | (page_idx << FLASH_NSCR_PNB_Pos) | FLASH_NSCR_PER | FLASH_NSCR_STRT));
}
#endif /* __ARM_FEATURE_CMSE */

/**
  * @brief  Start the flash erase bank.
  * @rmtoll NSCR/SECCR           MER1/MER2/STRT           LL_FLASH_StartEraseBank
  * @param  FLASH instance.
  * @param  bank
  *         This parameter can be one of the following values :
  *         @arg @ref LL_FLASH_PAGE_ERASE_BANK_1
  *         @arg @ref LL_FLASH_PAGE_ERASE_BANK_2
  */
__STATIC_INLINE void LL_FLASH_StartEraseBank(FLASH_TypeDef *flashx, uint32_t bank)
{
#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
  MODIFY_REG(flashx->SECCR, FLASH_SECCR_MER1 | FLASH_SECCR_MER2 | FLASH_SECCR_STRT, (bank | FLASH_SECCR_STRT));
#else
  MODIFY_REG(flashx->NSCR, FLASH_NSCR_MER1 | FLASH_NSCR_MER2 | FLASH_NSCR_STRT, (bank | FLASH_NSCR_STRT));
#endif /* __ARM_FEATURE_CMSE */
}

#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
/**
  * @brief  Start the flash erase bank for the non-secure flash memory.
  * @rmtoll NSCR           MER1/MER2/STRT           LL_FLASH_NS_StartEraseBank
  * @param  FLASH instance.
  * @param  bank
  *         This parameter can be one of the following values :
  *         @arg @ref LL_FLASH_PAGE_ERASE_BANK_1
  *         @arg @ref LL_FLASH_PAGE_ERASE_BANK_2
  */
__STATIC_INLINE void LL_FLASH_NS_StartEraseBank(FLASH_TypeDef *flashx, uint32_t bank)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(flashx);

  __IO uint32_t *reg_addr = &FLASH_NS->NSCR;
  MODIFY_REG(*reg_addr, FLASH_NSCR_MER1 | FLASH_NSCR_MER2 | FLASH_NSCR_STRT, (bank | FLASH_NSCR_STRT));
}
#endif /* __ARM_FEATURE_CMSE */

/**
  * @brief  Disable all flash operation.
  * @rmtoll NSCR/SECCR           EOPIE/ERRIE/PG/PER/MER1/MER2           LL_FLASH_DisableAllOperation
  * @param  FLASH instance.
  */
__STATIC_INLINE void LL_FLASH_DisableAllOperation(FLASH_TypeDef *flashx)
{
#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
  CLEAR_BIT(flashx->SECCR, FLASH_SECCR_EOPIE | FLASH_SECCR_ERRIE | FLASH_SECCR_PG \
            | FLASH_SECCR_PER | FLASH_SECCR_MER1 | FLASH_SECCR_MER2);
#else
  CLEAR_BIT(flashx->NSCR, FLASH_NSCR_EOPIE | FLASH_NSCR_ERRIE | FLASH_NSCR_PG \
            | FLASH_NSCR_PER | FLASH_NSCR_MER1 | FLASH_NSCR_MER2);
#endif /* __ARM_FEATURE_CMSE */
}

#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
/**
  * @brief  Disable all flash operation for the non-secure flash memory.
  * @rmtoll NSCR           EOPIE/ERRIE/PG/PER/MER1/MER2          LL_FLASH_NS_DisableAllOperation
  * @param  FLASH instance.
  */
__STATIC_INLINE void LL_FLASH_NS_DisableAllOperation(FLASH_TypeDef *flashx)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(flashx);

  CLEAR_BIT(FLASH_NS->NSCR, FLASH_NSCR_EOPIE | FLASH_NSCR_ERRIE | FLASH_NSCR_PG \
            | FLASH_NSCR_PER | FLASH_NSCR_MER1 | FLASH_NSCR_MER2);
}
#endif /* __ARM_FEATURE_CMSE */

/**
  * @brief  Start the flash option bytes modification.
  * @rmtoll
  *  NSCR           OPTSTRT           LL_FLASH_OB_StartModification
  * @param  FLASH instance.
  */
__STATIC_INLINE void LL_FLASH_OB_StartModification(FLASH_TypeDef *flashx)
{
  SET_BIT(flashx->NSCR, FLASH_NSCR_OPTSTRT);
}

/**
  * @brief  Enable the flash interrupt.
  * @rmtoll NSCR/SECCR          EOPIE/ERRIE        LL_FLASH_EnableIT
  * @param  FLASH instance.
  * @param  interrupt
  *         This parameter can be a combination of the following values:
  *         @arg @ref LL_FLASH_IT_EOP
  *         @arg @ref LL_FLASH_IT_ERR
  *         @arg @ref LL_FLASH_IT_ALL
  */
__STATIC_INLINE void LL_FLASH_EnableIT(FLASH_TypeDef *flashx, uint32_t interrupt)
{
#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
  SET_BIT(flashx->SECCR, interrupt);
#else
  SET_BIT(flashx->NSCR, interrupt);
#endif /* __ARM_FEATURE_CMSE */
}

#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
/**
  * @brief  Enable the flash interrupt for the non-secure flash memory.
  * @rmtoll NSCR          EOPIE/ERRIE        LL_FLASH_NS_EnableIT
  * @param  FLASH instance.
  * @param  interrupt
  *         This parameter can be a combination of the following values:
  *         @arg @ref LL_FLASH_IT_EOP
  *         @arg @ref LL_FLASH_IT_ERR
  *         @arg @ref LL_FLASH_IT_ALL
  */
__STATIC_INLINE void LL_FLASH_NS_EnableIT(FLASH_TypeDef *flashx, uint32_t interrupt)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(flashx);

  SET_BIT(FLASH_NS->NSCR, interrupt);
}
#endif /* __ARM_FEATURE_CMSE */

/**
  * @brief  Disable the flash interrupt.
  * @rmtoll NSCR/SECCR          EOPIE/ERRIE        LL_FLASH_DisableIT
  * @param  FLASH instance.
  * @param  interrupt
  *         This parameter can be a combination of the following values:
  *         @arg @ref LL_FLASH_IT_EOP
  *         @arg @ref LL_FLASH_IT_ERR
  *         @arg @ref LL_FLASH_IT_ALL
  */
__STATIC_INLINE void LL_FLASH_DisableIT(FLASH_TypeDef *flashx, uint32_t interrupt)
{
#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
  CLEAR_BIT(flashx->SECCR, interrupt);
#else
  CLEAR_BIT(flashx->NSCR, interrupt);
#endif /* __ARM_FEATURE_CMSE */
}

#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
/**
  * @brief  Disable the flash interrupt for the non-secure flash memory.
  * @rmtoll NSCR          EOPIE/ERRIE        LL_FLASH_NS_DisableIT
  * @param  FLASH instance.
  * @param  interrupt
  *         This parameter can be a combination of the following values:
  *         @arg @ref LL_FLASH_IT_EOP
  *         @arg @ref LL_FLASH_IT_ERR
  *         @arg @ref LL_FLASH_IT_ALL
  */
__STATIC_INLINE void LL_FLASH_NS_DisableIT(FLASH_TypeDef *flashx, uint32_t interrupt)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(flashx);

  CLEAR_BIT(FLASH_NS->NSCR, interrupt);
}
#endif /* __ARM_FEATURE_CMSE */

/**
  * @brief  Enable the flash end of operation interrupt.
  * @rmtoll NSCR/SECCR          EOPIE        LL_FLASH_EnableIT_EOP
  * @param  FLASH instance.
  */
__STATIC_INLINE void LL_FLASH_EnableIT_EOP(FLASH_TypeDef *flashx)
{
#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
  SET_BIT(flashx->SECCR, FLASH_SECCR_EOPIE);
#else
  SET_BIT(flashx->NSCR, FLASH_NSCR_EOPIE);
#endif /* __ARM_FEATURE_CMSE */
}

#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
/**
  * @brief  Enable the flash end of operation interrupt for the non-secure flash memory.
  * @rmtoll
  *  NSCR          EOPIE        LL_FLASH_NS_EnableIT_EOP
  * @param  FLASH instance.
  */
__STATIC_INLINE void LL_FLASH_NS_EnableIT_EOP(FLASH_TypeDef *flashx)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(flashx);

