STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/ll/stm32u5xx_ll_flash.h
  SET_BIT(FLASH_NS->NSCR, FLASH_NSCR_EOPIE);
}
#endif /* __ARM_FEATURE_CMSE */

/**
  * @brief  Disable the flash end of operation interrupt.
  * @rmtoll
  *  NSCR          EOPIE        LL_FLASH_DisableIT_EOP
  * @param  FLASH instance.
  */
__STATIC_INLINE void LL_FLASH_DisableIT_EOP(FLASH_TypeDef *flashx)
{
#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
  CLEAR_BIT(flashx->SECCR, FLASH_SECCR_EOPIE);
#else
  CLEAR_BIT(flashx->NSCR, FLASH_NSCR_EOPIE);
#endif /* __ARM_FEATURE_CMSE */
}

#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
/**
  * @brief  Disable the flash end of operation interrupt for the non-secure flash memory.
  * @rmtoll
  *  NSCR          EOPIE        LL_FLASH_NS_DisableIT_EOP
  * @param  FLASH instance.
  */
__STATIC_INLINE void LL_FLASH_NS_DisableIT_EOP(FLASH_TypeDef *flashx)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(flashx);

  CLEAR_BIT(FLASH_NS->NSCR, FLASH_NSCR_EOPIE);
}
#endif /* __ARM_FEATURE_CMSE */

/**
  * @brief  Check if the flash end of operation interrupt is enabled or disabled.
  * @rmtoll NSCR/SECCR          EOPIE        LL_FLASH_IsEnabledIT_EOP
  * @param  FLASH instance.
  * @retval State of flash EOP interruption (1 enabled / 0 disabled).
  */
__STATIC_INLINE uint32_t LL_FLASH_IsEnabledIT_EOP(const FLASH_TypeDef *flashx)
{
#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
  return ((READ_BIT(flashx->SECCR, FLASH_SECCR_EOPIE) == (FLASH_SECCR_EOPIE)) ? 1UL : 0UL);
#else
  return ((READ_BIT(flashx->NSCR, FLASH_NSCR_EOPIE) == (FLASH_NSCR_EOPIE)) ? 1UL : 0UL);
#endif /* __ARM_FEATURE_CMSE */
}

#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
/**
  * @brief  Check if the flash end of operation interrupt is enabled or disabled for the non-secure flash memory.
  * @rmtoll
  *  NSCR          EOPIE        LL_FLASH_NS_IsEnabledIT_EOP
  * @param  FLASH instance.
  * @retval State of flash non-secure EOP interruption (1 enabled / 0 disabled).
  */
__STATIC_INLINE uint32_t LL_FLASH_NS_IsEnabledIT_EOP(const FLASH_TypeDef *flashx)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(flashx);

  return ((READ_BIT(FLASH_NS->NSCR, FLASH_NSCR_EOPIE) == (FLASH_NSCR_EOPIE)) ? 1UL : 0UL);
}
#endif /* __ARM_FEATURE_CMSE */

/**
  * @brief  Enable the flash error interrupt.
  * @rmtoll NSCR/SECCR          ERRIE        LL_FLASH_EnableIT_ERR
  * @param  FLASH instance.
  */
__STATIC_INLINE void LL_FLASH_EnableIT_ERR(FLASH_TypeDef *flashx)
{
#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
  SET_BIT(flashx->SECCR, FLASH_SECCR_ERRIE);
#else
  SET_BIT(flashx->NSCR, FLASH_NSCR_ERRIE);
#endif /* __ARM_FEATURE_CMSE */
}

#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
/**
  * @brief  Enable the flash error interrupt for the non-secure flash memory.
  * @rmtoll
  *  NSCR          ERRIE        LL_FLASH_NS_EnableIT_ERR
  * @param  FLASH instance.
  */
__STATIC_INLINE void LL_FLASH_NS_EnableIT_ERR(FLASH_TypeDef *flashx)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(flashx);

  SET_BIT(FLASH_NS->NSCR, FLASH_NSCR_ERRIE);
}
#endif /* __ARM_FEATURE_CMSE */

/**
  * @brief  Disable the flash error interrupt.
  * @rmtoll
  *  NSCR          ERRIE        LL_FLASH_DisableIT_ERR
  * @param  FLASH instance.
  */
__STATIC_INLINE void LL_FLASH_DisableIT_ERR(FLASH_TypeDef *flashx)
{
#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
  CLEAR_BIT(flashx->SECCR, FLASH_SECCR_ERRIE);
#else
  CLEAR_BIT(flashx->NSCR, FLASH_NSCR_ERRIE);
#endif /* __ARM_FEATURE_CMSE */
}

#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
/**
  * @brief  Disable the flash error interrupt for the non-secure flash memory.
  * @rmtoll
  *  NSCR          ERRIE        LL_FLASH_NS_DisableIT_ERR
  * @param  FLASH instance.
  */
__STATIC_INLINE void LL_FLASH_NS_DisableIT_ERR(FLASH_TypeDef *flashx)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(flashx);

  CLEAR_BIT(FLASH_NS->NSCR, FLASH_NSCR_ERRIE);
}
#endif /* __ARM_FEATURE_CMSE */

/**
  * @brief  Check if the flash error interrupt is enabled or disabled.
  * @rmtoll NSCR/SECCR          ERRIE        LL_FLASH_IsEnabledIT_ERR
  * @param  FLASH instance.
  * @retval State of flash ERR interruption (1 enabled / 0 disabled).
  */
__STATIC_INLINE uint32_t LL_FLASH_IsEnabledIT_ERR(const FLASH_TypeDef *flashx)
{
#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
  return ((READ_BIT(flashx->SECCR, FLASH_SECCR_ERRIE) == (FLASH_SECCR_ERRIE)) ? 1UL : 0UL);
#else
  return ((READ_BIT(flashx->NSCR, FLASH_NSCR_ERRIE) == (FLASH_NSCR_ERRIE)) ? 1UL : 0UL);
#endif /* __ARM_FEATURE_CMSE */
}

#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
/**
  * @brief  Check if the flash error interrupt is enabled or disabled for the non-secure flash memory.
  * @rmtoll
  *  NSCR          ERRIE        LL_FLASH_NS_IsEnabledIT_ERR
  * @param  FLASH instance.
  * @retval State of flash non-secure ERR interruption (1 enabled / 0 disabled).
  */
__STATIC_INLINE uint32_t LL_FLASH_NS_IsEnabledIT_ERR(const FLASH_TypeDef *flashx)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(flashx);

  return ((READ_BIT(FLASH_NS->NSCR, FLASH_NSCR_ERRIE) == (FLASH_NSCR_ERRIE)) ? 1UL : 0UL);
}
#endif /* __ARM_FEATURE_CMSE */

/**
  * @brief  Launch the flash option bytes loading.
  * @rmtoll
  *  NSCR           OBL_LAUNCH           LL_FLASH_OB_Launch
  * @param  FLASH instance.
  */
__STATIC_INLINE void LL_FLASH_OB_Launch(FLASH_TypeDef *flashx)
{
  SET_BIT(flashx->NSCR, FLASH_NSCR_OBL_LAUNCH);
}

/**
  * @brief  Check if the flash option bytes loading is launched.
  * @rmtoll
  *  NSCR           OBL_LAUNCH           LL_FLASH_OB_IsLaunched
  * @param  FLASH instance.
  * @retval State of flash option bytes launch (1 launched / 0 not launched).
  */
__STATIC_INLINE uint32_t LL_FLASH_OB_IsLaunched(const FLASH_TypeDef *flashx)
{
  return ((READ_BIT(flashx->NSCR, FLASH_NSCR_OBL_LAUNCH) == (FLASH_NSCR_OBL_LAUNCH)) ? 1UL : 0UL);
}

#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
/**
  * @brief  Set the flash security state inversion.
  * @rmtoll
  *  SECCR           INV           LL_FLASH_SetSecurityStateInversion
  * @param  FLASH instance.
  * @param  sec_state_inversion
  *         This parameter can be one of the following values :
  *         @arg @ref LL_FLASH_SEC_NOT_INVERTED
  *         @arg @ref LL_FLASH_SEC_INVERTED
  */
__STATIC_INLINE void LL_FLASH_SetSecurityStateInversion(FLASH_TypeDef *flashx, uint32_t sec_state_inversion)
{
  MODIFY_REG(flashx->SECCR, FLASH_SECCR_INV, sec_state_inversion);
}

/**
  * @brief  Get the flash security state inversion.
  * @rmtoll
  *  SECCR           INV           LL_FLASH_GetSecurityStateInversion
  * @param  FLASH instance.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_FLASH_SEC_NOT_INVERTED
  *         @arg @ref LL_FLASH_SEC_INVERTED
  */
__STATIC_INLINE uint32_t LL_FLASH_GetSecurityStateInversion(const FLASH_TypeDef *flashx)
{
  return (READ_BIT(flashx->SECCR, FLASH_SECCR_INV));
}
#endif /* __ARM_FEATURE_CMSE */

/**
  * @brief  Lock the flash option bytes control access registers.
  * @rmtoll
  *  NSCR           OPTLOCK           LL_FLASH_OB_Lock
  * @param  FLASH instance.
  */
__STATIC_INLINE void LL_FLASH_OB_Lock(FLASH_TypeDef *flashx)
{
  SET_BIT(flashx->NSCR, FLASH_NSCR_OPTLOCK);
}

/**
  * @brief  Check the flash option bytes control access registers lock state.
  * @rmtoll
  *  NSCR           OPTLOCK           LL_FLASH_OB_IsLocked
  * @param  FLASH instance.
  * @retval State of flash option bytes lock (1 locked / 0 unlocked).
  */
__STATIC_INLINE uint32_t LL_FLASH_OB_IsLocked(const FLASH_TypeDef *flashx)
{
  return ((READ_BIT(flashx->NSCR, FLASH_NSCR_OPTLOCK) == (FLASH_NSCR_OPTLOCK)) ? 1UL : 0UL);
}

/**
  * @brief  Lock the flash control assess registers.
  * @rmtoll NSCR/SECCR           LOCK           LL_FLASH_Lock
  * @param  FLASH instance.
  */
__STATIC_INLINE void LL_FLASH_Lock(FLASH_TypeDef *flashx)
{
#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
  SET_BIT(flashx->SECCR, FLASH_SECCR_LOCK);
#else
  SET_BIT(flashx->NSCR, FLASH_NSCR_LOCK);
#endif /* __ARM_FEATURE_CMSE */
}

#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
/**
  * @brief  Lock the flash control assess registers for the non-secure flash memory.
  * @rmtoll
  *  NSCR           LOCK           LL_FLASH_NS_Lock
  * @param  FLASH instance.
  */
__STATIC_INLINE void LL_FLASH_NS_Lock(FLASH_TypeDef *flashx)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(flashx);

  SET_BIT(FLASH_NS->NSCR, FLASH_NSCR_LOCK);
}
#endif /* __ARM_FEATURE_CMSE */

/**
  * @brief  Check the flash control access registers lock state.
  * @rmtoll NSCR/SECCR           LOCK           LL_FLASH_IsLocked
  * @param  FLASH instance.
  * @retval State of flash lock (1 locked / 0 unlocked).
  */
__STATIC_INLINE uint32_t LL_FLASH_IsLocked(const FLASH_TypeDef *flashx)
{
#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
  return ((READ_BIT(flashx->SECCR, FLASH_SECCR_LOCK) == (FLASH_SECCR_LOCK)) ? 1UL : 0UL);
#else
  return ((READ_BIT(flashx->NSCR, FLASH_NSCR_LOCK) == (FLASH_NSCR_LOCK)) ? 1U : 0U);
#endif /* __ARM_FEATURE_CMSE */
}

#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
/**
  * @brief  Check the flash control access registers lock state for the non-secure flash memory.
  * @rmtoll
  *  NSCR           LOCK           LL_FLASH_NS_IsLocked
  * @param  FLASH instance.
  * @retval State of flash non-secure lock (1 locked / 0 unlocked).
  */
__STATIC_INLINE uint32_t LL_FLASH_NS_IsLocked(const FLASH_TypeDef *flashx)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(flashx);

  return ((READ_BIT(FLASH_NS->NSCR, FLASH_NSCR_LOCK) == (FLASH_NSCR_LOCK)) ? 1U : 0U);
}
#endif /* __ARM_FEATURE_CMSE */

/**
  * @brief  Get the flash ECC fail address offset.
  * @rmtoll
  *  ECCR           ADDR_ECC           LL_FLASH_GetECCFailAddressOffset
  * @param  FLASH instance.
  * @retval Returned value : ECC failed address offset.
  */
__STATIC_INLINE uint32_t LL_FLASH_GetECCFailAddressOffset(const FLASH_TypeDef *flashx)
{
  return (READ_BIT(flashx->ECCR, FLASH_ECCR_ADDR_ECC));
}

/**
  * @brief  Get the flash ECC fail bank.
  * @rmtoll
  *  ECCR           BK_ECC           LL_FLASH_GetECCFailBank
  * @param  FLASH instance.
  * @retval Returned value : ECC failed bank.
  */
__STATIC_INLINE uint32_t LL_FLASH_GetECCFailBank(const FLASH_TypeDef *flashx)
{
  return (READ_BIT(flashx->ECCR, FLASH_ECCR_BK_ECC));
}

/**
  * @brief  Get the flash ECC fail system flash.
  * @rmtoll
  *  ECCR           SYSF_ECC           LL_FLASH_GetECCFailFlash
  * @param  FLASH instance.
  * @retval Returned value : ECC failed systeme flash.
  */
__STATIC_INLINE uint32_t LL_FLASH_GetECCFailFlash(const FLASH_TypeDef *flashx)
{
  return (READ_BIT(flashx->ECCR, FLASH_ECCR_SYSF_ECC));
}

/**
  * @brief  Get the flash ECC fail area.
  * @rmtoll ECCR           BK_ECC/SYSF_ECC           LL_FLASH_GetECCFailArea
  * @param  FLASH instance.
  * @retval Returned value : ECC failed systeme flash.
  */
__STATIC_INLINE uint32_t LL_FLASH_GetECCFailArea(const FLASH_TypeDef *flashx)
{
  return (READ_BIT(flashx->ECCR, (FLASH_ECCR_BK_ECC | FLASH_ECCR_SYSF_ECC)));
}

/**
  * @brief  Enable the flash ECC interrupt.
  * @rmtoll
  *  ECCR           ECCIE           LL_FLASH_EnableIT_ECC
  * @param  FLASH instance.
  */
__STATIC_INLINE void LL_FLASH_EnableIT_ECC(FLASH_TypeDef *flashx)
{
  SET_BIT(flashx->ECCR, FLASH_ECCR_ECCIE);
}

/**
  * @brief  Disable the flash ECC interrupt.
  * @rmtoll
  *  ECCR           ECCIE           LL_FLASH_DisableIT_ECC
  * @param  FLASH instance.
  */
__STATIC_INLINE void LL_FLASH_DisableIT_ECC(FLASH_TypeDef *flashx)
{
  CLEAR_BIT(flashx->ECCR, FLASH_ECCR_ECCIE);
}

/**
  * @brief  Check if the flash ECC interrupt is enabled or disabled.
  * @rmtoll
  *  ECCR           ECCIE           LL_FLASH_IsEnabledIT_ECC
  * @param  FLASH instance.
  * @retval State of flash ECC interruption (1 enabled / 0 disabled).
  */
__STATIC_INLINE uint32_t LL_FLASH_IsEnabledIT_ECC(const FLASH_TypeDef *flashx)
{
  return ((READ_BIT(flashx->ECCR, FLASH_ECCR_ECCIE) == (FLASH_ECCR_ECCIE)) ? 1UL : 0UL);
}

/**
  * @brief  Check if the flash ECC single error flag is active.
  * @rmtoll
  *  ECCR           ECCC           LL_FLASH_IsActiveFlag_ECCC
  * @param  FLASH instance.
  * @retval State of flash ECCC flag (1 active / 0 not active).
  */
__STATIC_INLINE uint32_t LL_FLASH_IsActiveFlag_ECCC(const FLASH_TypeDef *flashx)
{
  return ((READ_BIT(flashx->ECCR, FLASH_ECCR_ECCC) == (FLASH_ECCR_ECCC)) ? 1UL : 0UL);
}

/**
  * @brief  Clear the flash ECC single error flag.
  * @rmtoll
  *  ECCR           ECCC           LL_FLASH_ClearFlag_ECCC
  * @param  FLASH instance.
  */
__STATIC_INLINE void LL_FLASH_ClearFlag_ECCC(FLASH_TypeDef *flashx)
{
  SET_BIT(flashx->ECCR, FLASH_ECCR_ECCC);
}

/**
  * @brief  Check if the flash ECC double error flag is active.
  * @rmtoll
  *  ECCR           ECCD           LL_FLASH_IsActiveFlag_ECCD
  * @param  FLASH instance.
  * @retval State of flash ECCD flag (1 active / 0 not active).
  */
__STATIC_INLINE uint32_t LL_FLASH_IsActiveFlag_ECCD(const FLASH_TypeDef *flashx)
{
  return ((READ_BIT(flashx->ECCR, FLASH_ECCR_ECCD) == (FLASH_ECCR_ECCD)) ? 1UL : 0UL);
}

/**
  * @brief  Clear the flash ECC double error flag.
  * @rmtoll
  *  ECCR           ECCD           LL_FLASH_ClearFlag_ECCD
  * @param  FLASH instance.
  */
__STATIC_INLINE void LL_FLASH_ClearFlag_ECCD(FLASH_TypeDef *flashx)
{
  SET_BIT(flashx->ECCR, FLASH_ECCR_ECCD);
}

/**
  * @brief  Get the flash interrupted operation address offset.
  * @rmtoll
  *  OPSR           ADDR_OP           LL_FLASH_GetOperInterruptedAddressOffset
  * @param  FLASH instance.
  * @retval Returned value : the flash interrupted operation address offset.
  */
__STATIC_INLINE uint32_t LL_FLASH_GetOperInterruptedAddressOffset(const FLASH_TypeDef *flashx)
{
  return (READ_BIT(flashx->OPSR, FLASH_OPSR_ADDR_OP));
}

/**
  * @brief  Get the flash interrupted operation bank.
  * @rmtoll
  *  OPSR           BK_OP           LL_FLASH_GetOperInterruptedBank
  * @param  FLASH instance.
  * @retval Returned value : the flash interrupted operation bank.
  */
__STATIC_INLINE uint32_t LL_FLASH_GetOperInterruptedBank(const FLASH_TypeDef *flashx)
{
  return (READ_BIT(flashx->OPSR, FLASH_OPSR_BK_OP));
}

/**
  * @brief  Get the flash interrupted operation system flash.
  * @rmtoll
  *  OPSR           SYSF_OP           LL_FLASH_GetOperInterruptedFlash
  * @param  FLASH instance.
  * @retval Returned value : the flash interrupted operation system flash.
  */
__STATIC_INLINE uint32_t LL_FLASH_GetOperInterruptedFlash(const FLASH_TypeDef *flashx)
{
  return (READ_BIT(flashx->OPSR, FLASH_OPSR_SYSF_OP));
}

/**
  * @brief  Get the flash interrupted operation code.
  * @rmtoll
  *  OPSR           CODE_OP           LL_FLASH_GetOperInterruptedCode
  * @param  FLASH instance.
  * @retval Returned value : the flash interrupted operation code.
  */
__STATIC_INLINE uint32_t LL_FLASH_GetOperInterruptedCode(const FLASH_TypeDef *flashx)
{
  return (READ_BIT(flashx->OPSR, FLASH_OPSR_CODE_OP));
}

/**
  * @brief Set the flash Readout protection level.
  * @rmtoll
  *  OPTR           RDP           LL_FLASH_OB_SetRDPLevel
  * @param  FLASH instance.
  * @param  rdp_level
  *         This parameter can be one of the following values:
  *         @arg @ref LL_FLASH_OB_RDP_LEVEL_0
  *         @arg @ref LL_FLASH_OB_RDP_LEVEL_0_5
  *         @arg @ref LL_FLASH_OB_RDP_LEVEL_1
  *         @arg @ref LL_FLASH_OB_RDP_LEVEL_2
  */
__STATIC_INLINE void LL_FLASH_OB_SetRDPLevel(FLASH_TypeDef *flashx, uint32_t rdp_level)
{
  MODIFY_REG(flashx->OPTR, FLASH_OPTR_RDP, rdp_level);
}

/**
  * @brief  Get the flash Readout protection level.
  * @rmtoll
  *  OPTR           RDP           LL_FLASH_OB_GetRDPLevel
  * @param  FLASH instance.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_FLASH_OB_RDP_LEVEL_0
  *         @arg @ref LL_FLASH_OB_RDP_LEVEL_0_5
  *         @arg @ref LL_FLASH_OB_RDP_LEVEL_1
  *         @arg @ref LL_FLASH_OB_RDP_LEVEL_2
  */
__STATIC_INLINE uint32_t LL_FLASH_OB_GetRDPLevel(const FLASH_TypeDef *flashx)
{
  return (READ_BIT(flashx->OPTR, FLASH_OPTR_RDP));
}

/**
  * @brief  Set the flash BOR level.
  * @rmtoll
  *  OPTR           BOR_LEV           LL_FLASH_OB_SetBORLevel
  * @param  FLASH instance.
  * @param  bor_level
  *         This parameter can be one of the following values:
  *         @arg @ref LL_FLASH_OB_BOR_LEVEL_0
  *         @arg @ref LL_FLASH_OB_BOR_LEVEL_1
  *         @arg @ref LL_FLASH_OB_BOR_LEVEL_2
  *         @arg @ref LL_FLASH_OB_BOR_LEVEL_3
  *         @arg @ref LL_FLASH_OB_BOR_LEVEL_4
  */
__STATIC_INLINE void LL_FLASH_OB_SetBORLevel(FLASH_TypeDef *flashx, uint32_t bor_level)
{
  MODIFY_REG(flashx->OPTR, FLASH_OPTR_BOR_LEV, bor_level);
}

/**
  * @brief  Get the flash BOR level.
  * @rmtoll
  *  OPTR           BOR_LEV           LL_FLASH_OB_GetBORLevel
  * @param  FLASH instance.

  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_FLASH_OB_BOR_LEVEL_0
  *         @arg @ref LL_FLASH_OB_BOR_LEVEL_1
  *         @arg @ref LL_FLASH_OB_BOR_LEVEL_2
  *         @arg @ref LL_FLASH_OB_BOR_LEVEL_3
  *         @arg @ref LL_FLASH_OB_BOR_LEVEL_4
  */
__STATIC_INLINE uint32_t LL_FLASH_OB_GetBORLevel(const FLASH_TypeDef *flashx)
{
  return (READ_BIT(flashx->OPTR, FLASH_OPTR_BOR_LEV));
}

/**
  * @brief  Set the flash reset generation in stop mode.
  * @rmtoll
  *  OPTR           NRST_STOP           LL_FLASH_OB_SetNRSTStopMode
  * @param  FLASH instance.
  * @param  rst_generation
  *         This parameter can be one of the following values:
  *         @arg @ref LL_FLASH_OB_RST_STOP_MODE
  *         @arg @ref LL_FLASH_OB_NO_RST_STOP_MODE
  */
__STATIC_INLINE void LL_FLASH_OB_SetNRSTStopMode(FLASH_TypeDef *flashx, uint32_t rst_generation)
{
  MODIFY_REG(flashx->OPTR, FLASH_OPTR_nRST_STOP, rst_generation);
}

/**
  * @brief  Get the flash reset generation in stop mode.
  * @rmtoll
  *  OPTR           NRST_STOP           LL_FLASH_OB_DisableNRSTStopMode
  * @param  FLASH instance.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_FLASH_OB_RST_STOP_MODE
  *         @arg @ref LL_FLASH_OB_NO_RST_STOP_MODE
  */
__STATIC_INLINE uint32_t LL_FLASH_OB_GetNRSTStopMode(const FLASH_TypeDef *flashx)
{
  return (READ_BIT(flashx->OPTR, FLASH_OPTR_nRST_STOP));
}

/**
  * @brief  Set the flash reset generation in standby mode.
  * @rmtoll
  *  OPTR           NRST_STDBY           LL_FLASH_OB_SetNRSTStandbyMode
  * @param  FLASH instance.
  * @param  rst_generation
  *         This parameter can be one of the following values:
  *         @arg @ref LL_FLASH_OB_RST_STDBY_MODE
  *         @arg @ref LL_FLASH_OB_NO_RST_STDBY_MODE
  */
__STATIC_INLINE void LL_FLASH_OB_SetNRSTStandbyMode(FLASH_TypeDef *flashx, uint32_t rst_generation)
{
  MODIFY_REG(flashx->OPTR, FLASH_OPTR_nRST_STDBY, rst_generation);
}

/**
  * @brief  Get the flash reset generation in standby mode.
  * @rmtoll
  *  OPTR           NRST_STDBY           LL_FLASH_OB_DisableNRSTStopMode
  * @param  FLASH instance.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_FLASH_OB_RST_STDBY_MODE
  *         @arg @ref LL_FLASH_OB_NO_RST_STDBY_MODE
  */
__STATIC_INLINE uint32_t LL_FLASH_OB_GetNRSTStandbyMode(const FLASH_TypeDef *flashx)
{
  return (READ_BIT(flashx->OPTR, FLASH_OPTR_nRST_STDBY));
}

/**
  * @brief  Set the flash reset generation in shutdown mode.
  * @rmtoll
  *  OPTR           NRST_SHDW           LL_FLASH_OB_SetNRSTShutdownMode
  * @param  FLASH instance.
  * @param  rst_generation
  *         This parameter can be one of the following values:
  *         @arg @ref LL_FLASH_OB_RST_SHDW_MODE
  *         @arg @ref LL_FLASH_OB_NO_RST_SHDW_MODE
  */
__STATIC_INLINE void LL_FLASH_OB_SetNRSTShutdownMode(FLASH_TypeDef *flashx, uint32_t rst_generation)
{
  MODIFY_REG(flashx->OPTR, FLASH_OPTR_nRST_SHDW, rst_generation);
}

/**
  * @brief  Get the flash reset generation in shutdown mode.
  * @rmtoll
  *  OPTR           NRST_SHDW           LL_FLASH_OB_GetNRSTShutdownMode
  * @param  FLASH instance.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_FLASH_OB_RST_SHDW_MODE
  *         @arg @ref LL_FLASH_OB_NO_RST_SHDW_MODE
  */
__STATIC_INLINE uint32_t LL_FLASH_OB_GetNRSTShutdownMode(const FLASH_TypeDef *flashx)
{
  return (READ_BIT(flashx->OPTR, FLASH_OPTR_nRST_SHDW));
}

/**
  * @brief  Set the flash erase sram upon system reset.
  * @rmtoll
  *  OPTR           SRAM_RST           LL_FLASH_OB_SetSystemRstSRAMErase
  * @param  FLASH instance.
  * @param  erase_sram
  *         This parameter can be one of the following values:
  *         @arg @ref LL_FLASH_OB_ERASED_SRAM_SYS_RST
  *         @arg @ref LL_FLASH_OB_NOT_ERASED_SRAM_SYS_RST
  */
__STATIC_INLINE void LL_FLASH_OB_SetSystemRstSRAMErase(FLASH_TypeDef *flashx, uint32_t erase_sram)
{
  MODIFY_REG(flashx->OPTR, FLASH_OPTR_SRAM_RST, erase_sram);
}

/**
  * @brief  Get the flash erase sram upon system reset.
  * @rmtoll
  *  OPTR           SRAM_RST           LL_FLASH_OB_GetSystemRstSRAMErase
  * @param  FLASH instance.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_FLASH_OB_ERASED_SRAM_SYS_RST
  *         @arg @ref LL_FLASH_OB_NOT_ERASED_SRAM_SYS_RST
  */
__STATIC_INLINE uint32_t LL_FLASH_OB_GetSystemRstSRAMErase(const FLASH_TypeDef *flashx)
{
  return (READ_BIT(flashx->OPTR, FLASH_OPTR_SRAM_RST));
}

/**
  * @brief  Set the flash independent watchdog selection.
  * @rmtoll
  *  OPTR           IWDG_SW           LL_FLASH_OB_SetIWDGSelection
  * @param  FLASH instance.
  * @param  hw_sw_selection
  *         This parameter can be one of the following values:
  *         @arg @ref LL_FLASH_OB_IWDG_HW
  *         @arg @ref LL_FLASH_OB_IWDG_SW
  */
__STATIC_INLINE void LL_FLASH_OB_SetIWDGSelection(FLASH_TypeDef *flashx, uint32_t hw_sw_selection)
{
  MODIFY_REG(flashx->OPTR, FLASH_OPTR_IWDG_SW, hw_sw_selection);
}

/**
  * @brief  Get the flash independent watchdog selection.
  * @rmtoll
  *  OPTR           IWDG_SW           LL_FLASH_OB_GetIWDGSelection
  * @param  FLASH instance.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_FLASH_OB_IWDG_HW
  *         @arg @ref LL_FLASH_OB_IWDG_SW
  */
__STATIC_INLINE uint32_t LL_FLASH_OB_GetIWDGSelection(const FLASH_TypeDef *flashx)
{
  return (READ_BIT(flashx->OPTR, FLASH_OPTR_IWDG_SW));
}

/**
  * @brief  Freeze the flash independent watchdog counter in stop mode.
  * @rmtoll
  *  OPTR           IWDG_STOP           LL_FLASH_OB_FreezeIWDGStopMode
  * @param  FLASH instance.
  */
__STATIC_INLINE void LL_FLASH_OB_FreezeIWDGStopMode(FLASH_TypeDef *flashx)
{
  CLEAR_BIT(flashx->OPTR, FLASH_OPTR_IWDG_STOP);
}

/**
  * @brief  Unfreeze the flash independent watchdog counter in stop mode.
  * @rmtoll
  *  OPTR           IWDG_STOP           LL_FLASH_OB_UnfreezeIWDGStopMode
  * @param  FLASH instance.
  */
__STATIC_INLINE void LL_FLASH_OB_UnfreezeIWDGStopMode(FLASH_TypeDef *flashx)
{
  SET_BIT(flashx->OPTR, FLASH_OPTR_IWDG_STOP);
}

/**
  * @brief  Check the flash independent watchdog counter in stop mode is frozen.
  * @rmtoll
  *  OPTR           IWDG_STOP           LL_FLASH_OB_IsFrozenIWDGStopMode
  * @param  FLASH instance.
  * @retval State of flash option bytes IWDG counter in stop mode (1 frozen / 0 not frozen).
  */
__STATIC_INLINE uint32_t LL_FLASH_OB_IsFrozenIWDGStopMode(const FLASH_TypeDef *flashx)
{
  return ((READ_BIT(flashx->OPTR, FLASH_OPTR_IWDG_STOP) == (FLASH_OPTR_IWDG_STOP)) ? 0UL : 1UL);
}

