STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/ll/stm32u5xx_ll_flash.h
/**
  * @brief  Freeze the flash independent watchdog counter in standby mode.
  * @rmtoll
  *  OPTR           IWDG_STDBY           LL_FLASH_OB_FreezeIWDGStandbyMode
  * @param  FLASH instance.
  */
__STATIC_INLINE void LL_FLASH_OB_FreezeIWDGStandbyMode(FLASH_TypeDef *flashx)
{
  CLEAR_BIT(flashx->OPTR, FLASH_OPTR_IWDG_STDBY);
}

/**
  * @brief  Unfreeze the flash independent watchdog counter in standby mode.
  * @rmtoll
  *  OPTR           IWDG_STDBY           LL_FLASH_OB_UnfreezeIWDGStandbyMode
  * @param  FLASH instance.
  */
__STATIC_INLINE void LL_FLASH_OB_UnfreezeIWDGStandbyMode(FLASH_TypeDef *flashx)
{
  SET_BIT(flashx->OPTR, FLASH_OPTR_IWDG_STDBY);
}

/**
  * @brief  Check the flash independent watchdog counter in standby mode is frozen.
  * @rmtoll
  *  OPTR           IWDG_STDBY           LL_FLASH_OB_IsFrozenIWDGStandbyMode
  * @param  FLASH instance.
  * @retval State of flash option bytes IWDG counter in standby mode (1 frozen / 0 not frozen).
  */
__STATIC_INLINE uint32_t LL_FLASH_OB_IsFrozenIWDGStandbyMode(const FLASH_TypeDef *flashx)
{
  return ((READ_BIT(flashx->OPTR, FLASH_OPTR_IWDG_STDBY) == (FLASH_OPTR_IWDG_STDBY)) ? 0UL : 1UL);
}

/**
  * @brief  Set the flash window watchdog selection.
  * @rmtoll
  *  OPTR           WWDG_SW           LL_FLASH_OB_SetWWDGSelection
  * @param  FLASH instance.
  * @param  hw_sw_selection
  *         This parameter can be one of the following values:
  *         @arg @ref LL_FLASH_OB_WWDG_HW
  *         @arg @ref LL_FLASH_OB_WWDG_SW
  */
__STATIC_INLINE void LL_FLASH_OB_SetWWDGSelection(FLASH_TypeDef *flashx, uint32_t hw_sw_selection)
{
  MODIFY_REG(flashx->OPTR, FLASH_OPTR_WWDG_SW, hw_sw_selection);
}

/**
  * @brief  Get the flash window watchdog selection.
  * @rmtoll
  *  OPTR           WWDG_SW           LL_FLASH_OB_GetWWDGSelection
  * @param  FLASH instance.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_FLASH_OB_WWDG_HW
  *         @arg @ref LL_FLASH_OB_WWDG_SW
  */
__STATIC_INLINE uint32_t LL_FLASH_OB_GetWWDGSelection(const FLASH_TypeDef *flashx)
{
  return (READ_BIT(flashx->OPTR, FLASH_OPTR_WWDG_SW));
}

/**
  * @brief  Set the flash swap banks.
  * @rmtoll
  *  OPTR           SWAP_BANK           LL_FLASH_OB_SetSwapBanks
  * @param  FLASH instance.
  * @param  swap_bank
  *         This parameter can be one of the following values:
  *         @arg @ref LL_FLASH_OB_BANK_NOT_SWAPPED
  *         @arg @ref LL_FLASH_OB_BANK_SWAPPED
  */
__STATIC_INLINE void LL_FLASH_OB_SetSwapBanks(FLASH_TypeDef *flashx, uint32_t swap_bank)
{
  MODIFY_REG(flashx->OPTR, FLASH_OPTR_SWAP_BANK, swap_bank);
}

/**
  * @brief  Get the flash swap banks.
  * @rmtoll
  *  OPTR          SWAP_BANK        LL_FLASH_OB_GetSwapBanks
  * @param  FLASH instance.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_FLASH_OB_BANK_NOT_SWAPPED
  *         @arg @ref LL_FLASH_OB_BANK_SWAPPED
  */
__STATIC_INLINE uint32_t LL_FLASH_OB_GetSwapBanks(const FLASH_TypeDef *flashx)
{
  return (READ_BIT(flashx->OPTR, FLASH_OPTR_SWAP_BANK));
}

/**
  * @brief  Set the flash single or dual bank.
  * @rmtoll
  *  OPTR           DUALBANK           LL_FLASH_OB_SetBank
  * @param  FLASH instance.
  * @param  single_dual_bank
  *         This parameter can be one of the following values:
  *         @arg @ref LL_FLASH_OB_SINGLE_BANK
  *         @arg @ref LL_FLASH_OB_DUAL_BANK
  */
__STATIC_INLINE void LL_FLASH_OB_SetBank(FLASH_TypeDef *flashx, uint32_t single_dual_bank)
{
  MODIFY_REG(flashx->OPTR, FLASH_OPTR_DUALBANK, single_dual_bank);
}

/**
  * @brief  Get the flash single or dual bank.
  * @rmtoll
  *  OPTR           DUALBANK           LL_FLASH_OB_GetBank
  * @param  FLASH instance.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_FLASH_OB_SINGLE_BANK
  *         @arg @ref LL_FLASH_OB_DUAL_BANK
  */
__STATIC_INLINE uint32_t LL_FLASH_OB_GetBank(const FLASH_TypeDef *flashx)
{
  return (READ_BIT(flashx->OPTR, FLASH_OPTR_DUALBANK));
}

/**
  * @brief  Enable the flash backup ram ECC.
  * @rmtoll
  *  OPTR           BKPRAM_ECC           LL_FLASH_OB_EnableECCBKPRAM
  * @param  FLASH instance.
  */
__STATIC_INLINE void LL_FLASH_OB_EnableECCBKPRAM(FLASH_TypeDef *flashx)
{
  CLEAR_BIT(flashx->OPTR, FLASH_OPTR_BKPRAM_ECC);
}

/**
  * @brief  Disable the flash backup ram ECC.
  * @rmtoll
  *  OPTR           BKPRAM_ECC           LL_FLASH_OB_DisableECCBKPRAM
  * @param  FLASH instance.
  */
__STATIC_INLINE void LL_FLASH_OB_DisableECCBKPRAM(FLASH_TypeDef *flashx)
{
  SET_BIT(flashx->OPTR, FLASH_OPTR_BKPRAM_ECC);
}

/**
  * @brief  Check if flash backup rAM ECC is enabled or disabled.
  * @rmtoll
  *  OPTR           BKPRAM_ECC           LL_FLASH_OB_IsEnabledECCBKPRAM
  * @param  FLASH instance.
  * @retval State of flash option bytes ECCBKPRAM (1 enabled / 0 disabled).
  */
__STATIC_INLINE uint32_t LL_FLASH_OB_IsEnabledECCBKPRAM(const FLASH_TypeDef *flashx)
{
  return ((READ_BIT(flashx->OPTR, FLASH_OPTR_BKPRAM_ECC) == (FLASH_OPTR_BKPRAM_ECC)) ? 0UL : 1UL);
}

#if defined (SRAM3_BASE)
/**
  * @brief  Enable the flash sram3 ECC.
  * @rmtoll
  *  OPTR           SRAM3_ECC           LL_FLASH_OB_EnableECCSRAM3
  * @param  FLASH instance.
  */
__STATIC_INLINE void LL_FLASH_OB_EnableECCSRAM3(FLASH_TypeDef *flashx)
{
  CLEAR_BIT(flashx->OPTR, FLASH_OPTR_SRAM3_ECC);
}

/**
  * @brief  Disable the flash sram3 ECC.
  * @rmtoll
  *  OPTR           SRAM3_ECC           LL_FLASH_OB_DisableECCSRAM3
  * @param  FLASH instance.
  */
__STATIC_INLINE void LL_FLASH_OB_DisableECCSRAM3(FLASH_TypeDef *flashx)
{
  SET_BIT(flashx->OPTR, FLASH_OPTR_SRAM3_ECC);
}

/**
  * @brief  Check if the flash sram3 ECC is enabled or disabled.
  * @rmtoll
  *  OPTR           SRAM3_ECC           LL_FLASH_OB_IsEnabledECCSRAM3
  * @param  FLASH instance.
  * @retval State of flash option bytes ECCSRAM3 (1 enabled / 0 disabled).
  */
__STATIC_INLINE uint32_t LL_FLASH_OB_IsEnabledECCSRAM3(const FLASH_TypeDef *flashx)
{
  return ((READ_BIT(flashx->OPTR, FLASH_OPTR_SRAM3_ECC) == (FLASH_OPTR_SRAM3_ECC)) ? 0UL : 1UL);
}
#endif /* SRAM3_BASE */

/**
  * @brief  Enable the flash sram2 ECC.
  * @rmtoll
  *  OPTR           SRAM2_ECC           LL_FLASH_OB_EnableECCSRAM2
  * @param  FLASH instance.

  */
__STATIC_INLINE void LL_FLASH_OB_EnableECCSRAM2(FLASH_TypeDef *flashx)
{
  CLEAR_BIT(flashx->OPTR, FLASH_OPTR_SRAM2_ECC);
}

/**
  * @brief  Disable the flash sram2 ECC.
  * @rmtoll
  *  OPTR           SRAM2_ECC           LL_FLASH_OB_DisableECCSRAM2
  * @param  FLASH instance.
  */
__STATIC_INLINE void LL_FLASH_OB_DisableECCSRAM2(FLASH_TypeDef *flashx)
{
  SET_BIT(flashx->OPTR, FLASH_OPTR_SRAM2_ECC);
}

/**
  * @brief  Check if the flash sram2 ECC is enabled or disabled.
  * @rmtoll
  *  OPTR           SRAM2_ECC           LL_FLASH_OB_IsEnabledECCSRAM2
  * @param  FLASH instance.
  * @retval State of flash option bytes ECCSRAM2 (1 enabled / 0 disabled).
  */
__STATIC_INLINE uint32_t LL_FLASH_OB_IsEnabledECCSRAM2(const FLASH_TypeDef *flashx)
{
  return ((READ_BIT(flashx->OPTR, FLASH_OPTR_SRAM2_ECC) == (FLASH_OPTR_SRAM2_ECC)) ? 0UL : 1UL);
}

/**
  * @brief  Set the flash sram2 erase upon system reset.
  * @rmtoll
  *  OPTR           SRAM2_RST           LL_FLASH_OB_SetSystemRstSRAM2Erase
  * @param  FLASH instance.
  * @param  erase_sram2
  *         This parameter can be one of the following values:
  *         @arg @ref LL_FLASH_OB_ERASED_SRAM2_SYS_RST
  *         @arg @ref LL_FLASH_OB_NOT_ERASED_SRAM2_SYS_RST
  */
__STATIC_INLINE void LL_FLASH_OB_SetSystemRstSRAM2Erase(FLASH_TypeDef *flashx, uint32_t erase_sram2)
{
  MODIFY_REG(flashx->OPTR, FLASH_OPTR_SRAM2_RST, erase_sram2);
}

/**
  * @brief  Get the flash sram2 erase upon system reset.
  * @rmtoll
  *  OPTR           SRAM2_RST           LL_FLASH_OB_GetSystemRstSRAM2Erase
  * @param  FLASH instance.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_FLASH_OB_ERASED_SRAM2_SYS_RST
  *         @arg @ref LL_FLASH_OB_NOT_ERASED_SRAM2_SYS_RST
  */
__STATIC_INLINE uint32_t LL_FLASH_OB_GetSystemRstSRAM2Erase(const FLASH_TypeDef *flashx)
{
  return (READ_BIT(flashx->OPTR, FLASH_OPTR_SRAM2_RST));
}

/**
  * @brief  Set the flash software boot0.
  * @rmtoll
  *  OPTR           nSWBOOT0           LL_FLASH_OB_SetSWBoot0
  * @param  FLASH instance.
  * @param  sw_boot0
  *         This parameter can be one of the following values:
  *         @arg @ref LL_FLASH_OB_BOOT0_NBOOTBIT
  *         @arg @ref LL_FLASH_OB_BOOT0_BOOTPIN
  */
__STATIC_INLINE void LL_FLASH_OB_SetSWBoot0(FLASH_TypeDef *flashx, uint32_t sw_boot0)
{
  MODIFY_REG(flashx->OPTR, FLASH_OPTR_nSWBOOT0, sw_boot0);
}

/**
  * @brief  Get the flash software boot0.
  * @rmtoll
  *  OPTR           NBOOT0           LL_FLASH_OB_GetSWBoot0
  * @param  FLASH instance.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_FLASH_OB_BOOT0_NBOOTBIT
  *         @arg @ref LL_FLASH_OB_BOOT0_BOOTPIN
  */
__STATIC_INLINE uint32_t LL_FLASH_OB_GetSWBoot0(const FLASH_TypeDef *flashx)
{
  return (READ_BIT(flashx->OPTR, FLASH_OPTR_nSWBOOT0));
}

/**
  * @brief  Set the flash NBOOT0 option bit.
  * @rmtoll
  *  OPTR           NBOOT0           LL_FLASH_OB_SetNBoot0
  * @param  FLASH instance.
  * @param  nboot0
  *         This parameter can be one of the following values:
  *         @arg @ref LL_FLASH_OB_BOOT0_LOW
  *         @arg @ref LL_FLASH_OB_BOOT0_HIGH
  */
__STATIC_INLINE void LL_FLASH_OB_SetNBoot0(FLASH_TypeDef *flashx, uint32_t nboot0)
{
  MODIFY_REG(flashx->OPTR, FLASH_OPTR_nBOOT0, nboot0);
}

/**
  * @brief  Get the flash NBOOT0 option bit.
  * @rmtoll
  *  OPTR           NBOOT0           LL_FLASH_OB_GetNBoot0
  * @param  FLASH instance.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_FLASH_OB_BOOT0_LOW
  *         @arg @ref LL_FLASH_OB_BOOT0_HIGH
  */
__STATIC_INLINE uint32_t LL_FLASH_OB_GetNBoot0(const FLASH_TypeDef *flashx)
{
  return (READ_BIT(flashx->OPTR, FLASH_OPTR_nBOOT0));
}

/**
  * @brief  Set the flash NBOOT0 option bit.
  * @rmtoll
  *  OPTR           BOOT0            LL_FLASH_OB_SetBoot0
  * @param  FLASH instance.
  * @param  boot0
  *         This parameter can be one of the following values:
  *         @arg @ref LL_FLASH_OB_BOOT0_LOW
  *         @arg @ref LL_FLASH_OB_BOOT0_HIGH
  *         @arg @ref LL_FLASH_OB_BOOT0_BOOTPIN
  */
__STATIC_INLINE void LL_FLASH_OB_SetBoot0(FLASH_TypeDef *flashx, uint32_t boot0)
{
  MODIFY_REG(flashx->OPTR, (FLASH_OPTR_nBOOT0 | FLASH_OPTR_nSWBOOT0), boot0);
}

/**
  * @brief  Get the flash NBOOT0 option bit.
  * @rmtoll
  *  OPTR           BOOT0            LL_FLASH_OB_GetBoot0
  * @param  FLASH instance.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_FLASH_OB_BOOT0_LOW
  *         @arg @ref LL_FLASH_OB_BOOT0_HIGH
  *         @arg @ref LL_FLASH_OB_BOOT0_BOOTPIN
  */
__STATIC_INLINE uint32_t LL_FLASH_OB_GetBoot0(const FLASH_TypeDef *flashx)
{
  return (READ_BIT(flashx->OPTR, (FLASH_OPTR_nBOOT0 | FLASH_OPTR_nSWBOOT0)));
}

/**
  * @brief  Enable the flash PA15 pull-up.
  * @rmtoll
  *  OPTR           PA15_PUPEN           LL_FLASH_OB_EnablePA15PullUp
  * @param  FLASH instance.
  */
__STATIC_INLINE void LL_FLASH_OB_EnablePA15PullUp(FLASH_TypeDef *flashx)
{
  SET_BIT(flashx->OPTR, FLASH_OPTR_PA15_PUPEN);
}

/**
  * @brief  Disable the flash PA15 pull-up.
  * @rmtoll
  *  OPTR          PA15_PUPEN        LL_FLASH_OB_DisablePA15PullUp
  * @param  FLASH instance.
  */
__STATIC_INLINE void LL_FLASH_OB_DisablePA15PullUp(FLASH_TypeDef *flashx)
{
  CLEAR_BIT(flashx->OPTR, FLASH_OPTR_PA15_PUPEN);
}

/**
  * @brief  Check if the flash PA15 pull-up is enabled or disabled.
  * @rmtoll
  *  OPTR          PA15_PUPEN        LL_FLASH_OB_IsEnabledPA15PullUp
  * @param  FLASH instance.
  * @retval State of flash option bytes PA15 pull-up (1 enabled / 0 disabled).
  */
__STATIC_INLINE uint32_t LL_FLASH_OB_IsEnabledPA15PullUp(const FLASH_TypeDef *flashx)
{
  return ((READ_BIT(flashx->OPTR, FLASH_OPTR_PA15_PUPEN) == ((FLASH_OPTR_PA15_PUPEN))) ? 1UL : 0UL);
}

/**
  * @brief  Enable the flash high speed IO at low VDD voltage.
  * @rmtoll
  *  OPTR          IO_VDD_HSLV          LL_FLASH_OB_EnableVddIOHSLV
  * @param  FLASH instance.
  */
__STATIC_INLINE void LL_FLASH_OB_EnableVddIOHSLV(FLASH_TypeDef *flashx)
{
  SET_BIT(flashx->OPTR, FLASH_OPTR_IO_VDD_HSLV);
}

/**
  * @brief  Disable the flash high speed IO at low VDD voltage.
  * @rmtoll
  *  OPTR          IO_VDD_HSLV          LL_FLASH_OB_DisableVddIOHSLV
  * @param  FLASH instance.
  */
__STATIC_INLINE void LL_FLASH_OB_DisableVddIOHSLV(FLASH_TypeDef *flashx)
{
  CLEAR_BIT(flashx->OPTR, FLASH_OPTR_IO_VDD_HSLV);
}

/**
  * @brief  Check if the flash high speed IO at low VDD voltage is enabled or disabled.
  * @rmtoll
  *  OPTR          IO_VDD_HSLV          LL_FLASH_OB_IsEnabledVddIOHSLV
  * @param  FLASH instance.
  * @retval State of flash option bytes high speed IO at low VDD voltage (1 enabled / 0 disabled).
  */
__STATIC_INLINE uint32_t LL_FLASH_OB_IsEnabledVddIOHSLV(const FLASH_TypeDef *flashx)
{
  return ((READ_BIT(flashx->OPTR, FLASH_OPTR_IO_VDD_HSLV) == ((FLASH_OPTR_IO_VDD_HSLV))) ? 1UL : 0UL);
}

/**
  * @brief  Enable the flash high speed IO at low VDDIO2 voltage.
  * @rmtoll
  *  OPTR          IO_VDDIO2_HSLV          LL_FLASH_OB_EnableVddIO2HSLV
  * @param  FLASH instance.
  */
__STATIC_INLINE void LL_FLASH_OB_EnableVddIO2HSLV(FLASH_TypeDef *flashx)
{
  SET_BIT(flashx->OPTR, FLASH_OPTR_IO_VDDIO2_HSLV);
}

/**
  * @brief  Disable the flash high speed IO at low VDDIO2 voltage.
  * @rmtoll
  *  OPTR          IO_VDDIO2_HSLV          LL_FLASH_OB_DisableVddIO2HSLV
  * @param  FLASH instance.
  */
__STATIC_INLINE void LL_FLASH_OB_DisableVddIO2HSLV(FLASH_TypeDef *flashx)
{
  CLEAR_BIT(flashx->OPTR, FLASH_OPTR_IO_VDDIO2_HSLV);
}

/**
  * @brief  Check if the flash high speed IO at low VDDIO2 voltage is enabled or disabled.
  * @rmtoll
  *  OPTR          IO_VDDIO2_HSLV          LL_FLASH_OB_IsEnabledVddIO2HSLV
  * @param  FLASH instance.
  * @retval State of flash option bytes high speed IO at low VDDIO2 voltage (1 enabled / 0 disabled).
  */
__STATIC_INLINE uint32_t LL_FLASH_OB_IsEnabledVddIO2HSLV(const FLASH_TypeDef *flashx)
{
  return ((READ_BIT(flashx->OPTR, FLASH_OPTR_IO_VDDIO2_HSLV) == ((FLASH_OPTR_IO_VDDIO2_HSLV))) ? 1UL : 0UL);
}

/**
  * @brief  Enable the flash global TrustZone security.
  * @rmtoll
  *  OPTR          TZEN          LL_FLASH_OB_EnableTrustZone
  * @param  FLASH instance.
  */
__STATIC_INLINE void LL_FLASH_OB_EnableTrustZone(FLASH_TypeDef *flashx)
{
  SET_BIT(flashx->OPTR, FLASH_OPTR_TZEN);
}

/**
  * @brief  Disable the flash global TrustZone security.
  * @rmtoll
  *  OPTR          TZEN          LL_FLASH_OB_DisableTrustZone
  * @param  FLASH instance.
  */
__STATIC_INLINE void LL_FLASH_OB_DisableTrustZone(FLASH_TypeDef *flashx)
{
  CLEAR_BIT(flashx->OPTR, FLASH_OPTR_TZEN);
}

/**
  * @brief  Check if the flash global TrustZone security is enabled or disabled.
  * @rmtoll
  *  OPTR          TZEN          LL_FLASH_OB_IsEnabledTrustZone
  * @param  FLASH instance.
  * @retval State of flash option bytes trustzone (1 enabled / 0 disabled).
  */
__STATIC_INLINE uint32_t LL_FLASH_OB_IsEnabledTrustZone(const FLASH_TypeDef *flashx)
{
  return ((READ_BIT(flashx->OPTR, FLASH_OPTR_TZEN) == ((FLASH_OPTR_TZEN))) ? 1UL : 0UL);
}

/**
  * @brief  Set the flash non-secure boot base address 0.
  * @rmtoll
  *  NSBOOTADD0R          NSBOOTADD0          LL_FLASH_OB_SetNSecBootAddr0
  * @param  FLASH instance.
  * @param  boot_addr
  *         This parameter can be a value between 0x00000000U and 0xFFFFFFFFU.
  */
__STATIC_INLINE void LL_FLASH_OB_SetNSecBootAddr0(FLASH_TypeDef *flashx, uint32_t boot_addr)
{
  MODIFY_REG(flashx->NSBOOTADD0R, FLASH_NSBOOTADD0R_NSBOOTADD0, boot_addr);
}

/**
  * @brief  Set the flash non-secure boot base address 0.
  * @rmtoll
  *  NSBOOTADD0R          NSBOOTADD0          LL_FLASH_OB_GetNSecBootAddr0
  * @param  FLASH instance.
  * @retval Returned value can be a value between 0x00000000U and 0xFFFFFFFFU.
  */
__STATIC_INLINE uint32_t LL_FLASH_OB_GetNSecBootAddr0(const FLASH_TypeDef *flashx)
{
  return (READ_BIT(flashx->NSBOOTADD0R, FLASH_NSBOOTADD0R_NSBOOTADD0));
}

/**
  * @brief  Set the flash non-secure boot base address 1.
  * @rmtoll
  *  NSBOOTADD1R          NSBOOTADD1          LL_FLASH_OB_SetNSecBootAddr1
  * @param  FLASH instance.
  * @param  boot_addr
  *         This parameter can be a value between 0x00000000U and 0xFFFFFFFFU.
  */
__STATIC_INLINE void LL_FLASH_OB_SetNSecBootAddr1(FLASH_TypeDef *flashx, uint32_t boot_addr)
{
  MODIFY_REG(flashx->NSBOOTADD1R, FLASH_NSBOOTADD1R_NSBOOTADD1, boot_addr);
}

/**
  * @brief  Set the flash non-secure boot base address 1.
  * @rmtoll
  *  NSBOOTADD1R          NSBOOTADD1          LL_FLASH_OB_GetNSecBootAddr1
  * @param  FLASH instance.
  * @retval Returned value can be a value between 0x00000000U and 0xFFFFFFFFU.
  */
__STATIC_INLINE uint32_t LL_FLASH_OB_GetNSecBootAddr1(const FLASH_TypeDef *flashx)
{
  return (READ_BIT(flashx->NSBOOTADD1R, FLASH_NSBOOTADD1R_NSBOOTADD1));
}

/**
  * @brief  Set the flash non-secure boot base address.
  * @rmtoll NSBOOTADD0R/NSBOOTADD1R          NSBOOTADD0/NSBOOTADD1          LL_FLASH_OB_SetNSecBootAddr
  * @param  FLASH instance.
  * @param  addr_idx
  *         This parameter can be one of the following values:
  *         @arg @ref LL_FLASH_OB_ADDR_0
  *         @arg @ref LL_FLASH_OB_ADDR_1
  * @param  boot_addr
  *         This parameter can be a value between 0x00000000U and 0xFFFFFFFFU.
  */
__STATIC_INLINE void LL_FLASH_OB_SetNSecBootAddr(FLASH_TypeDef *flashx, uint32_t addr_idx, uint32_t boot_addr)
{
  __IO uint32_t *reg_addr = &flashx->NSBOOTADD0R + addr_idx;
  MODIFY_REG(*reg_addr, FLASH_NSBOOTADD0R_NSBOOTADD0, boot_addr);
}

/**
  * @brief  Set the flash non-secure boot base address.
  * @rmtoll NSBOOTADD0R/NSBOOTADD1R          NSBOOTADD0/NSBOOTADD1          LL_FLASH_OB_GetNSecBootAddr
  * @param  FLASH instance.
  * @param  addr_idx
  *         This parameter can be one of the following values:
  *         @arg @ref LL_FLASH_OB_ADDR_0
  *         @arg @ref LL_FLASH_OB_ADDR_1
  * @retval Returned value can be a value between 0x00000000U and 0xFFFFFFFFU.
  */
__STATIC_INLINE uint32_t LL_FLASH_OB_GetNSecBootAddr(const FLASH_TypeDef *flashx, uint32_t addr_idx)
{
  const __IO uint32_t *reg_addr = &flashx->NSBOOTADD0R + addr_idx;
  return (READ_BIT(*reg_addr, FLASH_NSBOOTADD0R_NSBOOTADD0));
}

#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
/**
  * @brief  Lock the flash secure boot address 0.
  * @rmtoll
  *  SECBOOTADD0R          BOOT_LOCK          LL_FLASH_OB_LockBootConfiguration
  * @param  FLASH instance.
  */
__STATIC_INLINE void LL_FLASH_OB_LockBootConfiguration(FLASH_TypeDef *flashx)
{
  SET_BIT(flashx->SECBOOTADD0R, FLASH_SECBOOTADD0R_BOOT_LOCK);
}

/**
  * @brief  Unlock the flash secure boot address 0.
  * @rmtoll
  *  SECBOOTADD0R          BOOT_LOCK          LL_FLASH_OB_UnlockBootConfiguration
  * @param  FLASH instance.
  */
__STATIC_INLINE void LL_FLASH_OB_UnlockBootConfiguration(FLASH_TypeDef *flashx)
{
  CLEAR_BIT(flashx->SECBOOTADD0R, FLASH_SECBOOTADD0R_BOOT_LOCK);
}

/**
  * @brief  Check the flash secure boot address 0 lock state.
  * @rmtoll
  *  SECBOOTADD0R          BOOT_LOCK          LL_FLASH_OB_IsLockedBootConfiguration
  * @param  FLASH instance.
  * @retval State of flash option bytes secure boot lock (1 locked / 0 unlocked).
  */
__STATIC_INLINE uint32_t LL_FLASH_OB_IsLockedBootConfiguration(const FLASH_TypeDef *flashx)
{
  return ((READ_BIT(flashx->SECBOOTADD0R, FLASH_SECBOOTADD0R_BOOT_LOCK) == ((FLASH_SECBOOTADD0R_BOOT_LOCK))) ?
          1UL : 0UL);
}

/**
  * @brief  Set the flash secure boot base address 0.
  * @rmtoll
  *  SECBOOTADD0R          SECBOOTADD0          LL_FLASH_OB_SetSecBootAddr0
  * @param  FLASH instance.
  * @param  boot_addr
  *         This parameter can be a value between 0x00000000U and 0xFFFFFFFFU.
  */
__STATIC_INLINE void LL_FLASH_OB_SetSecBootAddr0(FLASH_TypeDef *flashx, uint32_t boot_addr)
{
  MODIFY_REG(flashx->SECBOOTADD0R, FLASH_SECBOOTADD0R_SECBOOTADD0, boot_addr);
}

/**
  * @brief  Get the flash secure boot base address 0.
  * @rmtoll
  *  SECBOOTADD0R          SECBOOTADD0          LL_FLASH_OB_GetSecBootAddr0
  * @param  FLASH instance.
  * @retval Returned value can be a value between 0x00000000U and 0xFFFFFFFFU.
  */
__STATIC_INLINE uint32_t LL_FLASH_OB_GetSecBootAddr0(const FLASH_TypeDef *flashx)
{
  return (READ_BIT(flashx->SECBOOTADD0R, FLASH_SECBOOTADD0R_SECBOOTADD0));
}

/**
  * @brief  Set the flash start page of the secure watermark area by bank.
  * @rmtoll SECWM1R1/SECWM2R1          SECWM1_PSTRT/SECWM2_PSTRT          LL_FLASH_OB_BANK_SetWMAreaStartPage
  * @param  FLASH instance.
  * @param  bank
  *         This parameter can be one of the following values:
  *         @arg @ref LL_FLASH_BANK_1
  *         @arg @ref LL_FLASH_BANK_2
  * @param  start_page
  *         This parameter can be a value between 0x00U and the maximum number of pages per bank.
  */
__STATIC_INLINE void LL_FLASH_OB_BANK_SetWMAreaStartPage(FLASH_TypeDef *flashx, uint32_t bank, uint32_t start_page)
{
  __IO uint32_t *reg_addr = &flashx->SECWM1R1 + bank;
  MODIFY_REG(*reg_addr, FLASH_SECWM1R1_SECWM1_PSTRT, start_page);
}

/**
  * @brief  Get the flash start page of the secure watermark area by bank.
  * @rmtoll SECWM1R1/SECWM2R1          SECWM1_PSTRT/SECWM2_PSTRT          LL_FLASH_OB_BANK_GetWMAreaStartPage
  * @param  FLASH instance.
  * @param  bank
  *         This parameter can be one of the following values:
  *         @arg @ref LL_FLASH_BANK_1
  *         @arg @ref LL_FLASH_BANK_2
  * @retval Returned value can be a value between 0x00U and the maximum number of pages per bank.
  */
__STATIC_INLINE uint32_t LL_FLASH_OB_BANK_GetWMAreaStartPage(const FLASH_TypeDef *flashx, uint32_t bank)
{
  const __IO uint32_t *reg_addr = &flashx->SECWM1R1 + bank;
  return (READ_BIT(*reg_addr, FLASH_SECWM1R1_SECWM1_PSTRT));
}

/**
  * @brief  Set the flash end page of the secure watermark area by bank.
  * @rmtoll SECWM1R1/SECWM2R1          SECWM1_PEND/SECWM2_PEND          LL_FLASH_OB_BANK_SetWMAreaEndPage
  * @param  FLASH instance.
  * @param  bank
  *         This parameter can be one of the following values:
  *         @arg @ref LL_FLASH_BANK_1
  *         @arg @ref LL_FLASH_BANK_2
  * @param  end_page
  *         This parameter can be a value between 0x00U and the maximum number of pages per bank.
  */
__STATIC_INLINE void LL_FLASH_OB_BANK_SetWMAreaEndPage(FLASH_TypeDef *flashx, uint32_t bank, uint32_t end_page)
{
  __IO uint32_t *reg_addr = &flashx->SECWM1R1 + bank;
  MODIFY_REG(*reg_addr, FLASH_SECWM1R1_SECWM1_PEND, (end_page << FLASH_SECWM1R1_SECWM1_PEND_Pos));
}

/**
  * @brief  Get the flash end page of the secure watermark area by bank.
  * @rmtoll SECWM1R1          SECWM1_PEND/SECWM2_PEND          LL_FLASH_OB_BANK_GetWMAreaEndPage
  * @param  FLASH instance.
  * @param  bank
  *         This parameter can be one of the following values:
  *         @arg @ref LL_FLASH_BANK_1
  *         @arg @ref LL_FLASH_BANK_2
  * @retval Returned value can be a value between 0x00U and the maximum number of pages per bank.
  */
__STATIC_INLINE uint32_t LL_FLASH_OB_BANK_GetWMAreaEndPage(const FLASH_TypeDef *flashx, uint32_t bank)
{
  const __IO uint32_t *reg_addr = &flashx->SECWM1R1 + bank;
  return (READ_BIT(*reg_addr, FLASH_SECWM1R1_SECWM1_PEND));
}

