STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/ll/stm32u5xx_ll_flash.h
/**
  * @brief  Configuration the flash secure watermark area by bank.
  * @rmtoll SECWM1R1/SECWM2R1   SECWM1_PSTRT/SECWM2_PSTRT/SECWM1_PEND/SECWM2_PEND   LL_FLASH_OB_BANK_ConfigSecureWMArea
  * @param  FLASH instance.
  * @param  bank
  *         This parameter can be one of the following values:
  *         @arg @ref LL_FLASH_BANK_1
  *         @arg @ref LL_FLASH_BANK_2
  * @param  start_page
  *         This parameter can be a value between 0x00U and the maximum number of pages per bank.
  * @param  end_page
  *         This parameter can be a value between 0x00U and the maximum number of pages per bank.
  */
__STATIC_INLINE void LL_FLASH_OB_BANK_ConfigSecureWMArea(FLASH_TypeDef *flashx,
                                                         uint32_t bank,
                                                         uint32_t start_page,
                                                         uint32_t end_page)
{
  __IO uint32_t *reg_addr = &flashx->SECWM1R1 + bank;
  MODIFY_REG(*reg_addr, (FLASH_SECWM1R1_SECWM1_PSTRT | FLASH_SECWM1R1_SECWM1_PEND),
             (start_page | (end_page << FLASH_SECWM1R1_SECWM1_PEND_Pos)));
}

/**
  * @brief  Set the flash end page of the hide protection area by bank.
  * @rmtoll SECWM1R2/SECWM2R2          HDP1_PEND/HDP2_PEND          LL_FLASH_OB_BANK_SetHDPAreaEndPage
  * @param  FLASH instance.
  * @param  bank
  *         This parameter can be one of the following values:
  *         @arg @ref LL_FLASH_BANK_1
  *         @arg @ref LL_FLASH_BANK_2
  * @param  end_page
  *         This parameter can be a value between 0x00U and the maximum number of pages per bank.
  */
__STATIC_INLINE void LL_FLASH_OB_BANK_SetHDPAreaEndPage(FLASH_TypeDef *flashx, uint32_t bank, uint32_t end_page)
{
  __IO uint32_t *reg_addr = &flashx->SECWM1R2 + bank;
  MODIFY_REG(*reg_addr, FLASH_SECWM1R2_HDP1_PEND, (end_page << FLASH_SECWM1R2_HDP1_PEND_Pos));
}

/**
  * @brief  Get the flash end page of the hide protection area by bank.
  * @rmtoll SECWM1R2/SECWM2R2          HDP1_PEND/HDP2_PEND          LL_FLASH_OB_BANK_GetHDPAreaEndPage
  * @param  FLASH instance.
  * @param  bank
  *         This parameter can be one of the following values:
  *         @arg @ref LL_FLASH_BANK_1
  *         @arg @ref LL_FLASH_BANK_2
  * @retval Returned value can be a value between 0x00U and the maximum number of pages per bank.
  */
__STATIC_INLINE uint32_t LL_FLASH_OB_BANK_GetHDPAreaEndPage(const FLASH_TypeDef *flashx, uint32_t bank)
{
  const __IO uint32_t *reg_addr = &flashx->SECWM1R2 + bank;
  return (READ_BIT(*reg_addr, FLASH_SECWM1R2_HDP1_PEND));
}

/**
  * @brief  Enable the flash hide protection area by bank.
  * @rmtoll SECWM1R2/SECWM2R2          HDP1EN/HDP2EN          LL_FLASH_OB_BANK_EnableHDPArea
  * @param  FLASH instance.
  * @param  bank
  *         This parameter can be one of the following values:
  *         @arg @ref LL_FLASH_BANK_1
  *         @arg @ref LL_FLASH_BANK_2
  */
__STATIC_INLINE void LL_FLASH_OB_BANK_EnableHDPArea(FLASH_TypeDef *flashx, uint32_t bank)
{
  __IO uint32_t *reg_addr = &flashx->SECWM1R2 + bank;
  SET_BIT(*reg_addr, FLASH_SECWM1R2_HDP1EN);
}

/**
  * @brief  Disable the flash hide protection area by bank.
  * @rmtoll SECWM1R2/SECWM2R2          HDP1EN/HDP2EN          LL_FLASH_OB_BANK_DisableHDPArea
  * @param  FLASH instance.
  * @param  bank
  *         This parameter can be one of the following values:
  *         @arg @ref LL_FLASH_BANK_1
  *         @arg @ref LL_FLASH_BANK_2
  */
__STATIC_INLINE void LL_FLASH_OB_BANK_DisableHDPArea(FLASH_TypeDef *flashx, uint32_t bank)
{
  __IO uint32_t *reg_addr = &flashx->SECWM1R2 + bank;
  CLEAR_BIT(*reg_addr, FLASH_SECWM1R2_HDP1EN);
}

/**
  * @brief  Check if the flash hide protection area is enabled or disabled by bank.
  * @rmtoll SECWM1R2/SECWM2R2          HDP1EN/HDP2EN          LL_FLASH_OB_BANK_IsEnabledHDPArea
  * @param  FLASH instance.
  * @param  bank
  *         This parameter can be one of the following values:
  *         @arg @ref LL_FLASH_BANK_1
  *         @arg @ref LL_FLASH_BANK_2
  * @retval State of flash option bytes hide protection area (1 enabled / 0 disabled).
  */
__STATIC_INLINE uint32_t LL_FLASH_OB_BANK_IsEnabledHDPArea(const FLASH_TypeDef *flashx, uint32_t bank)
{
  const __IO uint32_t *reg_addr = &flashx->SECWM1R2 + bank;
  return ((READ_BIT(*reg_addr, FLASH_SECWM1R2_HDP1EN) == (FLASH_SECWM1R2_HDP1EN)) ? 1UL : 0UL);
}
#endif /* __ARM_FEATURE_CMSE */

/**
  * @brief  Set the flash start page of the write protection area A by bank.
  * @rmtoll WRP1AR/WRP2AR          WRP1A_PSTRT/WRP2A_PSTRT          LL_FLASH_OB_BANK_SetAreaAWRPStartPage
  * @param  FLASH instance.
  * @param  bank
  *         This parameter can be one of the following values:
  *         @arg @ref LL_FLASH_BANK_1
  *         @arg @ref LL_FLASH_BANK_2
  * @param  start_page
  *         This parameter can be a value between 0x00U and the maximum number of pages per bank.
  */
__STATIC_INLINE void LL_FLASH_OB_BANK_SetAreaAWRPStartPage(FLASH_TypeDef *flashx, uint32_t bank, uint32_t start_page)
{
  __IO uint32_t *reg_addr = &flashx->WRP1AR + bank;
  MODIFY_REG(*reg_addr, FLASH_WRP1AR_WRP1A_PSTRT, start_page);
}

/**
  * @brief  Get the flash start page of the write protection area A by bank.
  * @rmtoll WRP1AR/WRP2AR          WRP1A_PSTRT/WRP2A_PSTRT          LL_FLASH_OB_BANK_GetAreaAWRPStartPage
  * @param  FLASH instance.
  * @param  bank
  *         This parameter can be one of the following values:
  *         @arg @ref LL_FLASH_BANK_1
  *         @arg @ref LL_FLASH_BANK_2
  * @retval Returned value can be a value between 0x00U and the maximum number of pages per bank.
  */
__STATIC_INLINE uint32_t LL_FLASH_OB_BANK_GetAreaAWRPStartPage(const FLASH_TypeDef *flashx, uint32_t bank)
{
  const __IO uint32_t *reg_addr = &flashx->WRP1AR + bank;
  return (READ_BIT(*reg_addr, FLASH_WRP1AR_WRP1A_PSTRT));
}

/**
  * @brief  Set the flash end page of the write protection area A by bank.
  * @rmtoll WRP1AR/WRP2AR          WRP1A_PEND/WRP2A_PEND          LL_FLASH_OB_BANK_SetAreaAWRPEndPage
  * @param  FLASH instance.
  * @param  bank
  *         This parameter can be one of the following values:
  *         @arg @ref LL_FLASH_BANK_1
  *         @arg @ref LL_FLASH_BANK_2
  * @param  end_page
  *         This parameter can be a value between 0x00U and the maximum number of pages per bank.
  */
__STATIC_INLINE void LL_FLASH_OB_BANK_SetAreaAWRPEndPage(FLASH_TypeDef *flashx, uint32_t bank, uint32_t end_page)
{
  __IO uint32_t *reg_addr = &flashx->WRP1AR + bank;
  MODIFY_REG(*reg_addr, FLASH_WRP1AR_WRP1A_PEND, (end_page << FLASH_WRP1AR_WRP1A_PEND_Pos));
}

/**
  * @brief  Get the flash end page of the write protection area A by bank.
  * @rmtoll WRP1AR/WRP2AR          WRP1A_PEND/WRP2A_PEND          LL_FLASH_OB_BANK_GetAreaAWRPEndPage
  * @param  FLASH instance.
  * @param  bank
  *         This parameter can be one of the following values:
  *         @arg @ref LL_FLASH_BANK_1
  *         @arg @ref LL_FLASH_BANK_2
  * @retval Returned value can be a value between 0x00U and the maximum number of pages per bank.
  */
__STATIC_INLINE uint32_t LL_FLASH_OB_BANK_GetAreaAWRPEndPage(const FLASH_TypeDef *flashx, uint32_t bank)
{
  const __IO uint32_t *reg_addr = &flashx->WRP1AR + bank;
  return (READ_BIT(*reg_addr, FLASH_WRP1AR_WRP1A_PEND));
}

/**
  * @brief  Lock the flash write protection area A by bank.
  * @rmtoll WRP1AR/WRP2AR          UNLOCK          LL_FLASH_OB_BANK_LockAreaAWRP
  * @param  FLASH instance.
  * @param  bank
  *         This parameter can be one of the following values:
  *         @arg @ref LL_FLASH_BANK_1
  *         @arg @ref LL_FLASH_BANK_2
  */
__STATIC_INLINE void LL_FLASH_OB_BANK_LockAreaAWRP(FLASH_TypeDef *flashx, uint32_t bank)
{
  __IO uint32_t *reg_addr = &flashx->WRP1AR + bank;
  CLEAR_BIT(*reg_addr, FLASH_WRP1AR_UNLOCK);
}

/**
  * @brief  Unlock the flash write protection area A by bank.
  * @rmtoll WRP1AR/WRP2AR          UNLOCK          LL_FLASH_OB_BANK_UnlockAreaAWRP
  * @param  FLASH instance.
  * @param  bank
  *         This parameter can be one of the following values:
  *         @arg @ref LL_FLASH_BANK_1
  *         @arg @ref LL_FLASH_BANK_2
  */
__STATIC_INLINE void LL_FLASH_OB_BANK_UnlockAreaAWRP(FLASH_TypeDef *flashx, uint32_t bank)
{
  __IO uint32_t *reg_addr = &flashx->WRP1AR + bank;
  SET_BIT(*reg_addr, FLASH_WRP1AR_UNLOCK);
}

/**
  * @brief  Check the flash write protection area A lock state by bank.
  * @rmtoll WRP1AR/WRP2AR          UNLOCK          LL_FLASH_OB_BANK_IsLockedAreaAWRP
  * @param  FLASH instance.
  * @param  bank
  *         This parameter can be one of the following values:
  *         @arg @ref LL_FLASH_BANK_1
  *         @arg @ref LL_FLASH_BANK_2
  * @retval State of flash option bytes write protection area A configuration lock (1 locked / 0 unlocked).
  */
__STATIC_INLINE uint32_t LL_FLASH_OB_BANK_IsLockedAreaAWRP(const FLASH_TypeDef *flashx, uint32_t bank)
{
  const __IO uint32_t *reg_addr = &flashx->WRP1AR + bank;
  return ((READ_BIT(*reg_addr, FLASH_WRP1AR_UNLOCK) == ((FLASH_WRP1AR_UNLOCK))) ? 0UL : 1UL);
}

/**
  * @brief  Set the flash start page of the write protection area B by bank.
  * @rmtoll WRP1BR/WRP2BR          WRP1B_PSTRT/WRP2B_PSTRT          LL_FLASH_OB_BANK_SetAreaBWRPStartPage
  * @param  FLASH instance.
  * @param  bank
  *         This parameter can be one of the following values:
  *         @arg @ref LL_FLASH_BANK_1
  *         @arg @ref LL_FLASH_BANK_2
  * @param  start_page
  *         This parameter can be a value between 0x00U and the maximum number of pages per bank.
  */
__STATIC_INLINE void LL_FLASH_OB_BANK_SetAreaBWRPStartPage(FLASH_TypeDef *flashx, uint32_t bank, uint32_t start_page)
{
  __IO uint32_t *reg_addr = &flashx->WRP1BR + bank;
  MODIFY_REG(*reg_addr, FLASH_WRP1BR_WRP1B_PSTRT, start_page);
}

/**
  * @brief  Get the flash start page of the write protection area B by bank.
  * @rmtoll WRP1BR/WRP2BR          WRP1B_PSTRT/WRP2B_PSTRT          LL_FLASH_OB_BANK_GetAreaBWRPStartPage
  * @param  FLASH instance.
  * @param  bank
  *         This parameter can be one of the following values:
  *         @arg @ref LL_FLASH_BANK_1
  *         @arg @ref LL_FLASH_BANK_2
  * @retval Returned value can be a value between 0x00U and the maximum number of pages per bank.
  */
__STATIC_INLINE uint32_t LL_FLASH_OB_BANK_GetAreaBWRPStartPage(const FLASH_TypeDef *flashx, uint32_t bank)
{
  const __IO uint32_t *reg_addr = &flashx->WRP1BR + bank;
  return (READ_BIT(*reg_addr, FLASH_WRP1BR_WRP1B_PSTRT));
}

/**
  * @brief  Set the flash end page of the write protection area B by bank.
  * @rmtoll WRP1BR/WRP2BR          WRP1B_PEND/WRP2B_PEND          LL_FLASH_OB_BANK_SetAreaBWRPEndPage
  * @param  FLASH instance.
  * @param  bank
  *         This parameter can be one of the following values:
  *         @arg @ref LL_FLASH_BANK_1
  *         @arg @ref LL_FLASH_BANK_2
  * @param  end_page
  *         This parameter can be a value between 0x00U and the maximum number of pages per bank.
  */
__STATIC_INLINE void LL_FLASH_OB_BANK_SetAreaBWRPEndPage(FLASH_TypeDef *flashx, uint32_t bank, uint32_t end_page)
{
  __IO uint32_t *reg_addr = &flashx->WRP1BR + bank;
  MODIFY_REG(*reg_addr, FLASH_WRP1BR_WRP1B_PEND, (end_page << FLASH_WRP1BR_WRP1B_PEND_Pos));
}

/**
  * @brief  Get the flash end page of the write protection area B by bank.
  * @rmtoll WRP1BR/WRP2BR          WRP1B_PEND/WRP2B_PEND          LL_FLASH_OB_BANK_GetAreaBWRPEndPage
  * @param  FLASH instance.
  * @param  bank
  *         This parameter can be one of the following values:
  *         @arg @ref LL_FLASH_BANK_1
  *         @arg @ref LL_FLASH_BANK_2
  * @retval Returned value can be a value between 0x00U and the maximum number of pages per bank.
  */
__STATIC_INLINE uint32_t LL_FLASH_OB_BANK_GetAreaBWRPEndPage(const FLASH_TypeDef *flashx, uint32_t bank)
{
  const __IO uint32_t *reg_addr = &flashx->WRP1BR + bank;
  return (READ_BIT(*reg_addr, FLASH_WRP1BR_WRP1B_PEND));
}

/**
  * @brief  Lock the flash write protection area B by bank.
  * @rmtoll WRP1BR/WRP2BR          UNLOCK          LL_FLASH_OB_BANK_LockAreaBWRP
  * @param  FLASH instance.
  * @param  bank
  *         This parameter can be one of the following values:
  *         @arg @ref LL_FLASH_BANK_1
  *         @arg @ref LL_FLASH_BANK_2
  */
__STATIC_INLINE void LL_FLASH_OB_BANK_LockAreaBWRP(FLASH_TypeDef *flashx, uint32_t bank)
{
  __IO uint32_t *reg_addr = &flashx->WRP1BR + bank;
  CLEAR_BIT(*reg_addr, FLASH_WRP1BR_UNLOCK);
}

/**
  * @brief  Unlock the flash write protection area B by bank.
  * @rmtoll WRP1BR/WRP2BR          UNLOCK          LL_FLASH_OB_BANK_UnlockAreaBWRP
  * @param  FLASH instance.
  * @param  bank
  *         This parameter can be one of the following values:
  *         @arg @ref LL_FLASH_BANK_1
  *         @arg @ref LL_FLASH_BANK_2
  */
__STATIC_INLINE void LL_FLASH_OB_BANK_UnlockAreaBWRP(FLASH_TypeDef *flashx, uint32_t bank)
{
  __IO uint32_t *reg_addr = &flashx->WRP1BR + bank;
  SET_BIT(*reg_addr, FLASH_WRP1BR_UNLOCK);
}

/**
  * @brief  Check the flash write protection area B lock state by bank.
  * @rmtoll WRP1BR/WRP2BR          UNLOCK          LL_FLASH_OB_BANK_IsLockedAreaBWRP
  * @param  FLASH instance.
  * @param  bank
  *         This parameter can be one of the following values:
  *         @arg @ref LL_FLASH_BANK_1
  *         @arg @ref LL_FLASH_BANK_2
  * @retval State of flash option bytes write protection area B configuration lock (1 locked / 0 unlocked).
  */
__STATIC_INLINE uint32_t LL_FLASH_OB_BANK_IsLockedAreaBWRP(const FLASH_TypeDef *flashx, uint32_t bank)
{
  const __IO uint32_t *reg_addr = &flashx->WRP1BR + bank;
  return ((READ_BIT(*reg_addr, FLASH_WRP1BR_UNLOCK) == ((FLASH_WRP1BR_UNLOCK))) ? 0UL : 1UL);
}

/**
  * @brief  Configuration the flash write protection area by bank.
  * @rmtoll
  *  WRP1AR          WRP1A_PSTRT/WRP1A_PEND         LL_FLASH_OB_BANK_ConfigAreaWRP \n
  *  WRP2AR          WRP2A_PSTRT/WRP2A_PEND         LL_FLASH_OB_BANK_ConfigAreaWRP \n
  *  WRP1BR          WRP1B_PSTRT/WRP1B_PEND         LL_FLASH_OB_BANK_ConfigAreaWRP \n
  *  WRP2BR          WRP2B_PSTRT/WRP2B_PEND         LL_FLASH_OB_BANK_ConfigAreaWRP
  * @param  FLASH instance.
  * @param  bank
  *         This parameter can be one of the following values:
  *         @arg @ref LL_FLASH_BANK_1
  *         @arg @ref LL_FLASH_BANK_2
  * @param  area
  *         This parameter can be one of the following values:
  *         @arg @ref LL_FLASH_OB_BANK_AREA_A
  *         @arg @ref LL_FLASH_OB_BANK_AREA_B
  * @param  start_page
  *         This parameter can be a value between 0x00U and the maximum number of pages per bank.
  * @param  end_page
  *         This parameter can be a value between 0x00U and the maximum number of pages per bank.
  */
__STATIC_INLINE void LL_FLASH_OB_BANK_ConfigAreaWRP(FLASH_TypeDef *flashx,
                                                    uint32_t bank,
                                                    uint32_t area,
                                                    uint32_t start_page,
                                                    uint32_t end_page)
{
  __IO uint32_t *reg_addr = &flashx->WRP1AR + bank + area;
  MODIFY_REG(*reg_addr, (FLASH_WRP1AR_WRP1A_PSTRT | FLASH_WRP1AR_WRP1A_PEND),
             (start_page | (end_page << FLASH_WRP1AR_WRP1A_PEND_Pos)));
}

/**
  * @brief  Get the flash start page of the write protection area per bank area.
  * @rmtoll
  *  WRP1AR          WRP1A_PSTRT         LL_FLASH_OB_BANK_GetAreaWRPStartPage \n
  *  WRP2AR          WRP2A_PSTRT         LL_FLASH_OB_BANK_GetAreaWRPStartPage \n
  *  WRP1BR          WRP1B_PSTRT         LL_FLASH_OB_BANK_GetAreaWRPStartPage \n
  *  WRP2BR          WRP2B_PSTRT         LL_FLASH_OB_BANK_GetAreaWRPStartPage
  * @param  FLASH instance.
  * @param  bank
  *         This parameter can be one of the following values:
  *         @arg @ref LL_FLASH_BANK_1
  *         @arg @ref LL_FLASH_BANK_2
  * @param  area
  *         This parameter can be one of the following values:
  *         @arg @ref LL_FLASH_OB_BANK_AREA_A
  *         @arg @ref LL_FLASH_OB_BANK_AREA_B
  * @retval Returned value can be a value between 0x00U and the maximum number of pages per bank.
  */
__STATIC_INLINE uint32_t LL_FLASH_OB_BANK_GetAreaWRPStartPage(const FLASH_TypeDef *flashx, uint32_t bank, uint32_t area)
{
  const __IO uint32_t *reg_addr = &flashx->WRP1AR + bank + area;
  return (READ_BIT(*reg_addr, FLASH_WRP1AR_WRP1A_PSTRT));
}

/**
  * @brief  Get the flash end page of the write protection area per bank area.
  * @rmtoll
  *  WRP1AR          WRP1A_PEND         LL_FLASH_OB_BANK_GetAreaWRPEndPage \n
  *  WRP2AR          WRP2A_PEND         LL_FLASH_OB_BANK_GetAreaWRPEndPage \n
  *  WRP1BR          WRP1B_PEND         LL_FLASH_OB_BANK_GetAreaWRPEndPage \n
  *  WRP2BR          WRP2B_PEND         LL_FLASH_OB_BANK_GetAreaWRPEndPage
  * @param  FLASH instance.
  * @param  bank
  *         This parameter can be one of the following values:
  *         @arg @ref LL_FLASH_BANK_1
  *         @arg @ref LL_FLASH_BANK_2
  * @param  area
  *         This parameter can be one of the following values:
  *         @arg @ref LL_FLASH_OB_BANK_AREA_A
  *         @arg @ref LL_FLASH_OB_BANK_AREA_B
  * @retval Returned value can be a value between 0x00U and the maximum number of pages per bank.
  */
__STATIC_INLINE uint32_t LL_FLASH_OB_BANK_GetAreaWRPEndPage(const FLASH_TypeDef *flashx, uint32_t bank, uint32_t area)
{
  const __IO uint32_t *reg_addr = &flashx->WRP1AR + bank + area;
  return (READ_BIT(*reg_addr, FLASH_WRP1AR_WRP1A_PEND));
}

/**
  * @brief  Lock the flash write protection area by bank by area.
  * @rmtoll WRP1AR/WRP2AR/WRP1BR/WRP2BR    UNLOCK    LL_FLASH_OB_BANK_LockAreaWRP
  * @param  FLASH instance.
  * @param  bank
  *         This parameter can be one of the following values:
  *         @arg @ref LL_FLASH_BANK_1
  *         @arg @ref LL_FLASH_BANK_2
  * @param  area
  *         This parameter can be one of the following values:
  *         @arg @ref LL_FLASH_OB_BANK_AREA_A
  *         @arg @ref LL_FLASH_OB_BANK_AREA_B
  */
__STATIC_INLINE void LL_FLASH_OB_BANK_LockAreaWRP(FLASH_TypeDef *flashx, uint32_t bank, uint32_t area)
{
  __IO uint32_t *reg_addr = &flashx->WRP1AR + bank + area;
  CLEAR_BIT(*reg_addr, FLASH_WRP1AR_UNLOCK);
}

/**
  * @brief  Unlock the flash write protection area by bank and area.
  * @rmtoll WRP1AR/WRP2AR/WRP1BR/WRP2BR    UNLOCK    LL_FLASH_OB_BANK_UnlockAreaWRP
  * @param  FLASH instance.
  * @param  bank
  *         This parameter can be one of the following values:
  *         @arg @ref LL_FLASH_BANK_1
  *         @arg @ref LL_FLASH_BANK_2
  * @param  area
  *         This parameter can be one of the following values:
  *         @arg @ref LL_FLASH_OB_BANK_AREA_A
  *         @arg @ref LL_FLASH_OB_BANK_AREA_B
  */
__STATIC_INLINE void LL_FLASH_OB_BANK_UnlockAreaWRP(FLASH_TypeDef *flashx, uint32_t bank, uint32_t area)
{
  __IO uint32_t *reg_addr = &flashx->WRP1AR + bank + area;
  SET_BIT(*reg_addr, FLASH_WRP1AR_UNLOCK);
}

/**
  * @brief  Check the flash write protection area lock state by bank by area.
  * @rmtoll WRP1AR/WRP2AR/WRP1BR/WRP2BR    UNLOCK    LL_FLASH_OB_BANK_IsLockedAreaWRP
  * @param  FLASH instance.
  * @param  bank
  *         This parameter can be one of the following values:
  *         @arg @ref LL_FLASH_BANK_1
  *         @arg @ref LL_FLASH_BANK_2
  * @param  area
  *         This parameter can be one of the following values:
  *         @arg @ref LL_FLASH_OB_BANK_AREA_A
  *         @arg @ref LL_FLASH_OB_BANK_AREA_B
  * @retval State of flash option bytes write protection area A configuration lock (1 locked / 0 unlocked).
  */
__STATIC_INLINE uint32_t LL_FLASH_OB_BANK_IsLockedAreaWRP(const FLASH_TypeDef *flashx, uint32_t bank, uint32_t area)
{
  const __IO uint32_t *reg_addr = &flashx->WRP1AR + bank + area;
  return ((READ_BIT(*reg_addr, FLASH_WRP1AR_UNLOCK) == ((FLASH_WRP1AR_UNLOCK))) ? 0UL : 1UL);
}

/**
  * @brief  Set the flash OEM1 least significant bytes key.
  * @rmtoll
  *  OEM1KEYR1          OEM1KEY          LL_FLASH_SetOEM1KeyLowBytes
  * @param  FLASH instance.
  * @param  oem1_key1
  *         This parameter can be a value between 0x00000000U and 0xFFFFFFFFU.
  */
__STATIC_INLINE void LL_FLASH_SetOEM1KeyLowBytes(FLASH_TypeDef *flashx, uint32_t oem1_key1)
{
  WRITE_REG(flashx->OEM1KEYR1, oem1_key1);
}

/**
  * @brief  Set the flash OEM1 most significant bytes key.
  * @rmtoll
  *  OEM1KEYR2          OEM1KEY          LL_FLASH_SetOEM1KeyHighBytes
  * @param  FLASH instance.
  * @param  oem1_key2
  *         This parameter can be a value between 0x00000000U and 0xFFFFFFFFU.
  */
__STATIC_INLINE void LL_FLASH_SetOEM1KeyHighBytes(FLASH_TypeDef *flashx, uint32_t oem1_key2)
{
  WRITE_REG(flashx->OEM1KEYR2, oem1_key2);
}

/**
  * @brief  Set the flash OEM2 least significant bytes key.
  * @rmtoll
  *  OEM2KEYR1          OEM2KEY          LL_FLASH_SetOEM2KeyLowBytes
  * @param  FLASH instance.
  * @param  oem2_key1
  *         This parameter can be a value between 0x00000000U and 0xFFFFFFFFU.
  */
__STATIC_INLINE void LL_FLASH_SetOEM2KeyLowBytes(FLASH_TypeDef *flashx, uint32_t oem2_key1)
{
  WRITE_REG(flashx->OEM2KEYR1, oem2_key1);
}

/**
  * @brief  Set the flash OEM2 most significant bytes key.
  * @rmtoll
  *  OEM2KEYR2          OEM2KEY          LL_FLASH_SetOEM2KeyHighBytes
  * @param  FLASH instance.
  * @param  oem2_key2
  *         This parameter can be a value between 0x00000000U and 0xFFFFFFFFU.
  */
__STATIC_INLINE void LL_FLASH_SetOEM2KeyHighBytes(FLASH_TypeDef *flashx, uint32_t oem2_key2)
{
  WRITE_REG(flashx->OEM2KEYR2, oem2_key2);
}

/**
  * @brief  Set the flash OEMx least significant bytes key.
  * @rmtoll OEM1KEYR1/OEM2KEYR1          OEM1KEY/OEM2KEY          LL_FLASH_SetOEMxKeyLowBytes
  * @param  FLASH instance.
  * @param  oem_idx
  *         This parameter can be one of the following values:
  *         @arg @ref LL_FLASH_OB_OEM_1
  *         @arg @ref LL_FLASH_OB_OEM_2
  * @param  oemx_key1
  *         This parameter can be a value between 0x00000000U and 0xFFFFFFFFU.
  */
__STATIC_INLINE void LL_FLASH_SetOEMxKeyLowBytes(FLASH_TypeDef *flashx, uint32_t oem_idx, uint32_t oemx_key1)
{
  __IO uint32_t *reg_addr = &flashx->OEM1KEYR1 + oem_idx;
  WRITE_REG(*reg_addr, oemx_key1);
}

/**
  * @brief  Set the flash OEMx most significant bytes key.
  * @rmtoll OEM1KEYR2/OEM2KEYR2          OEM1KEY/OEM2KEY          LL_FLASH_SetOEMxKeyHighBytes
  * @param  FLASH instance.
  * @param  oem_idx
  *         This parameter can be one of the following values:
  *         @arg @ref LL_FLASH_OB_OEM_1
  *         @arg @ref LL_FLASH_OB_OEM_2
  * @param  oemx_key2
  *         This parameter can be a value between 0x00000000U and 0xFFFFFFFFU.
  */
__STATIC_INLINE void LL_FLASH_SetOEMxKeyHighBytes(FLASH_TypeDef *flashx, uint32_t oem_idx, uint32_t oemx_key2)
{
  __IO uint32_t *reg_addr = &flashx->OEM1KEYR2 + oem_idx;
  WRITE_REG(*reg_addr, oemx_key2);
}

