STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/ll/stm32u5xx_ll_flash.h
#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
/**
  * @brief  Set the flash security attribute for the bank block based.
  * @rmtoll SECBB1Rx/SECBB2Rx [x : 0 to 8]   SEC1BBi/SEC2BBi [i : 0 to 31]   LL_FLASH_BANK_SetBBSecure
  * @param  FLASH instance.
  * @param  bank
  *         This parameter can be one of the following values:
  *         @arg @ref LL_FLASH_BANK_1
  *         @arg @ref LL_FLASH_BANK_2
  * @param  bank_group
  *         This parameter can be one of the following values:
  *         @arg @ref LL_FLASH_BANK_GRP1
  * @if SRAM3_BASE
  *         @arg @ref LL_FLASH_BANK_GRP2
  *         @arg @ref LL_FLASH_BANK_GRP3
  *         @arg @ref LL_FLASH_BANK_GRP4
  * @endif
  * @if SRAM5_BASE
  *         @arg @ref LL_FLASH_BANK_GRP5
  *         @arg @ref LL_FLASH_BANK_GRP6
  *         @arg @ref LL_FLASH_BANK_GRP7
  *         @arg @ref LL_FLASH_BANK_GRP8
  * @endif
  * @param  sec_attr
  *         This parameter can be a value between Min_Data=0x00000000U to Max_Data=0xFFFFFFFFU
  */
__STATIC_INLINE void LL_FLASH_BANK_SetBBSecure(FLASH_TypeDef *flashx,
                                               uint32_t bank,
                                               uint32_t bank_group,
                                               uint32_t sec_attr)
{
  __IO uint32_t *reg_addr = &flashx->SECBB1R1 + (bank * 0x2UL) + bank_group;
  WRITE_REG(*reg_addr, sec_attr);
}
#endif /* __ARM_FEATURE_CMSE */

/**
  * @brief  Get the flash security attribute for the bank block based.
  * @rmtoll SECBB1Rx/SECBB2Rx [x : 0 to 8]   SEC1BBi/SEC2BBi [i : 0 to 31]   LL_FLASH_BANK_GetBBSecure
  * @param  FLASH instance.
  * @param  bank
  *         This parameter can be one of the following values:
  *         @arg @ref LL_FLASH_BANK_1
  *         @arg @ref LL_FLASH_BANK_2
  * @param  bank_group
  *         This parameter can be one of the following values:
  *         @arg @ref LL_FLASH_BANK_GRP1
  * @if SRAM3_BASE
  *         @arg @ref LL_FLASH_BANK_GRP2
  *         @arg @ref LL_FLASH_BANK_GRP3
  *         @arg @ref LL_FLASH_BANK_GRP4
  * @endif
  * @if SRAM5_BASE
  *         @arg @ref LL_FLASH_BANK_GRP5
  *         @arg @ref LL_FLASH_BANK_GRP6
  *         @arg @ref LL_FLASH_BANK_GRP7
  *         @arg @ref LL_FLASH_BANK_GRP8
  * @endif
  * @retval Returned value can be a value between 0x00000000U and 0xFFFFFFFFU.
  */
__STATIC_INLINE uint32_t LL_FLASH_BANK_GetBBSecure(const FLASH_TypeDef *flashx, uint32_t bank, uint32_t bank_group)
{
  const __IO uint32_t *reg_addr = &flashx->SECBB1R1 + (bank * 0x2UL) + bank_group;
  return (READ_REG(*reg_addr));
}

/**
  * @brief  Set the flash privilege attribute for the bank block based.
  * @rmtoll PRIVBB1Rx/PRIVBB2Rx [x : 0 to 8]   PRIV1BBi/PRIV2BBi [i : 0 to 31]   LL_FLASH_BANK_SetBBPrivilege
  * @param  FLASH instance.
  * @param  bank
  *         This parameter can be one of the following values:
  *         @arg @ref LL_FLASH_BANK_1
  *         @arg @ref LL_FLASH_BANK_2
  * @param  bank_group
  *         This parameter can be one of the following values:
  *         @arg @ref LL_FLASH_BANK_GRP1
  * @if SRAM3_BASE
  *         @arg @ref LL_FLASH_BANK_GRP2
  *         @arg @ref LL_FLASH_BANK_GRP3
  *         @arg @ref LL_FLASH_BANK_GRP4
  * @endif
  * @if SRAM5_BASE
  *         @arg @ref LL_FLASH_BANK_GRP5
  *         @arg @ref LL_FLASH_BANK_GRP6
  *         @arg @ref LL_FLASH_BANK_GRP7
  *         @arg @ref LL_FLASH_BANK_GRP8
  * @endif
  * @param  priv_attr
  *         This parameter can be a value between Min_Data=0x00000000U to Max_Data=0xFFFFFFFFU
  */
__STATIC_INLINE void LL_FLASH_BANK_SetBBPrivilege(FLASH_TypeDef *flashx, uint32_t bank, uint32_t bank_group,
                                                  uint32_t priv_attr)
{
  __IO uint32_t *reg_addr = &flashx->PRIVBB1R1 + (bank * 0x2UL) + bank_group;
  WRITE_REG(*reg_addr, priv_attr);
}

/**
  * @brief  Get the flash privilege attribute for the bank block based.
  * @rmtoll PRIVBB1Rx/PRIVBB2Rx [x : 0 to 8]   PRIV1BBi/PRIV2BBi [i : 0 to 31]   LL_FLASH_BANK_GetBBPrivilege
  * @param  FLASH instance.
  * @param  bank
  *         This parameter can be one of the following values:
  *         @arg @ref LL_FLASH_BANK_1
  *         @arg @ref LL_FLASH_BANK_2
  * @param  bank_group
  *         This parameter can be one of the following values:
  *         @arg @ref LL_FLASH_BANK_GRP1
  * @if SRAM3_BASE
  *         @arg @ref LL_FLASH_BANK_GRP2
  *         @arg @ref LL_FLASH_BANK_GRP3
  *         @arg @ref LL_FLASH_BANK_GRP4
  * @endif
  * @if SRAM5_BASE
  *         @arg @ref LL_FLASH_BANK_GRP5
  *         @arg @ref LL_FLASH_BANK_GRP6
  *         @arg @ref LL_FLASH_BANK_GRP7
  *         @arg @ref LL_FLASH_BANK_GRP8
  * @endif
  * @retval Returned value can be a value between 0x00000000U and 0xFFFFFFFFU.
  */
__STATIC_INLINE uint32_t LL_FLASH_BANK_GetBBPrivilege(const FLASH_TypeDef *flashx, uint32_t bank, uint32_t bank_group)
{
  const __IO uint32_t *reg_addr = &flashx->PRIVBB1R1 + (bank * 0x2UL) + bank_group;
  return (READ_REG(*reg_addr));
}

#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
/**
  * @brief  Disable the flash hide protection area access.
  * @rmtoll SECHDPCR          HDP1_ACCDIS/HDP2_ACCDIS          LL_FLASH_BANK_DisableHDPAreaAccess
  * @param  FLASH instance.
  * @param  hdp_bank
  *         This parameter can be one of the following values:
  *         @arg @ref LL_FLASH_HDP_ACCESS_BANK_1
  *         @arg @ref LL_FLASH_HDP_ACCESS_BANK_2
  */
__STATIC_INLINE void LL_FLASH_BANK_DisableHDPAreaAccess(FLASH_TypeDef *flashx, uint32_t hdp_bank)
{
  SET_BIT(flashx->SECHDPCR, hdp_bank);
}

/**
  * @brief  Check if the flash hide protection area access is enabled or disabled.
  * @rmtoll SECHDPCR          HDP1_ACCDIS/HDP2_ACCDIS          LL_FLASH_BANK_IsEnabledHDPAreaAccess
  * @param  FLASH instance.
  * @param  hdp_bank
  *         This parameter can be one of the following values:
  *         @arg @ref LL_FLASH_HDP_ACCESS_BANK_1
  *         @arg @ref LL_FLASH_HDP_ACCESS_BANK_2
  * @retval State of flash hide protection area access (1 enabled / 0 disabled).
  */
__STATIC_INLINE uint32_t LL_FLASH_BANK_IsEnabledHDPAreaAccess(const FLASH_TypeDef *flashx, uint32_t hdp_bank)
{
  return ((READ_BIT(flashx->SECHDPCR, hdp_bank) == hdp_bank) ? 0UL : 1UL);
}

/**
  * @brief  Enable the flash privileged protection for the secure registers.
  * @rmtoll
  *  PRIVCFGR          SPRIV          LL_FLASH_EnableSecurePrivilege
  * @param  FLASH instance.
  */
__STATIC_INLINE void LL_FLASH_EnableSecurePrivilege(FLASH_TypeDef *flashx)
{
  SET_BIT(flashx->PRIVCFGR, FLASH_PRIVCFGR_SPRIV);
}

/**
  * @brief  Disable the flash privileged protection for the secure registers.
  * @rmtoll
  *  PRIVCFGR          SPRIV          LL_FLASH_DisableSecurePrivilege
  * @param  FLASH instance.
  */
__STATIC_INLINE void LL_FLASH_DisableSecurePrivilege(FLASH_TypeDef *flashx)
{
  CLEAR_BIT(flashx->PRIVCFGR, FLASH_PRIVCFGR_SPRIV);
}
#endif /* __ARM_FEATURE_CMSE */

/**
  * @brief  Check if the flash privileged protection for the secure registers is enabled or disabled.
  * @rmtoll
  *  PRIVCFGR          SPRIV          LL_FLASH_IsEnabledSecurePrivilege
  * @param  FLASH instance.
  * @retval State of flash secure privilege (1 enabled / 0 disabled).
  */
__STATIC_INLINE uint32_t LL_FLASH_IsEnabledSecurePrivilege(const FLASH_TypeDef *flashx)
{
  return ((READ_BIT(flashx->PRIVCFGR, FLASH_PRIVCFGR_SPRIV) == (FLASH_PRIVCFGR_SPRIV)) ? 1UL : 0UL);
}

/**
  * @brief  Enable the flash privileged protection for the non-secure registers.
  * @rmtoll
  *  PRIVCFGR          NSPRIV          LL_FLASH_EnableNSecurePrivilege
  * @param  FLASH instance.
  */
__STATIC_INLINE void LL_FLASH_EnableNSecurePrivilege(FLASH_TypeDef *flashx)
{
  SET_BIT(flashx->PRIVCFGR, FLASH_PRIVCFGR_NSPRIV);
}

/**
  * @brief  Disable the flash privileged protection for the non-secure registers.
  * @rmtoll
  *  PRIVCFGR          NSPRIV          LL_FLASH_DisableNSecurePrivilege
  * @param  FLASH instance.
  */
__STATIC_INLINE void LL_FLASH_DisableNSecurePrivilege(FLASH_TypeDef *flashx)
{
  CLEAR_BIT(flashx->PRIVCFGR, FLASH_PRIVCFGR_NSPRIV);
}

/**
  * @brief  Check if the flash privileged protection for the non-secure registers is enabled or disabled.
  * @rmtoll
  *  PRIVCFGR          NSPRIV          LL_FLASH_IsEnabledNSecurePrivilege
  * @param  FLASH instance.
  * @retval State of flash non-secure privilege (1 enabled / 0 disabled).
  */
__STATIC_INLINE uint32_t LL_FLASH_IsEnabledNSecurePrivilege(const FLASH_TypeDef *flashx)
{
  return ((READ_BIT(flashx->PRIVCFGR, FLASH_PRIVCFGR_NSPRIV) == (FLASH_PRIVCFGR_NSPRIV)) ? 1UL : 0UL);
}
/**
  * @}
  */
#endif /* defined (FLASH) */

/**
  * @}
  */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif /* __cplusplus */

#endif /* STM32U5XX_LL_FLASH_H */
